using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
namespace SagaScript.M32200000
{
    public class S11001640 : Event
    {
        public S11001640()
        {
            this.EventID = 11001640;
        }

        public override void OnEvent(ActorPC pc)
        {
            switch (Select(pc, "要怎麽辦？", "", "任務櫃臺", "詢問戰場冠軍", "詢問有關抵抗運動", "最開始推薦攻擊的敵人？", "關于周邊的魔物", "什麽都不做"))
            {
                case 2:
                    Say(pc, 131, "战场冠军$R;" +
                        "在这个世界只存在10人$R;" +
                        "是一些拥有着特殊能力的人。$R;" +
                        "$P详细信息请咨询总部前面$R;" +
                        "的掲示板的掲示板旁边的$R;" +
                        "戦の調律者$R;", "抵抗運動接待處");
                    break;
                case 3:
                    Say(pc, 131, "我们与侵略者战斗$R;" +
                       "继续着将夺回「阿高普路斯市」为目标$R;" +
                       "的抵抗运动。$R;" +
                       "$P如果你对此有兴趣$R;" +
                       "就到设立在「西部要塞城」$R;" +
                       "的总部报道吧。$R;" +
                       "$P西部要塞城的话$R;" +
                       "要从这里乘坐飛空庭$R;" +
                       "跨过奥克鲁尼亚大陆$R;" +
                       "再穿越沙漠就能到达了。$R;" +
                       "$P西部要塞城附近$R;" +
                       "虽说还算安全，但是$R;" +
                       "途中可能会出现危险的魔物。$R;" +
                       "$P也可以绕道通过，不过$R;" +
                       "如果被缠住了的话$R;" +
                       "可以骑上一个「騎乗宠物」$R;" +
                       "来继续移动哦。$R;", "抵抗運動接待處");
                    break;
                case 4:
                    Say(pc, 11001589, 131, "ＬＶ１～：馬路斯$R;" +
                    "ＬＶ５～：ピヨピヨ$R;" +
                    "ＬＶ８～：ゴーチン$R;" +
                    "ＬＶ１３～：マスケシュピンネ$R;" +
                    "ＬＶ１６～：ルナティック$R;", "抵抗運動接待處");
                    break;
                case 5:
                    Say(pc, 11001589, 131, "在軍艦島棲息着馬路斯、ピヨピヨ$R;" +
                    "ゴーチン、マスケシュピンネ$R;" +
                    "ルナティック等生物哦。$R;" +
                    "$P在西部要塞周邊也生活着有$R;" +
                    "類似的生物，因此也可以去那邊$R;" +
                    "狩獵。$R;" +
                    "$P在晚上、ドク馬路斯$R;" +
                    "マスケシュピンネ$R;" +
                    "フレイムゴーチン$R;" +
                    "スプライト、サラマンダー$R;" +
                    "等魔物就會出現。$R;" +
                    "$Pフレイムゴーチン、スプライト$R;" +
                    "サラマンダー這些魔物很强，$R;" +
                    "所以像我這樣等級低人$R;" +
                    "還是最好不要向他們出手了。$R;", "抵抗運動接待處");
                    break;
                case 6:
                    Say(pc, 131, "小战士。$R;" +
                        "$R愿你高贵的灵魂$R;" +
                        "不要被这世界污染了……。$R;", "抵抗運動接待處");
                    break;
            }

        
        }
    }
}


        
   


