using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M10035000
{
    public class S11000800 : Event
    {
        public S11000800()
        {
            this.EventID = 11000800;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<NDFlags> ND_mask = pc.CMask["ND"];
            BitMask<Degura> Degura_mask = pc.CMask["Degura"];
            BitMask<Neko_04> Neko_04_amask = pc.AMask["Neko_04"];
            BitMask<Neko_04> Neko_04_cmask = pc.CMask["Neko_04"];
            BitMask<Neko_06> Neko_06_amask = pc.AMask["Neko_06"];
            BitMask<Neko_06> Neko_06_cmask = pc.CMask["Neko_06"];

            if (Neko_06_amask.Test(Neko_06.杏子任务开始) &&
                !Neko_06_amask.Test(Neko_06.获得杏子) &&
                Neko_04_amask.Test(Neko_04.任務結束) &&
                Neko_06_cmask.Test(Neko_06.獲知恢復的方法) &&
                !Neko_06_cmask.Test(Neko_06.獲得山吹的碎片))
            {

                Wait(pc, 990);
                ShowEffect(pc, 5058);
                Wait(pc, 990);
                ShowEffect(pc, 5179);
                Wait(pc, 1980);

                Say(pc, 0, 131, "（……あっ！$R;" +
                "$Rなんだか懐かしい気配がする…？！$R;" +
                "$Rこの気配は………山吹！！）$R;", " ");

                Say(pc, 0, 131, "にゃお〜〜〜ん！$R;", " ");
                Wait(pc, 990);
                PlaySound(pc, 4012, false, 100, 50);
                ShowEffect(pc, 4131);
                Wait(pc, 5940);

                Say(pc, 0, 131, "『背負い魔・ネコマタ（山吹）』$Rの心を取り戻した！$R;", " ");

                Say(pc, 0, 131, "お姉ちゃん！$R;", "ネコマタ（杏）");

                Say(pc, 0, 131, "杏！？$R;" +
                "$Rあれ？…ウチ…$R;" +
                "$Rなんでこんなとこおるん……？$R;" +
                "$R…うわっ！汗拭きっ！？$R;", "ネコマタ（山吹）");

                Say(pc, 0, 131, "（ほっ…$Rやっぱりここだった…よかった。）$R;", " ");
                Neko_06_cmask.SetValue(Neko_06.獲得山吹的碎片, true);
                return;
            }

            if (Neko_04_amask.Test(Neko_04.任務開始) && 
                !Neko_04_amask.Test(Neko_04.任務結束) &&
                Neko_04_cmask.Test(Neko_04.返回彙報結果) &&
                Neko_04_cmask.Test(Neko_04.超重))
            {
                if (CheckInventory(pc, 10017905, 1))
                {
                    GiveItem(pc, 10017905, 1);
                    Neko_04_amask.SetValue(Neko_04.任務結束, true);
                    if (Neko_04_cmask.Test(Neko_04.超重))
                    {
                        Neko_04_cmask.SetValue(Neko_04.超重, false);
                        PlaySound(pc, 2040, false, 100, 50);
                        Say(pc, 11000800, 131, "想要收下这黄色的布，得努力呀$R;");
                        return;
                    }
                    return;
                }
                Neko_04_cmask.SetValue(Neko_04.超重, true);
                Say(pc, 11000800, 131, "哈哈！$R那黄色的布不就是我的汗巾吗？$R;" +
                    "$R什么？想要？$R您帮了我大忙，$R所以您要什么都可以给您哦$R;" +
                    "$P不过您的行李太多了，$R好像无法收下呀$R;" +
                    "$R我先帮您拿着$R您去把行李减少后再来吧$R;");
                return;
            }
            if (Neko_04_amask.Test(Neko_04.任務開始) &&
                !Neko_04_amask.Test(Neko_04.任務結束) &&
                Neko_04_cmask.Test(Neko_04.交回不明部品) &&
                !Neko_04_cmask.Test(Neko_04.返回彙報結果) &&
                pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.PET))
            {
                if (pc.Inventory.Equipments[EnumEquipSlot.PET].ItemID == 10017900)
                {
                    Neko_04_cmask.SetValue(Neko_04.返回彙報結果, true);
                    Say(pc, 11000800, 131, "哦！找到那个零件后$R送到行会主人那是吗？$R;" +
                        "$R辛苦了！谢谢！$R;" +
                        "$P不过，那个犯人是哪个家伙呢？$R;" +
                        "$P…$R;" +
                        "$P…$R;" +
                        "$R从阿克罗波利斯建成以来$R行会宫殿5楼就是一种治外法权$R;" +
                        "$P即使是评议会也没有权利干涉呢$R;" +
                        "$R不能看到的，也不能听到的$R;" +
                        "$P不过…$R从行会宫殿谜之团的房间里$R发现动静的情况在$R我知道的事情中是第一次$R;" +
                        "$R…有种不祥的…预感呀$R;");
                    Say(pc, 0, 131, "…桃子！$R;", "\"猫灵（山吹）\"");
                    Say(pc, 0, 131, "叫我吗？有什么事呢？$R您看起来好像很消沉唷$R;", "\"猫灵（桃子）\"");
                    Say(pc, 0, 131, "我要回到商人叔叔那里了$R;", "\"猫灵（山吹）\"");
                    Say(pc, 0, 131, "什么？为什么?$R怎么那么突然啊$R;", "\"猫灵（桃子）\"");
                    Say(pc, 0, 131, "我明白了，这人就是桃子你的主人$R;" +
                        "$R虽然…无法用语言来表达，$R但把他想成属于谁的是不对的呀$R;" +
                        "$P我无法理解$R桃子你对主人的那份感情$R;", "\"猫灵（山吹）\"");
                    Say(pc, 0, 131, "嗯…！$R好不容易在一起却…$R;" +
                        "$R一个人会孤独的，$R跟我一起好吗…$R;" +
                        "$P对了！$R;" +
                        "$R刚才见到了裁缝阿姨…$R…见到姐姐了是吧？$R;" +
                        "$P附在『裁缝阿姨的三角巾』$R那里就可以了！$R我也是用这种方式$R跟着现在的主人…$R;" +
                        "$R…什么？$R;" +
                        "$P哎哟！已经得到『三角巾』了？$R;" +
                        "$R真的…山吹…不要叫阿姨啊…$R;", "\"猫灵（桃子）\"");
                    if (CountItem(pc, 10017902) >= 1 && CountItem(pc, 10017903) >= 1)
                    {
                        Say(pc, 0, 131, "不想分开呀…$R;", "\"猫灵（绿子）\"");
                        Say(pc, 0, 131, "…我也不想分开…$R;", "\"猫灵（蓝子）\"");
                        Say(pc, 0, 131, "…桃子还有你们大家$R真的谢谢你们，$R我不会忘记的$R;" +
                            "\"$R即使分开了，我们还是姐妹哦\"$R;", "\"猫灵（山吹）\"");
                        Say(pc, 0, 131, "山吹！！！$R;", "\"猫灵（桃子）\"");
                    }
                    else if (CountItem(pc, 10017902) >= 1)
                    {
                        Say(pc, 0, 131, "不想分开呀…$R;", "\"猫灵（绿子）\"");
                        Say(pc, 0, 131, "…桃子还有你们大家$R真的谢谢你们，$R我不会忘记的$R;" +
                            "\"$R即使分开了，我们还是姐妹哦\"$R;", "\"猫灵（山吹）\"");
                        Say(pc, 0, 131, "山吹！！！$R;", "\"猫灵（桃子）\"");
                    }
                    else if (CountItem(pc, 10017903) >= 1)
                    {
                        Say(pc, 0, 131, "…我也不想分开…$R;", "\"猫灵（蓝子）\"");
                        Say(pc, 0, 131, "…桃子还有你们大家$R真的谢谢你们，$R我不会忘记的$R;" +
                            "\"$R即使分开了，我们还是姐妹哦\"$R;", "\"猫灵（山吹）\"");
                        Say(pc, 0, 131, "山吹！！！$R;", "\"猫灵（桃子）\"");
                    }
                    else
                    {
                        Say(pc, 0, 131, "\"…桃子，谢谢，我不会忘记你的\"$R;" +
                            "\"$R即使分开了，我们还是姐妹哦\"$R;", "\"猫灵（山吹）\"");
                        Say(pc, 0, 131, "山吹！$R;", "\"猫灵（桃子）\"");
                    }
                    Say(pc, 0, 131, "喵$R;");
                    Wait(pc, 1000);
                    PlaySound(pc, 4012, false, 100, 50);
                    ShowEffect(pc, 4131);
                    Wait(pc, 6000);
                    Say(pc, 0, 131, "得到了『猫灵（山吹）』$R;");
                    Say(pc, 0, 131, "…哎哟？！这是怎么回事？$R山吹！附身在这里了？$R;", "\"猫灵（桃子）\"");
                    Say(pc, 0, 131, "我…怎么回事？$R;", "\"猫灵（山吹）\"");
                    Say(pc, 0, 131, "…怎么会有这种事情？！$R没有『裁缝阿姨的三角巾』啊$R怎么会…$R;", "\"猫灵（桃子）\"");
                    Say(pc, 11000800, 131, "哎哟！放在兜里的汗巾不见了？$R;");
                    Say(pc, 0, 131, "「汗巾」…$R;", "\"猫灵（山吹）\"");
                    Say(pc, 0, 131, "是不是…$R;", "\"猫灵（桃子）\"");
                    Say(pc, 11000800, 131, "上次到上城裁缝所送东西时$R;" +
                        "$R店员看到我的脸$R给了我一块很奇怪的布$R;" +
                        "$P还说了灵魂什么的$R;" +
                        "$R不知道是什么意思，就当汗巾用了$R;");
                    Say(pc, 0, 131, "哇！主人！！主人！！！$R;" +
                        "$R快！！快！！洗一下！！！…$R;", "\"猫灵（山吹）\"");
                    if (CountItem(pc, 10017902) >= 1 && CountItem(pc, 10017903) >= 1)
                    {
                        Say(pc, 0, 131, "那个三角巾真是…$R黄…$R;", "\"猫灵（绿子）\"");
                        Say(pc, 0, 131, "山吹…好像有点味道呀$R;", "\"猫灵（蓝子）\"");
                        Say(pc, 0, 131, "哈哈！这是山吹色！！$R不是变黄，是山吹色啦！！$R本来就是这个颜色的$R;" +
                            "$R哈哈…主人!!快来!!!快帮我洗!!!…$R;", "\"猫灵（山吹）\"");
                    }
                    else if (CountItem(pc, 10017902) >= 1)
                    {
                        Say(pc, 0, 131, "我觉得那个三角巾…$R有点发黄啊…$R;", "\"猫灵（绿子）\"");
                        Say(pc, 0, 131, "哈哈！这是山吹色！！$R不是变黄，是山吹色！！$R本来就是这个颜色的$R;", "\"猫灵（山吹）\"");
                    }
                    else if (CountItem(pc, 10017903) >= 1)
                    {
                        Say(pc, 0, 131, "山吹…好像有点味道$R;", "\"猫灵（蓝子）\"");
                        Say(pc, 0, 131, "够了！够了！$R主人~~可不可以帮我洗…$R;", "\"猫灵（山吹）\"");
                    }
                    Say(pc, 0, 131, "在商人叔叔那里会把我当成汗巾的？$R;" +
                        "$R跟我们在一起吧$R现在开始，我们姐妹可以在一起了$R;" +
                        "$P以后多多关照哦！山吹$R;", "\"猫灵（桃子）\"");
                    Say(pc, 0, 131, "…这个三角巾$R就当作跑腿的报酬收下吧…$R;");
                    if (CheckInventory(pc, 10017905, 1))
                    {
                        GiveItem(pc, 10017905, 1);
                        Neko_04_amask.SetValue(Neko_04.任務結束, true);
                        if (Neko_04_cmask.Test(Neko_04.超重))
                        {
                            Neko_04_cmask.SetValue(Neko_04.超重, false);
                            PlaySound(pc, 2040, false, 100, 50);
                            Say(pc, 11000800, 131, "想要收下这黃色的布，得努力呀$R;");
                            return;
                        }
                        return;
                    }
                    Neko_04_cmask.SetValue(Neko_04.超重, true);
                    Say(pc, 11000800, 131, "哈哈！$R那黄色的布不就是我的汗巾吗？$R;" +
                        "$R什么？想要？$R您帮了我大忙，$R所以您要什么都可以给您哦$R;" +
                        "$P不过您的行李太多了，$R好像无法收下呀$R;" +
                        "$R我先帮您拿著$R您去把行李减少后再来吧$R;");

                    return;
                }
            }
            if (Neko_04_amask.Test(Neko_04.任務開始) &&
                !Neko_04_amask.Test(Neko_04.任務結束) &&
                Neko_04_cmask.Test(Neko_04.被詢問犯人的事) &&
                !Neko_04_cmask.Test(Neko_04.被告知去找機器人))
            {
                Neko_04_cmask.SetValue(Neko_04.被告知去找機器人, true);
                Say(pc, 11000800, 131, "什！什么？$R;" +
                    "$R什么？行李被偷了？$R;" +
                    "$P哎哟！这到底是怎么回事阿??$R;" +
                    "$R那个是非常重要的研究材料呀！！$R;" +
                    "$R这个笨蛋!!把事情搞砸了！！$R;");
                Say(pc, 0, 131, "唉！$R你的嘴巴是不是太过分了？！$R;", "\"猫灵（山吹）\"");
                if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.PET))
                {
                    if (pc.Inventory.Equipments[EnumEquipSlot.PET].ItemID == 10017900)
                    {
                        Say(pc, 0, 131, "山吹！？！$R;", "\"猫灵（桃子）\"");
                    }
                }
                Say(pc, 11000800, 131, "嗯？刚才说什么了？$R;" +
                    "$R…嗯，到底是谁，$R为什么把东西偷走了呢…$R;" +
                    "$P嗯？里面的是什么？$R;" +
                    "$R想知道吗？$R;" +
                    "$R想知道的话，可以告诉您喔$R;");
                Say(pc, 11000800, 131, "…$R;" +
                    "\"$R那个呀，$R是在阿克罗尼亚大陆西南方岛屿的$R「光之塔」里发掘的机械部件喔\"$R;" +
                    "$P「光之塔」是$R机械文明末期，建造的科学研究所$R;" +
                    "$R好像在研究复活生命$R以及保存的方式$R还有开发永恒的能源哦$R;" +
                    "$P…发掘那东西的机械师$R跟平时一样捡一些有用的零件$R;" +
                    "$R可能在那时候发现的吧$R;" +
                    "$P这个出土品是$R生平第一次见到的东西喔$R;" +
                    "$P没错$R那个部件不是我们祖先$R机械时代的科技制作的$R;" +
                    "$R也不是泰达尼亚统治时期制作的$R;" +
                    "$P完全是用另外一种$R高科技技术来制造的呀！！$R;");
                Say(pc, 11000800, 131, "那个机械师没有理由$R把零件拿到我这来呀$R;" +
                    "$P我想通过行会，详细调查零件，$R把这个送到阿克罗波利斯的$R机械神匠那里吧$R;" +
                    "$P…您想像一下，$R这个零件是$R在我们人类历史上最大$R战争灾难时期的断层发掘的$R;" +
                    "$P也许能够取得，$R我们未知的战争情报哦$R;" +
                    "$P…！！$R是不是有人为了掩盖什么…？？$R;" +
                    "$R嗯！这件事情好像隐藏著巨大内幕呀$R;");
                //EVT1100080021
                Say(pc, 11000800, 131, "总之现在只有把犯人找出来$R找回那个零件啊$R;" +
                    "$P在上城发生的话，$R就有抓犯人的好方法喔$R;" +
                    "$R问一下阿克罗波利斯的向导机器人吧$R;" +
                    "他们可以马上把显示器里$R显示的所有影像储存到记忆体$R;" +
                    "$P行会宫殿前的向导机器人$R应该有拍下犯人影像的资料哦$R;");
                return;
            }
            if (!Neko_04_amask.Test(Neko_04.任務開始) &&
                (Neko_04_cmask.Test(Neko_04.交出商人的傳達品) ||
                (!Neko_04_cmask.Test(Neko_04.交出商人的傳達品) &&
                pc.Fame > 9 && pc.Level > 29)) &&
                pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.PET))
            {
                if (pc.Inventory.Equipments[EnumEquipSlot.PET].ItemID == 10017900)
                {
                    Say(pc, 0, 131, "喵$R;", "\"???\"");
                    Say(pc, 0, 131, "…！？$R喵呜…！？$R;", "\"猫灵\"");
                    Say(pc, 11000800, 131, "什么？$R;" +
                        "$R又是哪来的哭声呀$R;" +
                        "$P身后又开始传来$R最近经常听到的哭声了$R;" +
                        "$R本来还以为是幻听啊$R您也听到了吗？$R;");
                    switch (Select(pc, "哭声…", "", "听见了", "是不是听错了"))
                    {
                        case 1:
                            Say(pc, 11000800, 131, "是吗？原来如此！$R;" +
                                "$R上次出发做买卖的时候$R就觉得很烦，$R原来不是只有我听见了$R;" +
                                "$P只要不影响做生意，无所谓啰$R;");
                            Say(pc, 11000800, 131, "啊，对了！！$R;" +
                                "$R正好，不好意思，$R可不可以拜托您一件事情呢？$R;" +
                                "$P请送一件道具到阿克罗波利斯$R行会宫殿4楼的商人行会那里吧$R;" +
                                "$P本来我应该直接送过去的$R可是我不能离开这儿呀$R;" +
                                "$R怎么样？可以帮我送过去吗？$R;");
                            switch (Select(pc, "怎么做呢？", "", "帮他送过去", "不去"))
                            {
                                case 1:
                                    Say(pc, 11000800, 131, "是吗？谢谢了！$R;" +
                                        "$R要送过去的是这个。$R有点重，小心点呀$R;");
                                    if (CheckInventory(pc, 50071151, 1))
                                    {
                                        if (CheckInventory(pc, 50071151, 1))
                                        {
                                            Neko_04_cmask.SetValue(Neko_04.收到商人的傳達品, true);
                                            Neko_04_amask.SetValue(Neko_04.任務開始, true);
                                            GiveItem(pc, 50071151, 1);
                                            PlaySound(pc, 2040, false, 100, 50);
                                            Say(pc, 0, 131, "得到了『商人拜托保管的手提箱』$R;");
                                            Say(pc, 11000800, 131, "把这个送到阿克罗波利斯行会宫殿的$R行会总管那吧$R;" +
                                                "$P手提箱里藏着$R能够改变我们人类未来的秘密哦$R;" +
                                                "不能偷看里面喔!$R当然不是不相信您啦$R;");
                                            Say(pc, 0, 131, "…?$R;");
                                            Say(pc, 0, 131, "喵$R;", "\"???\"");
                                            Say(pc, 0, 131, "山吹？$R;", "\"猫灵（桃子）\"");
                                            Say(pc, 0, 131, "这位好像有点商业天分$R;" +
                                                "好的！我涂上口水了$R;", "\"？？\"");
                                            Say(pc, 0, 131, "难道是？！山吹？！$R;" +
                                                "$R你是山吹吧？对吗？$R;", "\"猫灵（桃子）\"");
                                            Say(pc, 0, 131, "是桃子呀！$R;" +
                                                "$R好久不见了$R过的怎样呢？$R;" +
                                                "$P就像你看到的呀$R这个人现在是我的主人啦$R;" +
                                                "$R以后多多关照喔~$R;", "\"猫灵（山吹）\"");
                                            Say(pc, 0, 131, "\"什？什么！！$R等，等等！\"$R;" +
                                                "$R这个人是我先发现的啊！！$R;", "\"猫灵（桃子）\"");
                                            Say(pc, 0, 131, "哦…是吗？辛苦你了！！$R;" +
                                                "$R现在开始我会贴身照顾他的$R不用为他担心啦$R;", "\"猫灵（山吹）\"");
                                            Say(pc, 0, 131, "什么？什么话！！$R;" +
                                                "为什么我要让步啊！！$R;", "\"猫灵（桃子）\"");
                                            if (!(pc.Job > (PC_JOB)110 &&
                                            pc.Job < (PC_JOB)116))
                                            {
                                                Say(pc, 0, 131, "还有！$R这个人不是商人！$R;" +
                                                    "$R为什么随便指定别人是商人？！！$R;", "\"猫灵（桃子）\"");
                                            }
                                            if (CountItem(pc, 10017902) >= 1)
                                            {
                                                Say(pc, 0, 131, "…呀$R…有…有我的地方…$R;", "\"猫灵（绿子）\"");
                                                Say(pc, 0, 131, "绿安静点!$R;" +
                                                    "$R绿，你太吵了!$R;", "\"猫灵（桃子）");
                                                Say(pc, 0, 131, "…对…对不起…$R;" +
                                                    "$R我有点气过头了$R…真是够了$R;" +
                                                    "$R哎哟！！$R我的口气跟山吹差不多了?!$R怎么办呀！$R;", "\"猫灵（桃子）\"");
                                            }
                                            else if (CountItem(pc, 10017903) >= 1)
                                            {
                                                Say(pc, 0, 131, "那个…$R主人…是我的…$R;", "\"猫灵（蓝子）\"");
                                                Say(pc, 0, 131, "蓝安静点！$R;" +
                                                    "$R蓝很吵耶!$R;", "\"猫灵（桃子）");
                                                Say(pc, 0, 131, "…对…对不起…$R;" +
                                                    "$R我有点气过头了$R…真是够了$R;" +
                                                    "$R哎哟！！$R我的口气跟山吹差不多了?!$R怎么办呀！$R;", "\"猫灵（桃子）\"");
                                            }
                                            Say(pc, 11000800, 131, "…?$R;" +
                                                "$R什么声音？$R好像是从您那，传来烦人的哭声喔$R;" +
                                                "$R是不是听错了？$R;");
                                            Say(pc, 0, 131, "喵！！喵喵喵喵！！$R;" +
                                                "$R喵！！喵喵喵喵！喵喵喵！$R;");
                                            Say(pc, 0, 131, "…今天比平时更烦…$R;" +
                                                "$R好像有种不祥的预感呀！$R;");
                                            return;
                                        }
                                        Say(pc, 11000800, 131, "怎么回事！放上去就动不了了$R;" +
                                            "把行李减少后，再来吧$R;");
                                        return;
                                    }
                                    Say(pc, 11000800, 131, "怎么回事！行李好像太多了$R;" +
                                        "把行李减少后，再来吧$R;");
                                    break;
                                case 2:
                                    Say(pc, 11000800, 131, "那么没办法了$R;");
                                    Say(pc, 0, 131, "喵…$R;", "\"???\"");
                                    break;
                            }
                            break;
                        case 2:
                            Say(pc, 11000800, 131, "是吗？$R;" +
                                "$R哦，可能年纪大了$R;");
                            break;
                    }
                    return;
                }
            }//*/

            if (ND_mask.Test(NDFlags.窮途末路的商人结束) &&
                (CountItem(pc, 10050851) >= 1 ||
                CountItem(pc, 10050852) >= 1))
            {
                if (!Degura_mask.Test(Degura.第一次對話))
                {
                    Say(pc, 131, "哦?$R对这小子有兴趣?$R;" +
                        "$P它叫「炽色步行龙」$R是机械时代的蛋孵化出来的生物哦$R;");
                    Degura_mask.SetValue(Degura.第一次對話, true);
                }
                if (!Degura_mask.Test(Degura.持有火紅德拉古蛋))
                {
                    if (CountItem(pc, 10050851) >= 1)
                    {
                        Say(pc, 131, "嗯…您也有『炽色步行龙蛋』吧?$R;" +
                            "$P您也有吗?让我看看$R嗯…颜色好像有点不同呢$R;" +
                            "$R品种是不是有点不同…?$R;" +
                            "$P听说魔物把蛋差不多都抢走了$R;" +
                            "$R这个，在某地方救回的吧?$R;" +
                            "$P啊！您特意来的吗?$R;" +
                            "$R我带了很多可以孵化那些蛋的机器来$R;" +
                            "$P什么…?已经知道了?$R您怎么会…?$R;" +
                            "$P您问在哪里可以找到机械?$R;" +
                            "$R那个嘛…在摩戈岛的光之…糟了！$R;" +
                            "那个不可以说的呢$R我说我也不知道啊！$R;");
                    }
                    else
                    {
                        Say(pc, 131, "嗯…$R您…知道炽色步行龙吗?$R;" +
                            "$P它们的蛋，好像都给魔物抢走了$R;" +
                            "$R您又来了吗?$R;" +
                            "$P嗯，是吗…$R;" +
                            "$R我带了很多可以孵化那些蛋的苹果来$R;" +
                            "$P……?$R您怎么知道?$R;" +
                            "$P什么?您说在哪里找到的?$R;" +
                            "$R这个当然，摩戈岛的光之…糟了！$R;" +
                            "我什么都没说！$R我什么都没说呀！$R;");
                    }
                    Degura_mask.SetValue(Degura.持有火紅德拉古蛋, true);
                }
                switch (Select(pc, "机械什么的…", "", "送一个给我吧", "没什么"))
                {
                    case 1:
                        兑换(pc);
                        break;
                    case 2:
                        break;
                }
                return;
            }
            Say(pc, 131, "真是~~！那么慢阿！$R;" +
                "$R要到军舰岛机场接商人行会的人呀！$R;" +
                "$P我最近腰疼，不可以骑这小子去啊！$R;");
        }

        void 兑换(ActorPC pc)
        {
            Say(pc, 131, "！？$R您想把蛋孵化？$R;" +
                "$R孵化机器是有的…可是$R;" +
                "$P孵化的话转眼间$R就会变得这么大呀$R;" +
                "$R他会很友善的跟着人到处走$R但把它孵化的话，$R您就有责任和义务了$R;" +
                "$P得像自己的儿女般抚养啊，$R明白吗?$R;");
            switch (Select(pc, "机械什么的…", "", "送一个给我吧", "没什么"))
            {
                case 1:
                    Say(pc, 131, "…好$R;" +
                        "$R要让蛋孵化的话$R非用这孵化机器不可$R;" +
                        "$P这机器是古文物，超难控制的$R反正，先把蛋拿过来吧$R;");
                    if (CheckInventory(pc, 10052301, 1))
                    {
                        if (CountItem(pc, 10050851) >= 1 && CountItem(pc, 10050852) >= 1)
                        {
                            Say(pc, 131, "…??您两种蛋都有啊$R;" +
                                "$R您要孵化哪种颜色的蛋呢?$R;");
                            switch (Select(pc, "您要孵化哪一颗蛋?", "", "红色", "蓝色", "不用了"))
                            {
                                case 1:
                                    TakeItem(pc, 10050852, 1);
                                    GiveItem(pc, 10052301, 1);
                                    Say(pc, 131, "失去了『炽色步行龙的蛋』！$R;");
                                    Say(pc, 131, "得到了『炽色步行龙』！$R;");
                                    Say(pc, 131, "要好好的养啊$R;" +
                                        "$R不要到处惹事啊…$R;");
                                    break;
                                case 2:
                                    TakeItem(pc, 10050851, 1);
                                    GiveItem(pc, 10052303, 1);
                                    Say(pc, 131, "失去了『蓝色步行龙的蛋』！$R;");
                                    Say(pc, 131, "得到了『蓝色步行龙』！$R;");
                                    Say(pc, 131, "要好好的养啊$R;" +
                                        "$R不要到处惹事啊…$R;");
                                    break;
                                case 3:
                                    break;
                            }
                            return;
                        }
                        if (CountItem(pc, 10050851) >= 1)
                        {
                            TakeItem(pc, 10050851, 1);
                            GiveItem(pc, 10052303, 1);
                            Say(pc, 131, "失去了『蓝色步行龙的蛋』！$R;");
                            Say(pc, 131, "得到了『蓝色步行龙』！$R;");
                            Say(pc, 131, "要好好的养啊$R;" +
                                "$R不要到处惹事啊…$R;");
                            return;
                        }
                        TakeItem(pc, 10050852, 1);
                        GiveItem(pc, 10052301, 1);
                        Say(pc, 131, "失去了『炽色步行龙的蛋』！$R;");
                        Say(pc, 131, "得到了『炽色步行龙』！$R;");
                        Say(pc, 131, "要好好的养啊$R;" +
                            "$R不要到处惹事啊…$R;");
                        return;
                    }
                    Say(pc, 131, "您好像有很多东西啊$R;" +
                        "$R先减少一点再来吧$R;");
                    break;
                case 2:
                    break;
            }
        }
    }
}