using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;

namespace SagaScript
{
    public class P10000468 : Event
    {
        public P10000468()
        {
            this.EventID = 10000468;
        }

        public override void OnEvent(ActorPC pc)
        {
                Warp(pc, 10049000, 147, 252);
        }
    }
    public class P10000472 : RandomPortal
    {
        public P10000472()
        {
            Init(10000472, 10050000, 194, 251, 197, 253);
        }
    }
    //原始地圖:北方高原(10049000)
    //目標地圖:北方中央山脈(10050000)
    //目標坐標:(194,251) ~ (197,253)

    public class P10000473 : RandomPortal
    {
        public P10000473()
        {
            Init(10000473, 10049000, 194, 2, 197, 4);
        }
    }
    //原始地圖:北方中央山脈(10050000)
    //目標地圖:北方高原(10049000)
    //目標坐標:(194,2) ~ (197,4)

    public class P10000470 : RandomPortal
    {
        public P10000470()
        {
            Init(10000470, 10050000, 52, 251, 55, 253);
        }
    }
    //原始地圖:北方高原(10049000)
    //目標地圖:北方中央山脈(10050000)
    //目標坐標:(52,251) ~ (55,253)

    public class P10000471 : RandomPortal
    {
        public P10000471()
        {
            Init(10000471, 10049000, 55, 2, 58, 4);
        }
    }
    //原始地圖:北方中央山脈(10050000)
    //目標地圖:北方高原(10049000)
    //目標坐標:(55,2) ~ (58,4)

    public class P10000476 : RandomPortal
    {
        public P10000476()
        {
            Init(10000476, 10051000, 251, 119, 253, 122);
        }
    }
    //原始地圖:北方中央山脈(10050000)
    //目標地圖:永恆之北部極地(10051000)
    //目標坐標:(251,119) ~ (253,122)

    public class P10000477 : RandomPortal
    {
        public P10000477()
        {
            Init(10000477, 10050000, 2, 120, 4, 123);
        }
    }
    //原始地圖:永恆之北部極地(10051000)
    //目標地圖:北方中央山脈(10050000)
    //目標坐標:(2,120) ~ (4,123)

    public class P10000478 : RandomPortal
    {
        public P10000478()
        {
            Init(10000478, 10051000, 251, 37, 253, 40);
        }
    }
    //原始地圖:北方中央山脈(10050001)
    //目標地圖:永恆之北部極地(10051000)
    //目標坐標:(251,37) ~ (253,40)

    public class P10000479 : RandomPortal
    {
        public P10000479()
        {
            Init(10000479, 10050000, 2, 36, 4, 39);
        }
    }
    //原始地圖:永恆之北部極地(10051000)
    //目標地圖:北方中央山脈(10050001)
    //目標坐標:(2,36) ~ (4,39)

    public class P10000480 : RandomPortal
    {
        public P10000480()
        {
            Init(10000480, 10051000, 63, 150, 63, 150);
        }
    }
    public class P10000483 : RandomPortal
    {
        public P10000483()
        {
            Init(10000483, 10051000, 94, 123, 94, 123);
        }
    }
    public class P10000484 : RandomPortal
    {
        public P10000484()
        {
            Init(10000484, 20014000, 241, 12, 243, 14);
        }
    }
    //原始地圖:北方中央山脈(10050001)
    //目標地圖:北部地牢(20014000)
    //目標坐標:(241,12) ~ (243,14)

    public class P10000485 : RandomPortal
    {
        public P10000485()
        {
            Init(10000485, 10050001, 226, 134, 229, 136);
        }
    }
    //原始地圖:北部地牢(20014000)
    //目標地圖:北方中央山脈(10050001)
    //目標坐標:(226,134) ~ (229,136)

    public class P10000486 : RandomPortal
    {
        public P10000486()
        {
            Init(10000486, 20014000, 88, 88, 90, 90);
        }
    }
    //原始地圖:北部地牢(20014000)
    //目標地圖:北部地牢(20014000)
    //目標坐標:(88,88) ~ (90,90)

    public class P10000487 : RandomPortal
    {
        public P10000487()
        {
            Init(10000487, 20014000, 117, 116, 119, 118);
        }
    }
    //原始地圖:北部地牢(20014000)
    //目標地圖:北部地牢(20014000)
    //目標坐標:(117,116) ~ (119,118)

    public class P10000488 : RandomPortal
    {
        public P10000488()
        {
            Init(10000488, 20014000, 114, 156, 117, 157);
        }
    }
    //原始地圖:北部地牢(20014000)
    //目標地圖:北部地牢(20014000)
    //目標坐標:(114,156) ~ (117,157)

    public class P10000489 : RandomPortal
    {
        public P10000489()
        {
            Init(10000489, 20014000, 114, 138, 117, 139);
        }
    }
    //原始地圖:北部地牢(20014000)
    //目標地圖:北部地牢(20014000)
    //目標坐標:(114,138) ~ (117,139)

    public class P10000490 : RandomPortal
    {
        public P10000490()
        {
            Init(10000490, 20014000, 165, 164, 167, 166);
        }
    }
    //原始地圖:北部地牢(20014000)
    //目標地圖:北部地牢(20014000)
    //目標坐標:(165,164) ~ (167,166)

    public class P10000491 : RandomPortal
    {
        public P10000491()
        {
            Init(10000491, 20014000, 136, 137, 138, 139);
        }
    }
    //原始地圖:北部地牢(20014000)
    //目標地圖:北部地牢(20014000)
    //目標坐標:(136,137) ~ (138,139)
    public class P10000474 : RandomPortal
    {
        public P10000474()
        {
            Init(10000474, 10065000, 49, 195, 54, 197);
        }
    }
    //原始地圖:北方中央山脈(10050000)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(49,195) ~ (54,197)50000)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(49,195) ~ (54,197)

    public class P10000475 : RandomPortal
    {
        public P10000475()
        {
            Init(10000475, 10050000, 102, 142, 105, 144);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:北方中央山脈(10050000)
    //目標坐標:(102,142) ~ (105,144)
    public class P10001780 : RandomPortal
    {
        public P10001780()
        {
            Init(10001780, 10050000, 102, 142, 105, 144);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:北方中央山脈(10050000)
    //目標坐標:(102,142) ~ (105,144)

    public class P10002187 : RandomPortal
    {
        public P10002187()
        {
            Init(10002187, 10050000, 102, 142, 105, 144);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:北方中央山脈(10050000)
    //目標坐標:(102,142) ~ (105,144)

    public class P10002166 : RandomPortal
    {
        public P10002166()
        {
            Init(10002166, 20211000, 229, 248, 229, 248);
        }
    }

    public class P10002167 : RandomPortal
    {
        public P10002167()
        {
            Init(10002167, 20211000, 21, 248, 21, 248);
        }
    }
    public class P10002164 : RandomPortal
    {
        public P10002164()
        {
            Init(10002164, 20210000, 21, 0, 21, 0);
        }
    }

    public class P10002165 : RandomPortal
    {
        public P10002165()
        {
            Init(10002165, 20210000, 237, 0, 237, 0);
        }
    }
}