using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
//所在地圖:諾頓咖啡館2(30010002) NPC基本信息:熊太郎(11000269) X:1 Y:3
namespace SagaScript.M30010002
{
    public class S11000269 : Event
    {
        public S11000269()
        {
            this.EventID = 11000269;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<LV35_Clothes_04> LV35_Clothes_04_mask = new BitMask<LV35_Clothes_04>(pc.CMask["LV35_Clothes_04"]);

            if (!LV35_Clothes_04_mask.Test(LV35_Clothes_04.熊太郎的委託完成))
            {
                熊太郎的委託(pc);
                return;
            }

            Say(pc, 11000269, 131, "嘿嘿嘿，$R;" +
                                   "可以跟「巴列麗拿」在一起，$R;" +
                                   "實在是很高興，$R;" +
                                   "非常另人高興啊!!$R;", "熊太郎");

            switch (Select(pc, "想要買什麼呢?", "", "魔法裝備", "什麼也不買"))
            {
                case 1:
                    OpenShopBuy(pc, 64);
                    break;

                case 2:
                    break;
            }
        }

        void 熊太郎的委託(ActorPC pc)
        {
            if (pc.CInt["LV35_Clothes_04"] == 0)
            {
                熊太郎告知想吃的料理(pc);
                return;
            }
            else
            {
                把料理交給熊太郎(pc);
                return;
            }
        }

        void 熊太郎告知想吃的料理(ActorPC pc)
        {
            int selection;

            if (pc.Level < 20)
            {
                Say(pc, 11000269, 131, "咇咯嘶? 咇咯嘶?$R;" +
                                       "咇咯咇咯咇咯!$R;" +
                                       "我叫「熊太郎」。$R;" +
                                       "$P這家店裡，$R;" +
                                       "有「巴列麗拿」的美食。$R;" +
                                       "$R好像不合人類的口味，$R;" +
                                       "但對少數民族同胞來說。$R;" +
                                       "是非常有名的店唷!$R;" +
                                       "$P從到這裡來的人們那，$R;" +
                                       "收集材料是我應該做的事情!$R;" +
                                       "$R請多多關照唷!!$R;", "熊太郎");

                selection = Global.Random.Next(1, 10);

                pc.CInt["LV35_Clothes_04"] = selection;

                switch (pc.CInt["LV35_Clothes_04"])
                {
                    case 1:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『甜梅醬』是很好吃的東西。$R;" +
                                               "$R真想吃夾有美味果醬的鮮果餡餅啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30罐『甜梅醬』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 2:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『果醬』是很好吃的東西。$R;" +
                                               "$R真想吃夾有美味果醬的鮮果餡餅啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30罐『果醬』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 3:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『蘋果醬』是很好吃的東西。$R;" +
                                               "$R真想吃夾有美味果醬的鮮果餡餅啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30罐『蘋果醬』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 4:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『橙子醬』是很好吃的東西。$R;" +
                                               "$R真想吃夾有美味果醬的鮮果餡餅啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30罐『橙子醬』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 5:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『甜梅汁』很好喝唷!$R;" +
                                               "$R是讓人感到爽快的新鮮飲料啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30瓶『甜梅汁』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 6:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『果汁』很好喝唷!$R;" +
                                               "$R是讓人感到爽快的新鮮飲料啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30瓶『果汁』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 7:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『蘋果汁』很好喝唷!$R;" +
                                               "$R是讓人感到爽快的新鮮飲料啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30瓶『蘋果汁』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 8:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『橙汁』很好喝唷!$R;" +
                                               "$R是讓人感到爽快的新鮮飲料啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30瓶『橙汁』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 9:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『奶油』很好吃的喔!$R;" +
                                               "$R好的奶油是很香的。$R;" +
                                               "$P來!$R;" +
                                               "給我85塊『奶油』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 10:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『煮雞蛋』很好吃的唷!$R;" +
                                               "$R是半熟，還是全熟?$R;" +
                                               "熱乎乎的煮雞蛋耶!$R;" +
                                               "$P來!$R;" +
                                               "給我50顆『煮雞蛋』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;
                }
            }
            else
            {
                Say(pc, 11000269, 131, "咇咯嘶? 咇咯嘶?$R;" +
                                       "咇咯咇咯咇咯!$R;" +
                                       "我叫「熊太郎」。$R;" +
                                       "$P這家店裡，$R;" +
                                       "有「巴列麗拿」的美食。$R;" +
                                       "$R好像不合人類的口味，$R;" +
                                       "但對少數民族同胞來說。$R;" +
                                       "是非常有名的店唷!$R;" +
                                       "$P從到這裡來的人們那，$R;" +
                                       "收集材料是我應該做的事情!$R;" +
                                       "$R請多多關照唷!!$R;", "熊太郎");

                selection = Global.Random.Next(11, 12);

                pc.CInt["LV35_Clothes_04"] = selection;

                switch (pc.CInt["LV35_Clothes_04"])
                {
                    case 11:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『高級肉』很好吃的呀!$R;" +
                                               "$R又嫩又香的。$R;" +
                                               "$P來!$R;" +
                                               "給我30塊『高級肉』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 12:
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著。$R;" +
                                               "『魚子醬』很好吃的唷!$R;" +
                                               "$R又嫩又美味。$R;" +
                                               "$P來!$R;" +
                                               "給我3份『魚子醬』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;
                }
            }
        }

        void 把料理交給熊太郎(ActorPC pc)
        {
            BitMask<LV35_Clothes_04> LV35_Clothes_04_mask = new BitMask<LV35_Clothes_04>(pc.CMask["LV35_Clothes_04"]);

            switch (pc.CInt["LV35_Clothes_04"])
            {
                case 1:
                    if (CountItem(pc, 10033908) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10033908, 30);
                        Say(pc, 0, 0, "把『甜梅醬』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                                "『甜梅醬』是很好吃的東西。$R;" +
                                                "$R真想吃夾有美味果醬的鮮果餡餅啊?$R;" +
                                                "$P來!$R;" +
                                                "給我30罐『甜梅醬』。$R;" +
                                                "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 2:
                    if (CountItem(pc, 10033900) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10033900, 30);
                        Say(pc, 0, 0, "把『果醬』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『果醬』是很好吃的東西。$R;" +
                                               "$R真想吃夾有美味果醬的鮮果餡餅啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30罐『果醬』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 3:
                    if (CountItem(pc, 10033901) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10033901, 30);
                        Say(pc, 0, 0, "把『蘋果醬』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『蘋果醬』是很好吃的東西。$R;" +
                                               "$R真想吃夾有美味果醬的鮮果餡餅啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30罐『蘋果醬』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 4:
                    if (CountItem(pc, 10033907) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10033907, 30);
                        Say(pc, 0, 0, "把『橙子醬』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                       Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                              "『橙子醬』是很好吃的東西。$R;" +
                                              "$R真想吃夾有美味果醬的鮮果餡餅啊?$R;" +
                                              "$P來!$R;" +
                                              "給我30罐『橙子醬』。$R;" +
                                              "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 5:
                    if (CountItem(pc, 10001806) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10001806, 30);
                        Say(pc, 0, 0, "把『甜梅汁』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『甜梅汁』很好喝唷!$R;" +
                                               "$R是讓人感到爽快的新鮮飲料啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30瓶『甜梅汁』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 6:
                    if (CountItem(pc, 10001600) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10001600, 30);
                        Say(pc, 0, 0, "把『果汁』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『果汁』很好喝唷!$R;" +
                                               "$R是讓人感到爽快的新鮮飲料啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30瓶『果汁』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 7:
                    if (CountItem(pc, 10001807) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10001807, 30);
                        Say(pc, 0, 0, "把『蘋果汁』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『蘋果汁』很好喝唷!$R;" +
                                               "$R是讓人感到爽快的新鮮飲料啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30瓶『蘋果汁』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 8:
                    if (CountItem(pc, 10001808) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10001808, 30);
                        Say(pc, 0, 0, "把『橙汁』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『橙汁』很好喝唷!$R;" +
                                               "$R是讓人感到爽快的新鮮飲料啊?$R;" +
                                               "$P來!$R;" +
                                               "給我30瓶『橙汁』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 9:
                    if (CountItem(pc, 10008450) >= 85)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10008450, 85);
                        Say(pc, 0, 0, "把『奶油』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『奶油』很好吃的喔!$R;" +
                                               "$R好的奶油是很香的。$R;" +
                                               "$P來!$R;" +
                                               "給我85塊『奶油』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 10:
                    if (CountItem(pc, 10007750) >= 50)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10007750, 50);
                        Say(pc, 0, 0, "把『煮雞蛋』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『煮雞蛋』很好吃的唷!$R;" +
                                               "$R是半熟，還是全熟?$R;" +
                                               "熱乎乎的煮雞蛋耶!$R;" +
                                               "$P來!$R;" +
                                               "給我50顆『煮雞蛋』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 11:
                    if (CountItem(pc, 10006400) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10006400, 30);
                        Say(pc, 0, 0, "把『高級肉』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著，$R;" +
                                               "『高級肉』很好吃的呀!$R;" +
                                               "$R又嫩又香的。$R;" +
                                               "$P來!$R;" +
                                               "給我30塊『高級肉』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                    }
                    break;

                case 12:
                    if (CountItem(pc, 10015250) >= 3)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10015250, 3);
                        Say(pc, 0, 0, "把『魚子醬』交給牠。$R;", " ");

                        Say(pc, 11000269, 131, "太謝謝了!!$R;" +
                                               "$R用這個就可以吃到$R;" +
                                               "「巴列麗拿」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「巴列麗拿」的秘密便條裡寫著。$R;" +
                                               "『魚子醬』很好吃的唷!$R;" +
                                               "$R又嫩又美味。$R;" +
                                               "$P來!$R;" +
                                               "給我3份『魚子醬』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                    }
                    break;
            }
        }
    }
}
