using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;

namespace SagaScript
{
    public class P10000000 : RandomPortal
    {
        public P10000000()
        {
            Init(10000000, 10025000, 1, 126, 3, 129);
        }
    }
    //原始地圖:上城東邊吊橋(10023100)
    //目標地圖:奧克魯尼亞東部平原(10025000)
    //目標坐標:(1,126) ~ (3,129)

    public class P10000001 : RandomPortal
    {
        public P10000001()
        {
            Init(10000001, 30030000, 2, 5, 2, 5);
        }
    }
    //原始地圖:上城東邊吊橋(10023100)
    //目標地圖:東軍本部入口(30030000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10000002 : RandomPortal
    {
        public P10000002()
        {
            Init(10000002, 30030000, 2, 5, 2, 5);
        }
    }
    //原始地圖:上城東邊吊橋(10023100)
    //目標地圖:東軍本部入口(30030000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10000004 : RandomPortal
    {
        public P10000004()
        {
            Init(10000004, 10023100, 224, 126, 225, 129);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(224,126) ~ (225,129)

    public class P10000005 : RandomPortal
    {
        public P10000005()
        {
            Init(10000005, 10024000, 208, 140, 209, 143);
        }
    }
    //原始地圖:上城東邊吊橋(10023100)
    //目標地圖:下城(10024000)
    //目標坐標:(208,140) ~ (209,143)

    public class P10000006 : RandomPortal
    {
        public P10000006()
        {
            Init(10000006, 10024000, 208, 112, 209, 115);
        }
    }
    //原始地圖:上城東邊吊橋(10023100)
    //目標地圖:下城(10024000)
    //目標坐標:(208,112) ~ (209,115)

    public class P10000007 : RandomPortal
    {
        public P10000007()
        {
            Init(10000007, 30100000, 4, 14, 6, 15);
        }
    }
    //原始地圖:東軍本部入口(30030000)
    //目標地圖:東軍本部長官室(30100000)
    //目標坐標:(4,14) ~ (6,15)

    public class P10000010 : RandomPortal
    {
        public P10000010()
        {
            Init(10000010, 10022000, 252, 126, 254, 129);
        }
    }
    //原始地圖:上城西邊吊橋(10023200)
    //目標地圖:奧克魯尼亞西部平原(10022000)
    //目標坐標:(252,126) ~ (254,129)

    public class P10000011 : RandomPortal
    {
        public P10000011()
        {
            Init(10000011, 30031000, 2, 5, 2, 5);
        }
    }
    //原始地圖:上城西邊吊橋(10023200)
    //目標地圖:西軍本部入口(30031000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10000012 : RandomPortal
    {
        public P10000012()
        {
            Init(10000012, 30031000, 2, 5, 2, 5);
        }
    }
    //原始地圖:上城西邊吊橋(10023200)
    //目標地圖:西軍本部入口(30031000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10000014 : RandomPortal
    {
        public P10000014()
        {
            Init(10000014, 10023200, 30, 126, 32, 129);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:上城西邊吊橋(10023200)
    //目標坐標:(30,126) ~ (32,129)

    public class P10000015 : RandomPortal
    {
        public P10000015()
        {
            Init(10000015, 10024000, 46, 112, 47, 115);
        }
    }
    //原始地圖:上城西邊吊橋(10023200)
    //目標地圖:下城(10024000)
    //目標坐標:(46,112) ~ (47,115)

    public class P10000016 : RandomPortal
    {
        public P10000016()
        {
            Init(10000016, 10024000, 46, 140, 47, 143);
        }
    }
    //原始地圖:上城西邊吊橋(10023200)
    //目標地圖:下城(10024000)
    //目標坐標:(46,140) ~ (47,143)

    public class P10000017 : RandomPortal
    {
        public P10000017()
        {
            Init(10000017, 30101000, 4, 14, 6, 15);
        }
    }
    //原始地圖:西軍本部入口(30031000)
    //目標地圖:西軍本部長官室(30101000)
    //目標坐標:(4,14) ~ (6,15)

    public class P10000020 : RandomPortal
    {
        public P10000020()
        {
            Init(10000020, 10031000, 126, 1, 129, 3);
        }
    }
    //原始地圖:上城南邊吊橋(10023300)
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(126,1) ~ (129,3)

    public class P10000021 : RandomPortal
    {
        public P10000021()
        {
            Init(10000021, 30032000, 2, 5, 2, 5);
        }
    }
    //原始地圖:上城南邊吊橋(10023300)
    //目標地圖:南軍本部入口(30032000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10000022 : RandomPortal
    {
        public P10000022()
        {
            Init(10000022, 30032000, 2, 5, 2, 5);
        }
    }
    //原始地圖:上城南邊吊橋(10023300)
    //目標地圖:南軍本部入口(30032000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10000024 : RandomPortal
    {
        public P10000024()
        {
            Init(10000024, 10023300, 126, 225, 129, 226);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:上城南邊吊橋(10023300)
    //目標坐標:(126,225) ~ (129,226)

    public class P10000025 : RandomPortal
    {
        public P10000025()
        {
            Init(10000025, 10024000, 112, 208, 115, 209);
        }
    }
    //原始地圖:上城南邊吊橋(10023300)
    //目標地圖:下城(10024000)
    //目標坐標:(112,208) ~ (115,209)

    public class P10000026 : RandomPortal
    {
        public P10000026()
        {
            Init(10000026, 10024000, 140, 208, 143, 209);
        }
    }
    //原始地圖:上城南邊吊橋(10023300)
    //目標地圖:下城(10024000)
    //目標坐標:(140,208) ~ (143,209)

    public class P10000027 : Event
    {
        public P10000027()
        {
            this.EventID = 10000027;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 30102000, 5, 14);
        }
    }
    //原始地圖:南軍本部入口(30032000)
    //目標地圖:南軍本部長官室(30102000)
    //目標坐標:(4,14) ~ (6,15)

    public class P10000030 : RandomPortal
    {
        public P10000030()
        {
            Init(10000030, 10014000, 126, 252, 129, 254);
        }
    }
    //原始地圖:上城北邊吊橋(10023400)
    //目標地圖:奧克魯尼亞北部平原(10014000)
    //目標坐標:(126,252) ~ (129,254)

    public class P10000031 : RandomPortal
    {
        public P10000031()
        {
            Init(10000031, 30033000, 2, 5, 2, 5);
        }
    }
    //原始地圖:上城北邊吊橋(10023400)
    //目標地圖:北軍本部入口(30033000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10000032 : RandomPortal
    {
        public P10000032()
        {
            Init(10000032, 30033000, 2, 5, 2, 5);
        }
    }
    //原始地圖:上城北邊吊橋(10023400)
    //目標地圖:北軍本部入口(30033000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10000034 : RandomPortal
    {
        public P10000034()
        {
            Init(10000034, 10023400, 126, 30, 129, 32);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,30) ~ (129,32)

    public class P10000035 : RandomPortal
    {
        public P10000035()
        {
            Init(10000035, 10024000, 140, 46, 143, 47);
        }
    }
    //原始地圖:上城北邊吊橋(10023400)
    //目標地圖:下城(10024000)
    //目標坐標:(140,46) ~ (143,47)

    public class P10000036 : RandomPortal
    {
        public P10000036()
        {
            Init(10000036, 10024000, 112, 46, 115, 47);
        }
    }
    //原始地圖:上城北邊吊橋(10023400)
    //目標地圖:下城(10024000)
    //目標坐標:(112,46) ~ (115,47)

    public class P10000037 : RandomPortal
    {
        public P10000037()
        {
            Init(10000037, 30103000, 4, 14, 6, 15);
        }
    }
    //原始地圖:北軍本部入口(30033000)
    //目標地圖:北軍本部長官室(30103000)
    //目標坐標:(4,14) ~ (6,15)

    public class P10000040 : RandomPortal
    {
        public P10000040()
        {
            Init(10000040, 30022000, 3, 5, 3, 5);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:賢者首領之家(30022000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000043 : RandomPortal
    {
        public P10000043()
        {
            Init(10000043, 30021000, 3, 5, 3, 5);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:寶石商店(30021000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000044 : RandomPortal
    {
        public P10000044()
        {
            Init(10000044, 30110000, 12, 21, 14, 23);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:行會宮殿大樓中庭(30110000)
    //目標坐標:(12,21) ~ (14,23)

    public class P10000045 : RandomPortal
    {
        public P10000045()
        {
            Init(10000045, 30120000, 10, 21, 13, 23);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:白之聖堂(30120000)
    //目標坐標:(10,21) ~ (13,23)

    public class P10000046 : RandomPortal
    {
        public P10000046()
        {
            Init(10000046, 30121000, 10, 21, 13, 23);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:黑之聖堂(30121000)
    //目標坐標:(10,21) ~ (13,23)

    public class P10000047 : RandomPortal
    {
        public P10000047()
        {
            Init(10000047, 10023000, 163, 126, 165, 129);
        }
    }
    //原始地圖:白之聖堂(30120000)
    //目標地圖:上城(10023000)
    //目標坐標:(163,126) ~ (165,129)

    public class P10000048 : RandomPortal
    {
        public P10000048()
        {
            Init(10000048, 10023000, 90, 126, 92, 129);
        }
    }
    //原始地圖:黑之聖堂(30121000)
    //目標地圖:上城(10023000)
    //目標坐標:(90,126) ~ (92,129)

    public class P10000050 : RandomPortal
    {
        public P10000050()
        {
            Init(10000050, 10023100, 210, 140, 212, 143);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(210,140) ~ (212,143)

    public class P10000051 : RandomPortal
    {
        public P10000051()
        {
            Init(10000051, 10023100, 210, 112, 212, 115);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(210,112) ~ (212,115)

    public class P10000053 : RandomPortal
    {
        public P10000053()
        {
            Init(10000053, 30010000, 3, 5, 3, 5);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:咖啡館(30010000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000055 : RandomPortal
    {
        public P10000055()
        {
            Init(10000055, 10023200, 43, 112, 45, 115);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:上城西邊吊橋(10023200)
    //目標坐標:(43,112) ~ (45,115)

    public class P10000056 : RandomPortal
    {
        public P10000056()
        {
            Init(10000056, 10023200, 43, 140, 45, 143);
        }
    }//*/
    //原始地圖:下城(10024000)
    //目標地圖:上城西邊吊橋(10023200)
    //目標坐標:(43,140) ~ (45,143)

    public class P10000058 : RandomPortal
    {
        public P10000058()
        {
            Init(10000058, 30014000, 3, 5, 3, 5);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:古董商店(30014000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000060 : RandomPortal
    {
        public P10000060()
        {
            Init(10000060, 10023300, 112, 210, 115, 212);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:上城南邊吊橋(10023300)
    //目標坐標:(112,210) ~ (115,212)

    public class P10000061 : RandomPortal
    {
        public P10000061()
        {
            Init(10000061, 10023300, 140, 210, 143, 212);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:上城南邊吊橋(10023300)
    //目標坐標:(140,210) ~ (143,212)

    public class P10000063 : RandomPortal
    {
        public P10000063()
        {
            Init(10000063, 30012000, 3, 5, 3, 5);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:武器商店(30012000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000065 : RandomPortal
    {
        public P10000065()
        {
            Init(10000065, 10023400, 140, 43, 143, 45);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(140,43) ~ (143,45)

    public class P10000066 : RandomPortal
    {
        public P10000066()
        {
            Init(10000066, 10023400, 112, 43, 115, 45);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(112,43) ~ (115,45)

    public class P10000068 : RandomPortal
    {
        public P10000068()
        {
            Init(10000068, 30001000, 2, 4, 2, 4);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:占卜店(30001000)
    //目標坐標:(2,4) ~ (2,4)

    public class P10000070 : RandomPortal
    {
        public P10000070()
        {
            Init(10000070, 30002000, 3, 5, 3, 5);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:解答小屋(30002000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000098 : RandomPortal
    {
        public P10000098()
        {
            Init(10000098, 20003000, 81, 23, 83, 24);
        }
    }
    //原始地圖:大陸之洞窟B4F(20003000)
    //目標地圖:大陸之洞窟B4F(20003000)
    //目標坐標:(81,23) ~ (83,24)

    public class P10000099 : RandomPortal
    {
        public P10000099()
        {
            Init(10000099, 20003000, 107, 45, 108, 45);
        }
    }
    //原始地圖:大陸之洞窟B4F(20003000)
    //目標地圖:大陸之洞窟B4F(20003000)
    //目標坐標:(107,45) ~ (108,45)

    public class P10000100 : RandomPortal
    {
        public P10000100()
        {
            Init(10000100, 30180000, 8, 16, 11, 18);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:劇場門廊1(30180000)
    //目標坐標:(8,16) ~ (11,18)

    public class P10000101 : RandomPortal
    {
        public P10000101()
        {
            Init(10000101, 30181000, 8, 16, 11, 18);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:劇場門廊2(30181000)
    //目標坐標:(8,16) ~ (11,18)

    public class P10000102 : RandomPortal
    {
        public P10000102()
        {
            Init(10000102, 30182000, 8, 16, 11, 18);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:劇場門廊3(30182000)
    //目標坐標:(8,16) ~ (11,18)

    public class P10000103 : RandomPortal
    {
        public P10000103()
        {
            Init(10000103, 30183000, 8, 16, 11, 18);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:劇場門廊4(30183000)
    //目標坐標:(8,16) ~ (11,18)

    public class P10000104 : 劇場傳送門
    {
        public P10000104()
        {
            this.EventID = 10000104;
            Init(10000104, 30190000, 11, 21);
        }

    }
    //原始地圖:劇場門廊1(30180000)
    //目標地圖:劇場放映室1(30190000)
    //目標坐標:(10,20) ~ (13,22)

    public class P10000105 : 劇場傳送門
    {
        public P10000105()
        {
            Init(10000105, 30191000, 11, 22);
        }
    }
    //原始地圖:劇場門廊2(30181000)
    //目標地圖:劇場放映室3(30192000)
    //目標坐標:(10,20) ~ (13,22)

    public class P10000106 : 劇場傳送門
    {
        public P10000106()
        {
            Init(10000106, 30192000, 11, 22);
        }
    }
    //原始地圖:劇場門廊3(30182000)
    //目標地圖:劇場放映室1(30194000)
    //目標坐標:(10,20) ~ (13,22)

    public class P10000107 : 劇場傳送門
    {
        public P10000107()
        {
            Init(10000107, 30193000, 11, 22);
        }
    }
    //原始地圖:劇場門廊4(30183000)
    //目標地圖:劇場放映室3(30196000)
    //目標坐標:(10,20) ~ (13,22)

    public class P10000108 : RandomPortal
    {
        public P10000108()
        {
            Init(10000108, 10014002, 126, 197, 129, 199);
        }
    }
    //原始地圖:塔妮亞傳送室(30140000)
    //目標地圖:指導地圖(10014002)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000109 : RandomPortal
    {
        public P10000109()
        {
            Init(10000109, 10014002, 126, 197, 129, 199);
        }
    }
    //原始地圖:道米尼傳送室(30141000)
    //目標地圖:指導地圖(10014002)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000110 : RandomPortal
    {
        public P10000110()
        {
            Init(10000110, 30140000, 9, 14, 13, 19);
        }
    }
    //原始地圖:指導地圖(10014002)
    //目標地圖:塔妮亞傳送室(30140000)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000111 : RandomPortal
    {
        public P10000111()
        {
            Init(10000111, 30141000, 9, 14, 13, 19);
        }
    }
    //原始地圖:指導地圖(10014002)
    //目標地圖:道米尼傳送室(30141000)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000113 : RandomPortal
    {
        public P10000113()
        {
            Init(10000113, 50027000, 10, 10, 10, 10);
        }
    }
    //原始地圖:
    //目標地圖:埃米爾族的夢中(50027000)
    //目標坐標:(10,10) ~ (10,10)

    public class P10000114 : RandomPortal
    {
        public P10000114()
        {
            Init(10000114, 50028000, 10, 10, 10, 10);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞世界的幻影(50028000)
    //目標坐標:(10,10) ~ (10,10)

    public class P10000115 : RandomPortal
    {
        public P10000115()
        {
            Init(10000115, 50029000, 10, 10, 10, 10);
        }
    }
    //原始地圖:
    //目標地圖:道米尼世界的幻影(50029000)
    //目標坐標:(10,10) ~ (10,10)

    public class P10000116 : RandomPortal
    {
        public P10000116()
        {
            Init(10000116, 50030000, 10, 10, 10, 10);
        }
    }

    //原始地圖:阿高普路斯市司令室(50030000)
    //目標地圖:阿高普路斯市市走道(50031000)
    //目標坐標:(7,38) ~ (7,38)


    //原始地圖:阿高普路斯市市走道(50031000)
    //目標地圖:奧克魯尼亞大陸廢墟(50032000)
    //目標坐標:(98,19) ~ (102,23)

    public class P10000119 : RandomPortal
    {
        public P10000119()
        {
            Init(10000119, 20081000, 12, 21, 12, 21);
        }
    }
    //原始地圖:
    //目標地圖:空中之咖啡室(20081000)
    //目標坐標:(12,21) ~ (12,21)

    public class P10000120 : RandomPortal
    {
        public P10000120()
        {
            Init(10000120, 10023100, 231, 136, 232, 138);
        }
    }
    //原始地圖:東軍本部入口(30030000)
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(231,136) ~ (232,138)

    public class P10000121 : RandomPortal
    {
        public P10000121()
        {
            Init(10000121, 10023100, 231, 117, 232, 119);
        }
    }
    //原始地圖:東軍本部入口(30030000)
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(231,117) ~ (232,119)

    public class P10000124 : RandomPortal
    {
        public P10000124()
        {
            Init(10000124, 10023200, 23, 117, 24, 119);
        }
    }
    //原始地圖:西軍本部入口(30031000)
    //目標地圖:上城西邊吊橋(10023200)
    //目標坐標:(23,117) ~ (24,119)

    public class P10000125 : RandomPortal
    {
        public P10000125()
        {
            Init(10000125, 10023200, 23, 136, 24, 138);
        }
    }
    //原始地圖:西軍本部入口(30031000)
    //目標地圖:上城西邊吊橋(10023200)
    //目標坐標:(23,136) ~ (24,138)

    public class P10000128 : RandomPortal
    {
        public P10000128()
        {
            Init(10000128, 10023300, 117, 232, 119, 233);
        }
    }
    //原始地圖:南軍本部入口(30032000)
    //目標地圖:上城南邊吊橋(10023300)
    //目標坐標:(117,232) ~ (119,233)

    public class P10000129 : RandomPortal
    {
        public P10000129()
        {
            Init(10000129, 10023300, 136, 232, 138, 233);
        }
    }
    //原始地圖:南軍本部入口(30032000)
    //目標地圖:上城南邊吊橋(10023300)
    //目標坐標:(136,232) ~ (138,233)

    public class P10000132 : RandomPortal
    {
        public P10000132()
        {
            Init(10000132, 10023400, 136, 23, 138, 24);
        }
    }
    //原始地圖:北軍本部入口(30033000)
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(136,23) ~ (138,24)

    public class P10000133 : RandomPortal
    {
        public P10000133()
        {
            Init(10000133, 10023400, 117, 23, 119, 24);
        }
    }
    //原始地圖:北軍本部入口(30033000)
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(117,23) ~ (119,24)

    public class P10000134 : RandomPortal
    {
        public P10000134()
        {
            Init(10000134, 30180000, 8, 1, 11, 3);
        }
    }
    //原始地圖:劇場放映室2(30191000)
    //目標地圖:劇場門廊1(30180000)
    //目標坐標:(8,1) ~ (11,3)

    public class P10000135 : RandomPortal
    {
        public P10000135()
        {
            Init(10000135, 30181000, 8, 1, 11, 3);
        }
    }
    //原始地圖:劇場放映室4(30193000)
    //目標地圖:劇場門廊2(30181000)
    //目標坐標:(8,1) ~ (11,3)

    public class P10000136 : RandomPortal
    {
        public P10000136()
        {
            Init(10000136, 30182000, 8, 1, 11, 3);
        }
    }
    //原始地圖:劇場放映室2(30195000)
    //目標地圖:劇場門廊3(30182000)
    //目標坐標:(8,1) ~ (11,3)

    public class P10000137 : RandomPortal
    {
        public P10000137()
        {
            Init(10000137, 30183000, 8, 1, 11, 3);
        }
    }
    //原始地圖:劇場放映室4(30197000)
    //目標地圖:劇場門廊4(30183000)
    //目標坐標:(8,1) ~ (11,3)

    public class P10000138 : RandomPortal
    {
        public P10000138()
        {
            Init(10000138, 30191000, 10, 20, 13, 22);
        }
    }
    //原始地圖:劇場門廊1(30180000)
    //目標地圖:劇場放映室2(30191000)
    //目標坐標:(10,20) ~ (13,22)

    public class P10000139 : RandomPortal
    {
        public P10000139()
        {
            Init(10000139, 30193000, 10, 20, 13, 22);
        }
    }
    //原始地圖:劇場門廊2(30181000)
    //目標地圖:劇場放映室4(30193000)
    //目標坐標:(10,20) ~ (13,22)

    public class P10000140 : RandomPortal
    {
        public P10000140()
        {
            Init(10000140, 30195000, 10, 20, 13, 22);
        }
    }
    //原始地圖:劇場門廊3(30182000)
    //目標地圖:劇場放映室2(30195000)
    //目標坐標:(10,20) ~ (13,22)

    public class P10000141 : RandomPortal
    {
        public P10000141()
        {
            Init(10000141, 30197000, 10, 20, 13, 22);
        }
    }
    //原始地圖:劇場門廊4(30183000)
    //目標地圖:劇場放映室4(30197000)
    //目標坐標:(10,20) ~ (13,22)

    public class P10000142 : RandomPortal
    {
        public P10000142()
        {
            Init(10000142, 10024000, 126, 48, 129, 49);
        }
    }
    //原始地圖:占卜店(30001000)
    //目標地圖:下城(10024000)
    //目標坐標:(126,48) ~ (129,49)

    public class P10000143 : RandomPortal
    {
        public P10000143()
        {
            Init(10000143, 10024000, 58, 87, 58, 87);
        }
    }
    //原始地圖:解答小屋(30002000)
    //目標地圖:下城(10024000)
    //目標坐標:(58,87) ~ (58,87)

    public class P10000144 : RandomPortal
    {
        public P10000144()
        {
            Init(10000144, 10024000, 48, 126, 49, 129);
        }
    }
    //原始地圖:古董商店(30014000)
    //目標地圖:下城(10024000)
    //目標坐標:(48,126) ~ (49,129)

    public class P10000145 : RandomPortal
    {
        public P10000145()
        {
            Init(10000145, 10024000, 207, 126, 208, 129);
        }
    }
    //原始地圖:咖啡館(30010000)
    //目標地圖:下城(10024000)
    //目標坐標:(207,126) ~ (208,129)

    public class P10000146 : RandomPortal
    {
        public P10000146()
        {
            Init(10000146, 10024000, 126, 207, 129, 208);
        }
    }
    //原始地圖:武器商店(30012000)
    //目標地圖:下城(10024000)
    //目標坐標:(126,207) ~ (129,208)

    public class P10000149 : RandomPortal
    {
        public P10000149()
        {
            Init(10000149, 10023000, 152, 98, 155, 99);
        }
    }
    //原始地圖:寶石商店(30021000)
    //目標地圖:上城(10023000)
    //目標坐標:(152,98) ~ (155,99)

    public class P10000150 : RandomPortal
    {
        public P10000150()
        {
            Init(10000150, 10023000, 100, 98, 103, 99);
        }
    }
    //原始地圖:賢者首領之家(30022000)
    //目標地圖:上城(10023000)
    //目標坐標:(100,98) ~ (103,99)

    public class P10000151 : RandomPortal
    {
        public P10000151()
        {
            Init(10000151, 10023000, 126, 93, 129, 94);
        }
    }
    //原始地圖:行會宮殿大樓中庭(30110000)
    //目標地圖:上城(10023000)
    //目標坐標:(126,93) ~ (129,94)

    public class P10000152 : RandomPortal
    {
        public P10000152()
        {
            Init(10000152, 30180000, 8, 1, 11, 3);
        }
    }
    //原始地圖:劇場放映室1(30190000)
    //目標地圖:劇場門廊1(30180000)
    //目標坐標:(8,1) ~ (11,3)

    public class P10000153 : RandomPortal
    {
        public P10000153()
        {
            Init(10000153, 30181000, 8, 1, 11, 3);
        }
    }
    //原始地圖:劇場放映室3(30192000)
    //目標地圖:劇場門廊2(30181000)
    //目標坐標:(8,1) ~ (11,3)

    public class P10000154 : RandomPortal
    {
        public P10000154()
        {
            Init(10000154, 30182000, 8, 1, 11, 3);
        }
    }
    //原始地圖:劇場放映室1(30194000)
    //目標地圖:劇場門廊3(30182000)
    //目標坐標:(8,1) ~ (11,3)

    public class P10000155 : RandomPortal
    {
        public P10000155()
        {
            Init(10000155, 30183000, 8, 1, 11, 3);
        }
    }
    //原始地圖:劇場放映室3(30196000)
    //目標地圖:劇場門廊4(30183000)
    //目標坐標:(8,1) ~ (11,3)

    public class P10000156 : RandomPortal
    {
        public P10000156()
        {
            Init(10000156, 10024000, 143, 110, 145, 112);
        }
    }
    //原始地圖:劇場門廊1(30180000)
    //目標地圖:下城(10024000)
    //目標坐標:(143,110) ~ (145,112)

    public class P10000157 : RandomPortal
    {
        public P10000157()
        {
            Init(10000157, 10024000, 110, 143, 112, 145);
        }
    }
    //原始地圖:劇場門廊2(30181000)
    //目標地圖:下城(10024000)
    //目標坐標:(110,143) ~ (112,145)

    public class P10000158 : RandomPortal
    {
        public P10000158()
        {
            Init(10000158, 10024000, 143, 143, 145, 145);
        }
    }
    //原始地圖:劇場門廊3(30182000)
    //目標地圖:下城(10024000)
    //目標坐標:(143,143) ~ (145,145)

    public class P10000159 : RandomPortal
    {
        public P10000159()
        {
            Init(10000159, 10024000, 110, 110, 112, 112);
        }
    }
    //原始地圖:劇場門廊4(30183000)
    //目標地圖:下城(10024000)
    //目標坐標:(110,110) ~ (112,112)

    public class P10000160 : RandomPortal
    {
        public P10000160()
        {
            Init(10000160, 10023100, 252, 126, 253, 129);
        }
    }
    //原始地圖:奧克魯尼亞東部平原(10025000)
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(252,126) ~ (253,129)

    public class P10000161 : RandomPortal
    {
        public P10000161()
        {
            Init(10000161, 10023200, 2, 126, 3, 129);
        }
    }
    //原始地圖:奧克魯尼亞西部平原(10022000)
    //目標地圖:上城西邊吊橋(10023200)
    //目標坐標:(2,126) ~ (3,129)

    public class P10000162 : RandomPortal
    {
        public P10000162()
        {
            Init(10000162, 10023300, 126, 252, 129, 253);
        }
    }
    //原始地圖:奧克魯尼亞南部平原(10031000)
    //目標地圖:上城南邊吊橋(10023300)
    //目標坐標:(126,252) ~ (129,253)

    public class P10000163 : RandomPortal
    {
        public P10000163()
        {
            Init(10000163, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:奧克魯尼亞北部平原(10014000)
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)


    //原始地圖:行會宮殿大樓中庭(30110000)
    //目標地圖:行會宮殿2樓(30111000)、行會宮殿3樓(30112000)、行會宮殿4樓(30113000)、行會宮殿5樓(30114000)
    //目標坐標:(12,14) ~ (14,16)


    //原始地圖:行會宮殿2樓(30111000)
    //目標地圖:行會宮殿大樓中庭(30110000)、行會宮殿3樓(30112000)、行會宮殿4樓(30113000)、行會宮殿5樓(30114000)
    //目標坐標:(12,14) ~ (14,16)


    //原始地圖:行會宮殿3樓(30112000)
    //目標地圖:行會宮殿大樓中庭(30110000)、行會宮殿2樓(30111000)、行會宮殿4樓(30113000)、行會宮殿5樓(30114000)
    //目標坐標:(12,14) ~ (14,16)

    public class P10000167 : Event
    {
        public P10000167()
        {
            this.EventID = 10000167;
        }

        public override void OnEvent(ActorPC pc)
        {
            byte x, y;

            if (pc.Race == PC_RACE.EMIL &&
                pc.Marionette == null)
            {
                switch (Select(pc, "想去哪呢?", "", "大樓中庭", "2樓", "3樓", "放棄"))
                {
                    case 1:
                        x = (byte)Global.Random.Next(12, 14);
                        y = (byte)Global.Random.Next(14, 16);

                        Warp(pc, 30110000, x, y);
                        break;

                    case 2:
                        x = (byte)Global.Random.Next(12, 14);
                        y = (byte)Global.Random.Next(14, 16);

                        Warp(pc, 30111000, x, y);
                        break;

                    case 3:
                        x = (byte)Global.Random.Next(12, 14);
                        y = (byte)Global.Random.Next(14, 16);

                        Warp(pc, 30112000, x, y);
                        break;

                    case 4:
                        break;
                }
            }
            else
            {
                switch (Select(pc, "想去哪呢?", "", "大樓中庭", "2樓", "3樓", "5樓", "放棄"))
                {
                    case 1:
                        x = (byte)Global.Random.Next(12, 14);
                        y = (byte)Global.Random.Next(14, 16);

                        Warp(pc, 30110000, x, y);
                        break;

                    case 2:
                        x = (byte)Global.Random.Next(12, 14);
                        y = (byte)Global.Random.Next(14, 16);

                        Warp(pc, 30111000, x, y);
                        break;

                    case 3:
                        x = (byte)Global.Random.Next(12, 14);
                        y = (byte)Global.Random.Next(14, 16);

                        Warp(pc, 30112000, x, y);
                        break;

                    case 4:
                        x = (byte)Global.Random.Next(12, 14);
                        y = (byte)Global.Random.Next(14, 16);

                        Warp(pc, 30114000, x, y);
                        break;

                    case 5:
                        break;
                }
            }
        }
    }
    //原始地圖:行會宮殿4樓(30113000)
    //目標地圖:行會宮殿大樓中庭(30110000)、行會宮殿2樓(30111000)、行會宮殿3樓(30112000)、行會宮殿5樓(30114000)
    //目標坐標:(12,14) ~ (14,16)

    //原始地圖:行會宮殿5樓(30114000)
    //目標地圖:行會宮殿大樓中庭(30110000)、行會宮殿2樓(30111000)、行會宮殿3樓(30112000)、行會宮殿4樓(30113000)
    //目標坐標:(12,14) ~ (14,16)

    public class P10000169 : RandomPortal
    {
        public P10000169()
        {
            Init(10000169, 30900000, 20, 20, 21, 21);
        }
    }
    //原始地圖:
    //目標地圖:(30900000)
    //目標坐標:(20,20) ~ (21,21)

    public class P10000170 : RandomPortal
    {
        public P10000170()
        {
            Init(10000170, 20000000, 62, 23, 66, 24);
        }
    }
    //原始地圖:奧克魯尼亞東海岸(10034000)
    //目標地圖:大陸之洞窟B1F(20000000)
    //目標坐標:(62,23) ~ (66,24)

    public class P10000182 : RandomPortal
    {
        public P10000182()
        {
            Init(10000182, 20010000, 62, 11, 65, 13);
        }
    }
    //原始地圖:瑞路斯雪原(10002000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(62,11) ~ (65,13)

    public class P10000183 : RandomPortal
    {
        public P10000183()
        {
            Init(10000183, 10002000, 49, 221, 50, 222);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:瑞路斯雪原(10002000)
    //目標坐標:(49,221) ~ (50,222)

    public class P10000184 : RandomPortal
    {
        public P10000184()
        {
            Init(10000184, 20010000, 43, 67, 44, 68);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(43,67) ~ (44,68)

    public class P10000185 : RandomPortal
    {
        public P10000185()
        {
            Init(10000185, 20010000, 57, 65, 58, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(57,65) ~ (58,66)

    public class P10000186 : RandomPortal
    {
        public P10000186()
        {
            Init(10000186, 20010000, 89, 65, 90, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(89,65) ~ (90,66)

    public class P10000187 : RandomPortal
    {
        public P10000187()
        {
            Init(10000187, 20010000, 69, 65, 70, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(69,65) ~ (70,66)

    public class P10000188 : RandomPortal
    {
        public P10000188()
        {
            Init(10000188, 20010000, 99, 112, 101, 115);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(99,112) ~ (101,115)

    public class P10000189 : RandomPortal
    {
        public P10000189()
        {
            Init(10000189, 20010000, 110, 111, 113, 113);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(110,111) ~ (113,113)

    public class P10000191 : RandomPortal
    {
        public P10000191()
        {
            Init(10000191, 20010000, 62, 75, 65, 77);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(62,75) ~ (65,77)

    public class P10000192 : RandomPortal
    {
        public P10000192()
        {
            Init(10000192, 20011000, 12, 108, 13, 111);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B2F(20011000)
    //目標坐標:(12,108) ~ (13,111)

    public class P10000193 : RandomPortal
    {
        public P10000193()
        {
            Init(10000193, 20010000, 11, 108, 12, 111);
        }
    }
    //原始地圖:冰結的坑道B2F(20011000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(11,108) ~ (12,111)

    public class P10000196 : RandomPortal
    {
        public P10000196()
        {
            Init(10000196, 20012000, 113, 64, 114, 67);
        }
    }
    //原始地圖:冰結的坑道B2F(20011000)
    //目標地圖:冰結的坑道B3F(20012000)
    //目標坐標:(113,64) ~ (114,67)

    public class P10000197 : RandomPortal
    {
        public P10000197()
        {
            Init(10000197, 20011000, 115, 64, 116, 67);
        }
    }
    //原始地圖:冰結的坑道B3F(20012000)
    //目標地圖:冰結的坑道B2F(20011000)
    //目標坐標:(115,64) ~ (116,67)

    public class P10000198 : RandomPortal
    {
        public P10000198()
        {
            Init(10000198, 20012000, 57, 64, 59, 67);
        }
    }
    //原始地圖:冰結的坑道B3F(20012000)
    //目標地圖:冰結的坑道B3F(20012000)
    //目標坐標:(57,64) ~ (59,67)

    public class P10000199 : RandomPortal
    {
        public P10000199()
        {
            Init(10000199, 20012000, 77, 65, 78, 66);
        }
    }
    //原始地圖:冰結的坑道B3F(20012000)
    //目標地圖:冰結的坑道B3F(20012000)
    //目標坐標:(77,65) ~ (78,66)

    public class P10000200 : RandomPortal
    {
        public P10000200()
        {
            Init(10000200, 20013000, 62, 67, 65, 69);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:永恆深淵聳立的門(20013000)
    //目標坐標:(62,67) ~ (65,69)

    public class P10000201 : RandomPortal
    {
        public P10000201()
        {
            Init(10000201, 10023000, 130, 139, 133, 140);
        }
    }
    //原始地圖:永恆深淵聳立的門(20013000)
    //目標地圖:上城(10023000)
    //目標坐標:(130,139) ~ (133,140)

    public class P10000202 : RandomPortal
    {
        public P10000202()
        {
            Init(10000202, 10001000, 90, 1, 93, 3);
        }
    }
    //原始地圖:
    //目標地圖:北方海角(10001000)
    //目標坐標:(90,1) ~ (93,3)

    public class P10000203 : RandomPortal
    {
        public P10000203()
        {
            Init(10000203, 10020000, 252, 158, 254, 161);
        }
    }
    //原始地圖:
    //目標地圖:殺人蜂山路(10020000)
    //目標坐標:(252,158) ~ (254,161)

    public class P10000204 : RandomPortal
    {
        public P10000204()
        {
            Init(10000204, 30040000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿2樓(30111000)
    //目標地圖:劍士行會(30040000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000205 : RandomPortal
    {
        public P10000205()
        {
            Init(10000205, 30041000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿2樓(30111000)
    //目標地圖:騎士行會(30041000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000206 : RandomPortal
    {
        public P10000206()
        {
            Init(10000206, 30042000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿2樓(30111000)
    //目標地圖:盜賊行會(30042000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000207 : RandomPortal
    {
        public P10000207()
        {
            Init(10000207, 30043000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿2樓(30111000)
    //目標地圖:弓手行會(30043000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000208 : RandomPortal
    {
        public P10000208()
        {
            Init(10000208, 30044000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿3樓(30112000)
    //目標地圖:魔法系行會(30044000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000209 : RandomPortal
    {
        public P10000209()
        {
            Init(10000209, 30045000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿3樓(30112000)
    //目標地圖:鐵匠行會(30045000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000210 : RandomPortal
    {
        public P10000210()
        {
            Init(10000210, 30046000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿3樓(30112000)
    //目標地圖:機械師行會(30046000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000211 : RandomPortal
    {
        public P10000211()
        {
            Init(10000211, 30047000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿3樓(30112000)
    //目標地圖:農夫行會(30047000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000212 : RandomPortal
    {
        public P10000212()
        {
            Init(10000212, 30048000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿4樓(30113000)
    //目標地圖:鍊金術師行會(30048000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000213 : RandomPortal
    {
        public P10000213()
        {
            Init(10000213, 30049000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿4樓(30113000)
    //目標地圖:木偶使行會(30049000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000214 : RandomPortal
    {
        public P10000214()
        {
            Init(10000214, 30050000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿4樓(30113000)
    //目標地圖:冒險家行會(30050000)
    //目標坐標:(3,6) ~ (3,6)

        
    //原始地圖:行會宮殿4樓(30113000)
    //目標地圖:商人行會(30051000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000216 : RandomPortal
    {
        public P10000216()
        {
            Init(10000216, 30052000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿5樓(30114000)
    //目標地圖:塔妮亞利益代表的房間(30052000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000217 : RandomPortal
    {
        public P10000217()
        {
            Init(10000217, 30053000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿5樓(30114000)
    //目標地圖:道米尼利益代表的房間(30053000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000218 : RandomPortal
    {
        public P10000218()
        {
            Init(10000218, 30054000, 3, 6, 3, 6);
        }
    }
    //原始地圖:行會宮殿5樓(30114000)
    //目標地圖:少數民族利益代表的房間(30054000)
    //目標坐標:(3,6) ~ (3,6)

    //原始地圖:行會宮殿5樓(30114000)
    //目標地圖:？？？的房間(30055000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000220 : RandomPortal
    {
        public P10000220()
        {
            Init(10000220, 30111000, 25, 13, 25, 13);
        }
    }
    //原始地圖:劍士行會(30040000)
    //目標地圖:行會宮殿2樓(30111000)
    //目標坐標:(25,13) ~ (25,13)

    public class P10000221 : RandomPortal
    {
        public P10000221()
        {
            Init(10000221, 30111000, 1, 13, 1, 13);
        }
    }
    //原始地圖:騎士行會(30041000)
    //目標地圖:行會宮殿2樓(30111000)
    //目標坐標:(1,13) ~ (1,13)

    public class P10000222 : RandomPortal
    {
        public P10000222()
        {
            Init(10000222, 30111000, 13, 25, 13, 25);
        }
    }
    //原始地圖:盜賊行會(30042000)
    //目標地圖:行會宮殿2樓(30111000)
    //目標坐標:(13,25) ~ (13,25)

    public class P10000223 : RandomPortal
    {
        public P10000223()
        {
            Init(10000223, 30111000, 13, 1, 13, 1);
        }
    }
    //原始地圖:弓手行會(30043000)
    //目標地圖:行會宮殿2樓(30111000)
    //目標坐標:(13,1) ~ (13,1)

    public class P10000224 : RandomPortal
    {
        public P10000224()
        {
            Init(10000224, 30112000, 25, 13, 25, 13);
        }
    }
    //原始地圖:魔法系行會(30044000)
    //目標地圖:行會宮殿3樓(30112000)
    //目標坐標:(25,13) ~ (25,13)

    public class P10000225 : RandomPortal
    {
        public P10000225()
        {
            Init(10000225, 30112000, 1, 13, 1, 13);
        }
    }
    //原始地圖:鐵匠行會(30045000)
    //目標地圖:行會宮殿3樓(30112000)
    //目標坐標:(1,13) ~ (1,13)

    public class P10000226 : RandomPortal
    {
        public P10000226()
        {
            Init(10000226, 30112000, 13, 25, 13, 25);
        }
    }
    //原始地圖:機械師行會(30046000)
    //目標地圖:行會宮殿3樓(30112000)
    //目標坐標:(13,25) ~ (13,25)

    public class P10000227 : RandomPortal
    {
        public P10000227()
        {
            Init(10000227, 30112000, 13, 1, 13, 1);
        }
    }
    //原始地圖:農夫行會(30047000)
    //目標地圖:行會宮殿3樓(30112000)
    //目標坐標:(13,1) ~ (13,1)

    public class S10000228 : Event
    {
        public S10000228()
        {
            this.EventID = 10000228;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 30113000, 25, 13);
        }
    }
    //原始地圖:鍊金術師行會(30048000)
    //目標地圖:行會宮殿4樓(30113000)
    //目標坐標:(25,13) ~ (25,13)


    //原始地圖:木偶使行會(30049000)
    //目標地圖:行會宮殿4樓(30113000)
    //目標坐標:(1,13) ~ (1,13)

    //原始地圖:冒險家行會(30050000)
    //目標地圖:行會宮殿4樓(30113000)
    //目標坐標:(13,25) ~ (13,25)


    //原始地圖:商人行會(30051000)
    //目標地圖:行會宮殿4樓(30113000)
    //目標坐標:(13,1) ~ (13,1)


    //原始地圖:塔妮亞利益代表的房間(30052000)
    //目標地圖:行會宮殿5樓(30114000)
    //目標坐標:(25,13) ~ (25,13)

    public class P10000233 : RandomPortal
    {
        public P10000233()
        {
            Init(10000233, 30114000, 1, 13, 1, 13);
        }
    }
    //原始地圖:道米尼利益代表的房間(30053000)
    //目標地圖:行會宮殿5樓(30114000)
    //目標坐標:(1,13) ~ (1,13)

    public class P10000234 : RandomPortal
    {
        public P10000234()
        {
            Init(10000234, 30114000, 13, 25, 13, 25);
        }
    }
    //原始地圖:少數民族利益代表的房間(30054000)
    //目標地圖:行會宮殿5樓(30114000)
    //目標坐標:(13,25) ~ (13,25)


    //原始地圖:？？？的房間(30055000)
    //目標地圖:行會宮殿5樓(30114000)
    //目標坐標:(13,1) ~ (13,1)

    public class P10000236 : RandomPortal
    {
        public P10000236()
        {
            Init(10000236, 20030000, 62, 10, 65, 12);
        }
    }
    //原始地圖:軍艦島(10035000)
    //目標地圖:廢炭礦B1F(20030000)
    //目標坐標:(62,10) ~ (65,12)

    public class P10000237 : RandomPortal
    {
        public P10000237()
        {
            Init(10000237, 10035000, 43, 192, 44, 195);
        }
    }
    //原始地圖:廢炭礦B1F(20030000)
    //目標地圖:軍艦島(10035000)
    //目標坐標:(43,192) ~ (44,195)

    public class P10000238 : RandomPortal
    {
        public P10000238()
        {
            Init(10000238, 20031000, 62, 113, 65, 115);
        }
    }
    //原始地圖:廢炭礦B1F(20030000)
    //目標地圖:廢炭礦B2F(20031000)
    //目標坐標:(62,113) ~ (65,115)

    public class P10000239 : RandomPortal
    {
        public P10000239()
        {
            Init(10000239, 20030000, 62, 115, 65, 117);
        }
    }
    //原始地圖:廢炭礦B2F(20031000)
    //目標地圖:廢炭礦B1F(20030000)
    //目標坐標:(62,115) ~ (65,117)

    public class P10000240 : RandomPortal
    {
        public P10000240()
        {
            Init(10000240, 20032000, 106, 113, 109, 115);
        }
    }
    //原始地圖:廢炭礦B2F(20031000)
    //目標地圖:廢炭礦B3F(20032000)
    //目標坐標:(106,113) ~ (109,115)

    public class P10000241 : RandomPortal
    {
        public P10000241()
        {
            Init(10000241, 20031000, 106, 113, 109, 115);
        }
    }
    //原始地圖:廢炭礦B3F(20032000)
    //目標地圖:廢炭礦B2F(20031000)
    //目標坐標:(106,113) ~ (109,115)

    public class P10000244 : RandomPortal
    {
        public P10000244()
        {
            Init(10000244, 10030001, 235, 132, 236, 133);
        }
    }
    //原始地圖:
    //目標地圖:迷宮之林(10030001)
    //目標坐標:(235,132) ~ (236,133)

    public class P10000245 : RandomPortal
    {
        public P10000245()
        {
            Init(10000245, 30201002, 7, 10, 7, 10);
        }
    }
    //原始地圖:
    //目標地圖:寵物廣場(30201002)
    //目標坐標:(7,10) ~ (7,10)

    public class P10000246 : RandomPortal
    {
        public P10000246()
        {
            Init(10000246, 10030001, 237, 99, 239, 99);
        }
    }
    //原始地圖:
    //目標地圖:迷宮之林(10030001)
    //目標坐標:(237,99) ~ (239,99)

    public class P10000248 : RandomPortal
    {
        public P10000248()
        {
            Init(10000248, 10003000, 2, 31, 3, 34);
        }
    }
    //原始地圖:瑞路斯雪原(10002000)
    //目標地圖:瑞路斯山道(10003000)
    //目標坐標:(2,31) ~ (3,34)

    public class P10000249 : RandomPortal
    {
        public P10000249()
        {
            Init(10000249, 10002000, 252, 30, 253, 33);
        }
    }
    //原始地圖:瑞路斯山道(10003000)
    //目標地圖:瑞路斯雪原(10002000)
    //目標坐標:(252,30) ~ (253,33)

    public class P10000250 : RandomPortal
    {
        public P10000250()
        {
            Init(10000250, 10003000, 77, 252, 80, 254);
        }
    }
    //原始地圖:奧克魯尼亞北部平原(10014000)
    //目標地圖:瑞路斯山道(10003000)
    //目標坐標:(77,252) ~ (80,254)

    public class P10000251 : RandomPortal
    {
        public P10000251()
        {
            Init(10000251, 10014000, 78, 1, 81, 3);
        }
    }
    //原始地圖:瑞路斯山道(10003000)
    //目標地圖:奧克魯尼亞北部平原(10014000)
    //目標坐標:(78,1) ~ (81,3)

    public class P10000252 : RandomPortal
    {
        public P10000252()
        {
            Init(10000252, 10004000, 2, 209, 3, 212);
        }
    }
    //原始地圖:瑞路斯山道(10003000)
    //目標地圖:瑞路斯分岔路(10004000)
    //目標坐標:(2,209) ~ (3,212)

    public class P10000253 : RandomPortal
    {
        public P10000253()
        {
            Init(10000253, 10003000, 252, 209, 253, 212);
        }
    }
    //原始地圖:瑞路斯分岔路(10004000)
    //目標地圖:瑞路斯山道(10003000)
    //目標坐標:(252,209) ~ (253,212)

    public class P10000254 : RandomPortal
    {
        public P10000254()
        {
            Init(10000254, 10001000, 194, 252, 197, 253);
        }
    }
    //原始地圖:瑞路斯分岔路(10004000)
    //目標地圖:北方海角(10001000)
    //目標坐標:(194,252) ~ (197,253)

    public class P10000255 : RandomPortal
    {
        public P10000255()
        {
            Init(10000255, 10004000, 193, 2, 196, 3);
        }
    }
    //原始地圖:北方海角(10001000)
    //目標地圖:瑞路斯分岔路(10004000)
    //目標坐標:(193,2) ~ (196,3)

    public class P10000256 : RandomPortal
    {
        public P10000256()
        {
            Init(10000256, 10015000, 1, 118, 3, 121);
        }
    }
    //原始地圖:奧克魯尼亞北部平原(10014000)
    //目標地圖:奧克魯尼亞叢林(10015000)
    //目標坐標:(1,118) ~ (3,121)

    //原始地圖:奧克魯尼亞叢林(10015000)
    //目標地圖:奧克魯尼亞北部平原(10014000)
    //目標坐標:(252,118) ~ (253,121)

    public class P10000258 : RandomPortal
    {
        public P10000258()
        {
            Init(10000258, 10017000, 2, 76, 3, 79);
        }
    }
    //原始地圖:奧克魯尼亞叢林(10015000)
    //目標地圖:帕斯特街道(10017000)
    //目標坐標:(2,76) ~ (3,79)

    public class P10000259 : RandomPortal
    {
        public P10000259()
        {
            Init(10000259, 10015000, 252, 74, 254, 77);
        }
    }
    //原始地圖:帕斯特街道(10017000)
    //目標地圖:奧克魯尼亞叢林(10015000)
    //目標坐標:(252,74) ~ (254,77)

    public class P10000260 : RandomPortal
    {
        public P10000260()
        {
            Init(10000260, 10025000, 99, 2, 102, 3);
        }
    }
    //原始地圖:奧克魯尼亞叢林(10015000)
    //目標地圖:奧克魯尼亞東部平原(10025000)
    //目標坐標:(99,2) ~ (102,3)

    public class P10000261 : RandomPortal
    {
        public P10000261()
        {
            Init(10000261, 10015000, 99, 252, 102, 253);
        }
    }
    //原始地圖:奧克魯尼亞東部平原(10025000)
    //目標地圖:奧克魯尼亞叢林(10015000)
    //目標坐標:(99,252) ~ (102,253)

    public class P10000262 : RandomPortal
    {
        public P10000262()
        {
            Init(10000262, 10025000, 202, 1, 205, 3);
        }
    }
    //原始地圖:奧克魯尼亞叢林(10015000)
    //目標地圖:奧克魯尼亞東部平原(10025000)
    //目標坐標:(202,1) ~ (205,3)

    public class P10000263 : RandomPortal
    {
        public P10000263()
        {
            Init(10000263, 10015000, 202, 252, 205, 254);
        }
    }
    //原始地圖:奧克魯尼亞東部平原(10025000)
    //目標地圖:奧克魯尼亞叢林(10015000)
    //目標坐標:(202,252) ~ (205,254)

    public class P10000264 : RandomPortal
    {
        public P10000264()
        {
            Init(10000264, 10018000, 2, 40, 4, 43);
        }
    }
    //原始地圖:帕斯特街道(10017000)
    //目標地圖:東方海角(10018000)
    //目標坐標:(2,40) ~ (4,43)

    public class P10000265 : RandomPortal
    {
        public P10000265()
        {
            Init(10000265, 10017000, 251, 40, 253, 43);
        }
    }
    //原始地圖:東方海角(10018000)
    //目標地圖:帕斯特街道(10017000)
    //目標坐標:(251,40) ~ (253,43)

    public class P10000266 : RandomPortal
    {
        public P10000266()
        {
            Init(10000266, 10020000, 1, 167, 3, 170);
        }
    }
    //原始地圖:不死島嶼(10019000)
    //目標地圖:殺人蜂山路(10020000)
    //目標坐標:(1,167) ~ (3,170)

    public class P10000267 : RandomPortal
    {
        public P10000267()
        {
            Init(10000267, 10019000, 252, 167, 253, 170);
        }
    }
    //原始地圖:殺人蜂山路(10020000)
    //目標地圖:不死島嶼(10019000)
    //目標坐標:(252,167) ~ (253,170)

    public class P10000268 : RandomPortal
    {
        public P10000268()
        {
            Init(10000268, 10028000, 40, 1, 43, 3);
        }
    }
    //原始地圖:殺人蜂山路(10020000)
    //目標地圖:摩爾瑞斷崖(10028000)
    //目標坐標:(40,1) ~ (43,3)

    public class P10000269 : RandomPortal
    {
        public P10000269()
        {
            Init(10000269, 10020000, 40, 252, 43, 254);
        }
    }
    //原始地圖:摩爾瑞斷崖(10028000)
    //目標地圖:殺人蜂山路(10020000)
    //目標坐標:(40,252) ~ (43,254)

    public class P10000270 : RandomPortal
    {
        public P10000270()
        {
            Init(10000270, 10022000, 1, 158, 3, 161);
        }
    }
    //原始地圖:殺人蜂山路(10020000)
    //目標地圖:奧克魯尼亞西部平原(10022000)
    //目標坐標:(1,158) ~ (3,161)

    public class P10000271 : RandomPortal
    {
        public P10000271()
        {
            Init(10000271, 10020000, 252, 158, 254, 161);
        }
    }
    //原始地圖:奧克魯尼亞西部平原(10022000)
    //目標地圖:殺人蜂山路(10020000)
    //目標坐標:(252,158) ~ (254,161)

    public class P10000272 : RandomPortal
    {
        public P10000272()
        {
            Init(10000272, 10030000, 192, 1, 195, 3);
        }
    }
    //原始地圖:奧克魯尼亞西部平原(10022000)
    //目標地圖:果樹森林(10030000)
    //目標坐標:(192,1) ~ (195,3)

    public class P10000273 : RandomPortal
    {
        public P10000273()
        {
            Init(10000273, 10022000, 192, 252, 195, 254);
        }
    }
    //原始地圖:果樹森林(10030000)
    //目標地圖:奧克魯尼亞西部平原(10022000)
    //目標坐標:(192,252) ~ (195,254)

    public class P10000274 : RandomPortal
    {
        public P10000274()
        {
            Init(10000274, 10019100, 93, 104, 93, 104);
        }
    }
    //原始地圖:不死島嶼(10019000)
    //目標地圖:不死島嶼(10019100)
    //目標坐標:(93,104) ~ (93,104)

    public class P10000275 : RandomPortal
    {
        public P10000275()
        {
            Init(10000275, 10019000, 110, 111, 112, 113);
        }
    }
    //原始地圖:不死島嶼(10019100)
    //目標地圖:不死島嶼(10019000)
    //目標坐標:(110,111) ~ (112,113)

    public class P10000276 : RandomPortal
    {
        public P10000276()
        {
            Init(10000276, 10004000, 2, 57, 3, 60);
        }
    }
    //原始地圖:瑞路斯山道(10003000)
    //目標地圖:瑞路斯分岔路(10004000)
    //目標坐標:(2,57) ~ (3,60)

    public class P10000277 : RandomPortal
    {
        public P10000277()
        {
            Init(10000277, 10003000, 252, 57, 253, 60);
        }
    }
    //原始地圖:瑞路斯分岔路(10004000)
    //目標地圖:瑞路斯山道(10003000)
    //目標坐標:(252,57) ~ (253,60)

    public class P10000278 : RandomPortal
    {
        public P10000278()
        {
            Init(10000278, 10032000, 61, 2, 64, 3);
        }
    }
    //原始地圖:奧克魯尼亞東部平原(10025000)
    //目標地圖:樂天娜湖泊(10032000)
    //目標坐標:(61,2) ~ (64,3)

    public class P10000279 : RandomPortal
    {
        public P10000279()
        {
            Init(10000279, 10025000, 62, 252, 65, 253);
        }
    }
    //原始地圖:樂天娜湖泊(10032000)
    //目標地圖:奧克魯尼亞東部平原(10025000)
    //目標坐標:(62,252) ~ (65,253)

    public class P10000280 : RandomPortal
    {
        public P10000280()
        {
            Init(10000280, 10035000, 244, 1, 247, 3);
        }
    }
    //原始地圖:摩爾瑞斷崖(10028000)
    //目標地圖:軍艦島(10035000)
    //目標坐標:(244,1) ~ (247,3)

    public class P10000281 : RandomPortal
    {
        public P10000281()
        {
            Init(10000281, 10028000, 1, 244, 3, 247);
        }
    }
    //原始地圖:軍艦島(10035000)
    //目標地圖:摩爾瑞斷崖(10028000)
    //目標坐標:(1,244) ~ (3,247)

    public class P10000282 : RandomPortal
    {
        public P10000282()
        {
            Init(10000282, 10042000, 217, 1, 220, 3);
        }
    }
    //原始地圖:果樹森林(10030000)
    //目標地圖:步伐沙漠(10042000)
    //目標坐標:(217,1) ~ (220,3)

    public class P10000283 : RandomPortal
    {
        public P10000283()
        {
            Init(10000283, 10030000, 217, 252, 220, 253);
        }
    }
    //原始地圖:步伐沙漠(10042000)
    //目標地圖:果樹森林(10030000)
    //目標坐標:(217,252) ~ (220,253)

    public class P10000284 : RandomPortal
    {
        public P10000284()
        {
            Init(10000284, 10043000, 154, 2, 157, 3);
        }
    }
    //原始地圖:奧克魯尼亞南部平原(10031000)
    //目標地圖:樂天娜湖泊下游(10043000)
    //目標坐標:(154,2) ~ (157,3)

    public class P10000285 : RandomPortal
    {
        public P10000285()
        {
            Init(10000285, 10031000, 154, 252, 157, 253);
        }
    }
    //原始地圖:樂天娜湖泊下游(10043000)
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(154,252) ~ (157,253)

    public class P10000288 : RandomPortal
    {
        public P10000288()
        {
            Init(10000288, 10034000, 1, 223, 3, 226);
        }
    }
    //原始地圖:樂天娜湖泊(10032000)
    //目標地圖:奧克魯尼亞東海岸(10034000)
    //目標坐標:(1,223) ~ (3,226)

    public class P10000289 : RandomPortal
    {
        public P10000289()
        {
            Init(10000289, 10032000, 252, 223, 254, 226);
        }
    }
    //原始地圖:奧克魯尼亞東海岸(10034000)
    //目標地圖:樂天娜湖泊(10032000)
    //目標坐標:(252,223) ~ (254,226)

    public class P10000290 : RandomPortal
    {
        public P10000290()
        {
            Init(10000290, 10046000, 56, 2, 59, 4);
        }
    }
    //原始地圖:步伐沙漠(10042000)
    //目標地圖:南方海角(10046000)
    //目標坐標:(56,2) ~ (59,4)

    public class P10000291 : RandomPortal
    {
        public P10000291()
        {
            Init(10000291, 10042000, 56, 252, 59, 254);
        }
    }
    //原始地圖:南方海角(10046000)
    //目標地圖:步伐沙漠(10042000)
    //目標坐標:(56,252) ~ (59,254)

    public class P10000292 : RandomPortal
    {
        public P10000292()
        {
            Init(10000292, 10046000, 56, 1, 59, 3);
        }
    }
    //原始地圖:步伐沙漠(10042000)
    //目標地圖:南方海角(10046000)
    //目標坐標:(56,1) ~ (59,3)

    public class P10000293 : RandomPortal
    {
        public P10000293()
        {
            Init(10000293, 10042000, 56, 251, 59, 253);
        }
    }
    //原始地圖:南方海角(10046000)
    //目標地圖:步伐沙漠(10042000)
    //目標坐標:(56,251) ~ (59,253)

    public class P10000298 : RandomPortal
    {
        public P10000298()
        {
            Init(10000298, 10043000, 1, 27, 3, 30);
        }
    }
    //原始地圖:步伐沙漠(10042000)
    //目標地圖:樂天娜湖泊下游(10043000)
    //目標坐標:(1,27) ~ (3,30)

    public class P10000299 : RandomPortal
    {
        public P10000299()
        {
            Init(10000299, 10042000, 252, 27, 254, 30);
        }
    }
    //原始地圖:樂天娜湖泊下游(10043000)
    //目標地圖:步伐沙漠(10042000)
    //目標坐標:(252,27) ~ (254,30)

    public class P10000300 : RandomPortal
    {
        public P10000300()
        {
            Init(10000300, 30800000, 1, 2, 1, 2);
        }
    }
    //原始地圖:
    //目標地圖:(30800000)
    //目標坐標:(1,2) ~ (1,2)

    public class P10000302 : RandomPortal
    {
        public P10000302()
        {
            Init(10000302, 10043000, 1, 226, 3, 229);
        }
    }
    //原始地圖:南方海角(10046000)
    //目標地圖:樂天娜湖泊下游(10043000)
    //目標坐標:(1,226) ~ (3,229)

    public class P10000303 : RandomPortal
    {
        public P10000303()
        {
            Init(10000303, 10046000, 199, 1, 202, 3);
        }
    }
    //原始地圖:樂天娜湖泊下游(10043000)
    //目標地圖:南方海角(10046000)
    //目標坐標:(199,1) ~ (202,3)

    public class P10000306 : RandomPortal
    {
        public P10000306()
        {
            Init(10000306, 30204003, 15, 3, 15, 3);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:有風之肉的地方(30204003)
    //目標坐標:(15,3) ~ (15,3)

    public class P10000307 : RandomPortal
    {
        public P10000307()
        {
            Init(10000307, 10023000, 126, 149, 128, 151);
        }
    }
    //原始地圖:有風之肉的地方(30204003)
    //目標地圖:上城(10023000)
    //目標坐標:(126,149) ~ (128,151)
    

    public class P10000309 : Event
    {
        public P10000309()
        {
            this.EventID = 10000309;
            //Init(10000309, 21180000, 52, 253, 83, 254);
        }

        public override void OnEvent(ActorPC pc)
        {
            if (DateTime.Now.Hour % 2 == 0)
            {
                Say(pc, 131, "现在是暖流$R;");
                Warp(pc, 21180000, 68, 253);
            }
            else
            {
                Say(pc, 131, "现在是寒流$R;");
                Warp(pc, 21180001, 68, 253);
            }
        }
    }
    //原始地圖:飄流水鄉(11053000)
    //目標地圖:海底洞窟(21180000)
    //目標坐標:(52,253) ~ (83,254)

    public class P10000310 : RandomPortal
    {
        public P10000310()
        {
            Init(10000310, 10058000, 2, 3, 2, 3);
        }
    }
    //原始地圖:升降機室(20170000)
    //目標地圖:通天之塔(10058000)
    //目標坐標:(2,3) ~ (2,3)

    public class P10000311 : RandomPortal
    {
        public P10000311()
        {
            Init(10000311, 20170000, 31, 17, 31, 17);
        }
    }
    //原始地圖:通天之塔(10058000)
    //目標地圖:升降機室(20170000)
    //目標坐標:(31,17) ~ (31,17)

    public class P10000313 : RandomPortal
    {
        public P10000313()
        {
            Init(10000313, 70000000, 5, 10, 5, 10);
        }
    }
    //原始地圖:
    //目標地圖:飛空庭(70000000)
    //目標坐標:(5,10) ~ (5,10)
    



    public class P10000320 : RandomPortal
    {
        public P10000320()
        {
            Init(10000320, 20000001, 62, 22, 65, 24);
        }
    }
    //原始地圖:
    //目標地圖:大陸之洞窟B1F(20000001)
    //目標坐標:(62,22) ~ (65,24)

    public class P10000321 : RandomPortal
    {
        public P10000321()
        {
            Init(10000321, 20001001, 105, 106, 107, 109);
        }
    }
    //原始地圖:大陸之洞窟B1F(20000001)
    //目標地圖:大陸之洞窟B2F(20001001)
    //目標坐標:(105,106) ~ (107,109)

    public class P10000322 : RandomPortal
    {
        public P10000322()
        {
            Init(10000322, 20000001, 105, 106, 107, 109);
        }
    }
    //原始地圖:大陸之洞窟B2F(20001001)
    //目標地圖:大陸之洞窟B1F(20000001)
    //目標坐標:(105,106) ~ (107,109)

    public class P10000323 : RandomPortal
    {
        public P10000323()
        {
            Init(10000323, 20002001, 20, 62, 22, 65);
        }
    }
    //原始地圖:大陸之洞窟B2F(20001001)
    //目標地圖:大陸之洞窟B3F(20002001)
    //目標坐標:(20,62) ~ (22,65)

    public class P10000324 : RandomPortal
    {
        public P10000324()
        {
            Init(10000324, 20001001, 20, 62, 22, 65);
        }
    }
    //原始地圖:大陸之洞窟B3F(20002001)
    //目標地圖:大陸之洞窟B2F(20001001)
    //目標坐標:(20,62) ~ (22,65)

    public class P10000325 : RandomPortal
    {
        public P10000325()
        {
            Init(10000325, 20010001, 62, 11, 65, 13);
        }
    }
    //原始地圖:
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(62,11) ~ (65,13)

    public class P10000326 : RandomPortal
    {
        public P10000326()
        {
            Init(10000326, 20010001, 42, 66, 45, 68);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(42,66) ~ (45,68)

    public class P10000327 : RandomPortal
    {
        public P10000327()
        {
            Init(10000327, 20010001, 57, 65, 58, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(57,65) ~ (58,66)

    public class P10000328 : RandomPortal
    {
        public P10000328()
        {
            Init(10000328, 20010001, 89, 65, 90, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(89,65) ~ (90,66)

    public class P10000329 : RandomPortal
    {
        public P10000329()
        {
            Init(10000329, 20010001, 69, 65, 70, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(69,65) ~ (70,66)

    public class P10000330 : RandomPortal
    {
        public P10000330()
        {
            Init(10000330, 20010001, 99, 112, 101, 115);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(99,112) ~ (101,115)

    public class P10000331 : RandomPortal
    {
        public P10000331()
        {
            Init(10000331, 20010001, 110, 111, 113, 113);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(110,111) ~ (113,113)

    public class P10000334 : RandomPortal
    {
        public P10000334()
        {
            Init(10000334, 20011001, 11, 108, 13, 111);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B2F(20011001)
    //目標坐標:(11,108) ~ (13,111)

    public class P10000335 : RandomPortal
    {
        public P10000335()
        {
            Init(10000335, 20010001, 10, 108, 12, 111);
        }
    }
    //原始地圖:冰結的坑道B2F(20011001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(10,108) ~ (12,111)

    public class P10000338 : RandomPortal
    {
        public P10000338()
        {
            Init(10000338, 20012001, 113, 64, 115, 67);
        }
    }
    //原始地圖:冰結的坑道B2F(20011001)
    //目標地圖:冰結的坑道B3F(20012001)
    //目標坐標:(113,64) ~ (115,67)

    public class P10000339 : RandomPortal
    {
        public P10000339()
        {
            Init(10000339, 20011001, 115, 64, 117, 67);
        }
    }
    //原始地圖:冰結的坑道B3F(20012001)
    //目標地圖:冰結的坑道B2F(20011001)
    //目標坐標:(115,64) ~ (117,67)

    public class P10000340 : RandomPortal
    {
        public P10000340()
        {
            Init(10000340, 20012001, 57, 64, 59, 67);
        }
    }
    //原始地圖:冰結的坑道B3F(20012001)
    //目標地圖:冰結的坑道B3F(20012001)
    //目標坐標:(57,64) ~ (59,67)

    public class P10000341 : RandomPortal
    {
        public P10000341()
        {
            Init(10000341, 20012001, 76, 64, 78, 67);
        }
    }
    //原始地圖:冰結的坑道B3F(20012001)
    //目標地圖:冰結的坑道B3F(20012001)
    //目標坐標:(76,64) ~ (78,67)

    public class P10000343 : RandomPortal
    {
        public P10000343()
        {
            Init(10000343, 20013001, 62, 67, 65, 69);
        }
    }
    //原始地圖:
    //目標地圖:永恆深淵聳立的門(20013001)
    //目標坐標:(62,67) ~ (65,69)

    public class P10000344 : RandomPortal
    {
        public P10000344()
        {
            Init(10000344, 20010002, 62, 11, 65, 13);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(62,11) ~ (65,13)

    public class P10000345 : RandomPortal
    {
        public P10000345()
        {
            Init(10000345, 20010002, 42, 66, 45, 68);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(42,66) ~ (45,68)

    public class P10000346 : RandomPortal
    {
        public P10000346()
        {
            Init(10000346, 20010002, 57, 65, 58, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(57,65) ~ (58,66)

    public class P10000347 : RandomPortal
    {
        public P10000347()
        {
            Init(10000347, 20010002, 89, 65, 90, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(89,65) ~ (90,66)

    public class P10000348 : RandomPortal
    {
        public P10000348()
        {
            Init(10000348, 20010002, 73, 64, 75, 67);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(73,64) ~ (75,67)

    public class P10000349 : RandomPortal
    {
        public P10000349()
        {
            Init(10000349, 20010002, 99, 112, 101, 115);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(99,112) ~ (101,115)

    public class P10000350 : RandomPortal
    {
        public P10000350()
        {
            Init(10000350, 20010002, 110, 111, 113, 113);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(110,111) ~ (113,113)

    public class P10000351 : RandomPortal
    {
        public P10000351()
        {
            Init(10000351, 20013002, 62, 67, 65, 69);
        }
    }
    //原始地圖:諾頓宮殿宴會廳(30160000)
    //目標地圖:寶物庫(20013002)
    //目標坐標:(62,67) ~ (65,69)

    public class P10000352 : RandomPortal
    {
        public P10000352()
        {
            Init(10000352, 20030001, 62, 10, 65, 12);
        }
    }
    //原始地圖:
    //目標地圖:廢炭礦B1F(20030001)
    //目標坐標:(62,10) ~ (65,12)

    public class P10000353 : RandomPortal
    {
        public P10000353()
        {
            Init(10000353, 20031001, 62, 113, 65, 15);
        }
    }
    //原始地圖:廢炭礦B1F(20030001)
    //目標地圖:廢炭礦B2F(20031001)
    //目標坐標:(62,113) ~ (65,115)

    public class P10000354 : RandomPortal
    {
        public P10000354()
        {
            Init(10000354, 20030001, 62, 115, 65, 117);
        }
    }
    //原始地圖:廢炭礦B2F(20031001)
    //目標地圖:廢炭礦B1F(20030001)
    //目標坐標:(62,115) ~ (65,117)

    public class P10000355 : RandomPortal
    {
        public P10000355()
        {
            Init(10000355, 20032001, 106, 113, 109, 115);
        }
    }
    //原始地圖:廢炭礦B2F(20031001)
    //目標地圖:廢炭礦B3F(20032001)
    //目標坐標:(106,113) ~ (109,115)

    public class P10000356 : RandomPortal
    {
        public P10000356()
        {
            Init(10000356, 20031001, 106, 113, 109, 115);
        }
    }
    //原始地圖:廢炭礦B3F(20032001)
    //目標地圖:廢炭礦B2F(20031001)
    //目標坐標:(106,113) ~ (109,115)

    public class P10000357 : RandomPortal
    {
        public P10000357()
        {
            Init(10000357, 20000002, 62, 22, 65, 24);
        }
    }
    //原始地圖:
    //目標地圖:大陸之洞窟B1F(20000002)
    //目標坐標:(62,22) ~ (65,24)

    public class P10000358 : RandomPortal
    {
        public P10000358()
        {
            Init(10000358, 20002002, 20, 62, 22, 65);
        }
    }
    //原始地圖:
    //目標地圖:(20002002)
    //目標坐標:(20,62) ~ (22,65)

    public class P10000359 : RandomPortal
    {
        public P10000359()
        {
            Init(10000359, 20030002, 62, 10, 65, 12);
        }
    }
    //原始地圖:
    //目標地圖:廢炭礦B1F(20030002)
    //目標坐標:(62,10) ~ (65,12)

    public class P10000360 : RandomPortal
    {
        public P10000360()
        {
            Init(10000360, 10001001, 125, 125, 130, 130);
        }
    }
    //原始地圖:
    //目標地圖:北方海角(10001001)
    //目標坐標:(125,125) ~ (130,130)

    public class P10000361 : RandomPortal
    {
        public P10000361()
        {
            Init(10000361, 10014001, 121, 125, 126, 130);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞北部平原(10014001)
    //目標坐標:(121,125) ~ (126,130)

    public class P10000364 : RandomPortal
    {
        public P10000364()
        {
            Init(10000364, 30020000, 3, 5, 3, 5);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:裁縫阿姨的家(30020000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000365 : RandomPortal
    {
        public P10000365()
        {
            Init(10000365, 10023000, 84, 98, 87, 99);
        }
    }
    //原始地圖:裁縫阿姨的家(30020000)
    //目標地圖:上城(10023000)
    //目標坐標:(84,98) ~ (87,99)

 
    //原始地圖:大陸之洞窟B5F(20004000)
    //目標地圖:瑪歐斯之故鄉(20004001)
    //目標坐標:(62,101) ~ (65,102)

    public class P10000367 : RandomPortal
    {
        public P10000367()
        {
            Init(10000367, 20004000, 54, 18, 59, 21);
        }
    }
    //原始地圖:瑪歐斯之故鄉(20004001)
    //目標地圖:大陸之洞窟B5F(20004000)
    //目標坐標:(54,18) ~ (59,21)

    public class P10000370 : RandomPortal
    {
        public P10000370()
        {
            Init(10000370, 30013000, 3, 5, 3, 5);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:武器製造所(30013000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000371 : RandomPortal
    {
        public P10000371()
        {
            Init(10000371, 10024000, 120, 207, 121, 208);
        }
    }
    //原始地圖:武器製造所(30013000)
    //目標地圖:下城(10024000)
    //目標坐標:(120,207) ~ (121,208)

    public class P10000400 : RandomPortal
    {
        public P10000400()
        {
            Init(10000400, 40000000, 2, 5, 2, 5);
        }
    }
    //原始地圖:
    //目標地圖:帳篷(40000000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10000401 : RandomPortal
    {
        public P10000401()
        {
            Init(10000401, 20013003, 62, 67, 65, 69);
        }
    }
    //原始地圖:帳篷(40000000)
    //目標地圖:奧克魯尼亞東部平原(20013003)
    //目標坐標:(62,67) ~ (65,69)

    public class P10000404 : RandomPortal
    {
        public P10000404()
        {
            Init(10000404, 10023100, 245, 122, 253, 133);
        }
    }
    //原始地圖:
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(245,122) ~ (253,133)

    public class P10000405 : RandomPortal
    {
        public P10000405()
        {
            Init(10000405, 10023200, 2, 122, 10, 133);
        }
    }
    //原始地圖:
    //目標地圖:上城西邊吊橋(10023200)
    //目標坐標:(2,122) ~ (10,133)

    public class P10000406 : RandomPortal
    {
        public P10000406()
        {
            Init(10000406, 10023300, 122, 245, 133, 253);
        }
    }
    //原始地圖:
    //目標地圖:上城南邊吊橋(10023300)
    //目標坐標:(122,245) ~ (133,253)

    public class P10000407 : RandomPortal
    {
        public P10000407()
        {
            Init(10000407, 10023400, 122, 2, 133, 10);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(122,2) ~ (133,10)

    public class P10000408 : RandomPortal
    {
        public P10000408()
        {
            Init(10000408, 10001000, 96, 21, 101, 27);
        }
    }
    //原始地圖:
    //目標地圖:北方海角(10001000)
    //目標坐標:(96,21) ~ (101,27)

    public class P10000409 : RandomPortal
    {
        public P10000409()
        {
            Init(10000409, 10018100, 225, 86, 231, 93);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018100)
    //目標坐標:(225,86) ~ (231,93)

    public class P10000410 : RandomPortal
    {
        public P10000410()
        {
            Init(10000410, 10020000, 103, 73, 113, 77);
        }
    }
    //原始地圖:
    //目標地圖:殺人蜂山路(10020000)
    //目標坐標:(103,73) ~ (113,77)

    public class P10000411 : RandomPortal
    {
        public P10000411()
        {
            Init(10000411, 10034000, 38, 111, 41, 118);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞東海岸(10034000)
    //目標坐標:(38,111) ~ (41,118)

    public class P10000412 : RandomPortal
    {
        public P10000412()
        {
            Init(10000412, 10035000, 54, 175, 65, 185);
        }
    }
    //原始地圖:
    //目標地圖:軍艦島(10035000)
    //目標坐標:(54,175) ~ (65,185)

    public class P10000413 : RandomPortal
    {
        public P10000413()
        {
            Init(10000413, 10046000, 150, 221, 157, 229);
        }
    }
    //原始地圖:
    //目標地圖:南方海角(10046000)
    //目標坐標:(150,221) ~ (157,229)

    public class P10000414 : RandomPortal
    {
        public P10000414()
        {
            Init(10000414, 10002000, 33, 220, 41, 228);
        }
    }
    //原始地圖:
    //目標地圖:瑞路斯雪原(10002000)
    //目標坐標:(33,220) ~ (41,228)

    public class P10000415 : RandomPortal
    {
        public P10000415()
        {
            Init(10000415, 10032000, 136, 111, 143, 116);
        }
    }
    //原始地圖:
    //目標地圖:樂天娜湖泊(10032000)
    //目標坐標:(136,111) ~ (143,116)

    public class P10000416 : RandomPortal
    {
        public P10000416()
        {
            Init(10000416, 10065000, 41, 123, 45, 126);
        }
    }
    //原始地圖:
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(41,123) ~ (45,126)

    public class P10000417 : RandomPortal
    {
        public P10000417()
        {
            Init(10000417, 10050000, 225, 117, 232, 124);
        }
    }
    //原始地圖:
    //目標地圖:北方中央山脈(10050000)
    //目標坐標:(225,117) ~ (232,124)

    public class P10000418 : RandomPortal
    {
        public P10000418()
        {
            Init(10000418, 10061000, 139, 45, 148, 49);
        }
    }
    //原始地圖:
    //目標地圖:鬼之寢岩(10061000)
    //目標坐標:(139,45) ~ (148,49)

    public class P10000419 : RandomPortal
    {
        public P10000419()
        {
            Init(10000419, 10063100, 122, 146, 127, 153);
        }
    }
    //原始地圖:
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(122,146) ~ (127,153)

    public class P10000420 : RandomPortal
    {
        public P10000420()
        {
            Init(10000420, 10024000, 201, 119, 207, 122);
        }
    }
    //原始地圖:
    //目標地圖:下城(10024000)
    //目標坐標:(201,119) ~ (207,122)

    public class P10000421 : RandomPortal
    {
        public P10000421()
        {
            Init(10000421, 10054000, 185, 135, 192, 139);
        }
    }
    //原始地圖:
    //目標地圖:謎之團要塞(10054000)
    //目標坐標:(185,135) ~ (192,139)

    public class P10000422 : RandomPortal
    {
        public P10000422()
        {
            Init(10000422, 10057000, 7, 120, 17, 126);
        }
    }
    //原始地圖:
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(7,120) ~ (17,126)

    public class P10000423 : RandomPortal
    {
        public P10000423()
        {
            Init(10000423, 10060000, 162, 142, 166, 151);
        }
    }
    //原始地圖:
    //目標地圖:摩根市(10060000)
    //目標坐標:(162,142) ~ (166,151)

    public class P10000424 : RandomPortal
    {
        public P10000424()
        {
            Init(10000424, 10018001, 133, 67, 135, 69);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018001)
    //目標坐標:(133,67) ~ (135,69)

    public class P10000425 : Event
    {
        public P10000425()
        {
            this.EventID = 10000425;
        }

        public override void OnEvent(ActorPC pc)
        {
            byte x, y;

            switch (Select(pc, "結束個人指導嗎?", "", "結束後去阿高普路斯市", "不結束"))
            {
                case 1:
                    x = (byte)Global.Random.Next(252, 253);
                    y = (byte)Global.Random.Next(126, 129);

                    Warp(pc, 10023100, x, y);
                    break;

                case 2:
                    break;
            }
        }
    }
    //原始地圖:奧克魯尼亞東部平原(10025001)
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(252,126) ~ (253,129)

    public class P10000426 : RandomPortal
    {
        public P10000426()
        {
            Init(10000426, 10014002, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014002)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000427 : RandomPortal
    {
        public P10000427()
        {
            Init(10000427, 10014002, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014002)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000428 : RandomPortal
    {
        public P10000428()
        {
            Init(10000428, 10062000, 81, 201, 89, 206);
        }
    }
    //原始地圖:
    //目標地圖:唐卡島(10062000)
    //目標坐標:(81,201) ~ (89,206)

    public class P10000429 : RandomPortal
    {
        public P10000429()
        {
            Init(10000429, 30200001, 0, 1, 4, 2);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:朝聖者的住宿設施(30200001)
    //目標坐標:(0,1) ~ (4,2)

    public class P10000430 : RandomPortal
    {
        public P10000430()
        {
            Init(10000430, 10018100, 194, 64, 196, 67);
        }
    }
    //原始地圖:東方海角(10018000)
    //目標地圖:東方海角(10018100)
    //目標坐標:(194,64) ~ (196,67)

    public class P10000431 : RandomPortal
    {
        public P10000431()
        {
            Init(10000431, 10018000, 187, 64, 189, 67);
        }
    }
    //原始地圖:東方海角(10018100)
    //目標地圖:東方海角(10018000)
    //目標坐標:(187,64) ~ (189,67)

    //原始地圖:東方海角(10018100)
    //目標地圖:民家(30020001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000433 : RandomPortal
    {
        public P10000433()
        {
            Init(10000433, 10018100, 202, 63, 204, 64);
        }
    }
    //原始地圖:民家(30020001)
    //目標地圖:東方海角(10018100)
    //目標坐標:(202,63) ~ (204,64)


    //原始地圖:東方海角(10018100)
    //目標地圖:商人之店(30060000)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000435 : RandomPortal
    {
        public P10000435()
        {
            Init(10000435, 10018100, 220, 66, 221, 67);
        }
    }
    //原始地圖:商人之店(30060000)
    //目標地圖:東方海角(10018100)
    //目標坐標:(220,66) ~ (221,67)

    public class P10000436 : RandomPortal
    {
        public P10000436()
        {
            Init(10000436, 30011000, 3, 5, 3, 5);
        }
    }
    //原始地圖:東方海角(10018100)
    //目標地圖:合成商店(30011000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000437 : RandomPortal
    {
        public P10000437()
        {
            Init(10000437, 10018100, 225, 71, 226, 72);
        }
    }
    //原始地圖:合成商店(30011000)
    //目標地圖:東方海角(10018100)
    //目標坐標:(225,71) ~ (226,72)

    public class P10000440 : RandomPortal
    {
        public P10000440()
        {
            Init(10000440, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)

    public class P10000441 : RandomPortal
    {
        public P10000441()
        {
            Init(10000441, 10014012, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014012)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000442 : RandomPortal
    {
        public P10000442()
        {
            Init(10000442, 10014012, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014012)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000443 : RandomPortal
    {
        public P10000443()
        {
            Init(10000443, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)

    public class P10000444 : RandomPortal
    {
        public P10000444()
        {
            Init(10000444, 10014022, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014022)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000445 : RandomPortal
    {
        public P10000445()
        {
            Init(10000445, 10014022, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014022)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000446 : RandomPortal
    {
        public P10000446()
        {
            Init(10000446, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)

    public class P10000447 : RandomPortal
    {
        public P10000447()
        {
            Init(10000447, 10014032, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014032)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000448 : RandomPortal
    {
        public P10000448()
        {
            Init(10000448, 10014032, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014032)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000449 : RandomPortal
    {
        public P10000449()
        {
            Init(10000449, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)

    public class P10000450 : RandomPortal
    {
        public P10000450()
        {
            Init(10000450, 10014042, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014042)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000451 : RandomPortal
    {
        public P10000451()
        {
            Init(10000451, 10014042, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014042)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000452 : RandomPortal
    {
        public P10000452()
        {
            Init(10000452, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)

    public class P10000453 : RandomPortal
    {
        public P10000453()
        {
            Init(10000453, 10014052, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014052)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000454 : RandomPortal
    {
        public P10000454()
        {
            Init(10000454, 10014052, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014052)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000455 : RandomPortal
    {
        public P10000455()
        {
            Init(10000455, 30140001, 9, 14, 13, 19);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞傳送室(30140001)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000456 : RandomPortal
    {
        public P10000456()
        {
            Init(10000456, 30140002, 9, 14, 13, 19);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞傳送室(30140002)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000457 : RandomPortal
    {
        public P10000457()
        {
            Init(10000457, 30141001, 9, 14, 13, 19);
        }
    }
    //原始地圖:
    //目標地圖:道米尼傳送室(30141001)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000458 : RandomPortal
    {
        public P10000458()
        {
            Init(10000458, 30141002, 9, 14, 13, 19);
        }
    }
    //原始地圖:
    //目標地圖:道米尼傳送室(30141002)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000459 : RandomPortal
    {
        public P10000459()
        {
            Init(10000459, 20080001, 24, 24, 26, 26);
        }
    }
    //原始地圖:
    //目標地圖:營運者調查室(20080001)
    //目標坐標:(24,24) ~ (26,26)

    public class P10000460 : RandomPortal
    {
        public P10000460()
        {
            Init(10000460, 20080002, 24, 24, 26, 26);
        }
    }
    //原始地圖:
    //目標地圖:營運者調查室(20080002)
    //目標坐標:(24,24) ~ (26,26)

    public class P10000461 : RandomPortal
    {
        public P10000461()
        {
            Init(10000461, 20080003, 24, 24, 26, 26);
        }
    }
    //原始地圖:
    //目標地圖:營運者調查室(20080003)
    //目標坐標:(24,24) ~ (26,26)

    public class P10000462 : RandomPortal
    {
        public P10000462()
        {
            Init(10000462, 20080004, 24, 24, 26, 26);
        }
    }
    //原始地圖:
    //目標地圖:營運者調查室(20080004)
    //目標坐標:(24,24) ~ (26,26)

    public class P10000463 : RandomPortal
    {
        public P10000463()
        {
            Init(10000463, 20080005, 24, 24, 26, 26);
        }
    }
    //原始地圖:
    //目標地圖:營運者調查室(20080005)
    //目標坐標:(24,24) ~ (26,26)

    public class P10000464 : RandomPortal
    {
        public P10000464()
        {
            Init(10000464, 10017001, 133, 67, 136, 70);
        }
    }
    //原始地圖:帕斯特街道(10017000)
    //目標地圖:農夫農場(10017001)
    //目標坐標:(133,67) ~ (136,70)

    public class P10000465 : RandomPortal
    {
        public P10000465()
        {
            Init(10000465, 10017000, 133, 67, 136, 70);
        }
    }
    //原始地圖:農夫農場(10017001)
    //目標地圖:帕斯特街道(10017000)
    //目標坐標:(133,67) ~ (136,70)

    public class P10000466 : RandomPortal
    {
        public P10000466()
        {
            Init(10000466, 30100001, 4, 14, 6, 15);
        }
    }
    //原始地圖:
    //目標地圖:接待室(30100001)
    //目標坐標:(4,14) ~ (6,15)

    public class P10000467 : RandomPortal
    {
        public P10000467()
        {
            Init(10000467, 20080000, 23, 10, 27, 10);
        }
    }
    //原始地圖:
    //目標地圖:鬥技場(20080000)
    //目標坐標:(23,10) ~ (27,10)

        
    //原始地圖:無限回廊B20F(20071019)
    //目標地圖:無限回廊B21F(20070020)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000540 : 無限回廊出口
    {
        public P10000540()
        {
            this.EventID = 10000540;
        }
    }
    //原始地圖:無限回廊B21F(20070020)
    //目標地圖:無限回廊B20F(20071019)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000541 : 無限回廊傳送點
    {
        public P10000541()
        {
            Init(10000541, 10010020, 20070021, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B21F(20070020)
    //目標地圖:無限回廊B22F(20070021)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000542 : 無限回廊出口
    {
        public P10000542()
        {
            this.EventID = 10000542;
        }
    }
    //原始地圖:無限回廊B22F(20070021)
    //目標地圖:無限回廊B21F(20070020)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000543 : 無限回廊傳送點
    {
        public P10000543()
        {
            Init(10000543, 10010021, 20070022, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B22F(20070021)
    //目標地圖:無限回廊B23F(20070022)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000544 : 無限回廊出口
    {
        public P10000544()
        {
            this.EventID = 10000544;
        }
    }
    //原始地圖:無限回廊B23F(20070022)
    //目標地圖:無限回廊B22F(20070021)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000545 : 無限回廊傳送點
    {
        public P10000545()
        {
            Init(10000545, 10010022, 20070023, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B23F(20070022)
    //目標地圖:無限回廊B24F(20070023)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000546 : 無限回廊出口
    {
        public P10000546()
        {
            this.EventID = 10000546;
        }
    }
    //原始地圖:無限回廊B24F(20070023)
    //目標地圖:無限回廊B23F(20070022)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000547 : 無限回廊傳送點
    {
        public P10000547()
        {
            Init(10000547, 10010023, 20070024, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B24F(20070023)
    //目標地圖:無限回廊B25F(20070024)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000548 : 無限回廊出口
    {
        public P10000548()
        {
            this.EventID = 10000548;
        }
    }
    //原始地圖:無限回廊B25F(20070024)
    //目標地圖:無限回廊B24F(20070023)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000549 : 無限回廊傳送點
    {
        public P10000549()
        {
            Init(10000549, 10010024, 20070025, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B25F(20070024)
    //目標地圖:無限回廊B26F(20070025)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000550 : 無限回廊出口
    {
        public P10000550()
        {
            this.EventID = 10000550;
        }
    }
    //原始地圖:無限回廊B26F(20070025)
    //目標地圖:無限回廊B25F(20070024)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000551 : 無限回廊傳送點
    {
        public P10000551()
        {
            Init(10000551, 10010025, 20070026, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B26F(20070025)
    //目標地圖:無限回廊B27F(20070026)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000552 : 無限回廊出口
    {
        public P10000552()
        {
            this.EventID = 10000552;
        }
    }
    //原始地圖:無限回廊B27F(20070026)
    //目標地圖:無限回廊B26F(20070025)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000553 : 無限回廊傳送點
    {
        public P10000553()
        {
            Init(10000553, 10010026, 20070027, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B27F(20070026)
    //目標地圖:無限回廊B28F(20070027)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000554 : 無限回廊出口
    {
        public P10000554()
        {
            this.EventID = 10000554;
        }
    }
    //原始地圖:無限回廊B28F(20070027)
    //目標地圖:無限回廊B27F(20070026)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000555 : 無限回廊傳送點
    {
        public P10000555()
        {
            Init(10000555, 10010027, 20070028, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B28F(20070027)
    //目標地圖:無限回廊B29F(20070028)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000556 : 無限回廊出口
    {
        public P10000556()
        {
            this.EventID = 10000556;
        }
    }
    //原始地圖:無限回廊B29F(20070028)
    //目標地圖:無限回廊B28F(20070027)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000557 : 無限回廊傳送點
    {
        public P10000557()
        {
            Init(10000557, 10010028, 20071029, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B29F(20070028)
    //目標地圖:無限回廊B30F(20071029)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000558 : 無限回廊出口
    {
        public P10000558()
        {
            this.EventID = 10000558;
        }
    }
    //原始地圖:無限回廊B30F(20071029)
    //目標地圖:無限回廊B29F(20070028)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000559 : 無限回廊傳送點
    {
        public P10000559()
        {
            Init(10000559, 10010029, 20070030, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B30F(20071029)
    //目標地圖:無限回廊B31F(20070030)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000560 : 無限回廊出口
    {
        public P10000560()
        {
            this.EventID = 10000560;
        }
    }
    //原始地圖:無限回廊B31F(20070030)
    //目標地圖:無限回廊B30F(20071029)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000561 : 無限回廊傳送點
    {
        public P10000561()
        {
            Init(10000561, 10010030, 20070031, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B31F(20070030)
    //目標地圖:無限回廊B32F(20070031)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000562 : 無限回廊出口
    {
        public P10000562()
        {
            this.EventID = 10000562;
        }
    }
    //原始地圖:無限回廊B32F(20070031)
    //目標地圖:無限回廊B31F(20070030)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000563 : 無限回廊傳送點
    {
        public P10000563()
        {
            Init(10000563, 10010031, 20070032, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B32F(20070031)
    //目標地圖:無限回廊B33F(20070032)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000564 : 無限回廊出口
    {
        public P10000564()
        {
            this.EventID = 10000564;
        }
    }
    //原始地圖:無限回廊B33F(20070032)
    //目標地圖:無限回廊B32F(20070031)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000565 : 無限回廊傳送點
    {
        public P10000565()
        {
            Init(10000565, 10010032, 20070033, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B33F(20070032)
    //目標地圖:無限回廊B34F(20070033)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000566 : 無限回廊出口
    {
        public P10000566()
        {
            this.EventID = 10000566;
        }
    }
    //原始地圖:無限回廊B34F(20070033)
    //目標地圖:無限回廊B33F(20070032)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000567 : 無限回廊傳送點
    {
        public P10000567()
        {
            Init(10000567, 10010033, 20070034, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B34F(20070033)
    //目標地圖:無限回廊B35F(20070034)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000568 : 無限回廊出口
    {
        public P10000568()
        {
            this.EventID = 10000568;
        }
    }
    //原始地圖:無限回廊B35F(20070034)
    //目標地圖:無限回廊B34F(20070033)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000569 : 無限回廊傳送點
    {
        public P10000569()
        {
            Init(10000569, 10010034, 20070035, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B35F(20070034)
    //目標地圖:無限回廊B36F(20070035)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000570 : 無限回廊出口
    {
        public P10000570()
        {
            this.EventID = 10000570;
        }
    }
    //原始地圖:無限回廊B36F(20070035)
    //目標地圖:無限回廊B35F(20070034)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000571 : 無限回廊傳送點
    {
        public P10000571()
        {
            Init(10000571, 10010035, 20070036, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B36F(20070035)
    //目標地圖:無限回廊B37F(20070036)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000572 : 無限回廊出口
    {
        public P10000572()
        {
            this.EventID = 10000572;
        }
    }
    //原始地圖:無限回廊B37F(20070036)
    //目標地圖:無限回廊B36F(20070035)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000573 : 無限回廊傳送點
    {
        public P10000573()
        {
            Init(10000573, 10010036, 20070037, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B37F(20070036)
    //目標地圖:無限回廊B38F(20070037)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000574 : 無限回廊出口
    {
        public P10000574()
        {
            this.EventID = 10000574;
        }
    }
    //原始地圖:無限回廊B38F(20070037)
    //目標地圖:無限回廊B37F(20070036)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000575 : 無限回廊傳送點
    {
        public P10000575()
        {
            Init(10000575, 10010037, 20070038, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B38F(20070037)
    //目標地圖:無限回廊B39F(20070038)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000576 : 無限回廊出口
    {
        public P10000576()
        {
            this.EventID = 10000576;
        }
    }
    //原始地圖:無限回廊B39F(20070038)
    //目標地圖:無限回廊B38F(20070037)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000577 : 無限回廊傳送點
    {
        public P10000577()
        {
            Init(10000577, 10010038, 20071039, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B39F(20070038)
    //目標地圖:無限回廊B40F(20071039)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000578 : 無限回廊出口
    {
        public P10000578()
        {
            this.EventID = 10000578;
        }
    }
    //原始地圖:無限回廊B40F(20071039)
    //目標地圖:無限回廊B39F(20070038)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000579 : RandomPortal
    {
        public P10000579()
        {
            Init(10000579, 20070040, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B40F(20071039)
    //目標地圖:無限回廊B41F(20070040)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000580 : 無限回廊出口
    {
        public P10000580()
        {
            this.EventID = 10000580;
        }
    }
    //原始地圖:無限回廊B41F(20070040)
    //目標地圖:無限回廊B40F(20071039)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000581 : RandomPortal
    {
        public P10000581()
        {
            Init(10000581, 20070041, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B41F(20070040)
    //目標地圖:無限回廊B42F(20070041)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000582 : 無限回廊出口
    {
        public P10000582()
        {
            this.EventID = 10000582;
        }
    }
    //原始地圖:無限回廊B42F(20070041)
    //目標地圖:無限回廊B41F(20070040)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000583 : RandomPortal
    {
        public P10000583()
        {
            Init(10000583, 20070042, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B42F(20070041)
    //目標地圖:無限回廊B43F(20070042)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000584 : 無限回廊出口
    {
        public P10000584()
        {
            this.EventID = 10000584;
        }
    }
    //原始地圖:無限回廊B43F(20070042)
    //目標地圖:無限回廊B42F(20070041)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000585 : RandomPortal
    {
        public P10000585()
        {
            Init(10000585, 20070043, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B43F(20070042)
    //目標地圖:無限回廊B44F(20070043)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000586 : 無限回廊出口
    {
        public P10000586()
        {
            this.EventID = 10000586;
        }
    }
    //原始地圖:無限回廊B44F(20070043)
    //目標地圖:無限回廊B43F(20070042)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000587 : RandomPortal
    {
        public P10000587()
        {
            Init(10000587, 20070044, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B44F(20070043)
    //目標地圖:無限回廊B45F(20070044)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000588 : 無限回廊出口
    {
        public P10000588()
        {
            this.EventID = 10000588;
        }
    }
    //原始地圖:無限回廊B45F(20070044)
    //目標地圖:無限回廊B44F(20070043)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000589 : RandomPortal
    {
        public P10000589()
        {
            Init(10000589, 20070045, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B45F(20070044)
    //目標地圖:無限回廊B46F(20070045)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000590 : 無限回廊出口
    {
        public P10000590()
        {
            this.EventID = 10000590;
        }
    }
    //原始地圖:無限回廊B46F(20070045)
    //目標地圖:無限回廊B45F(20070044)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000591 : RandomPortal
    {
        public P10000591()
        {
            Init(10000591, 20070046, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B46F(20070045)
    //目標地圖:無限回廊B47F(20070046)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000592 : 無限回廊出口
    {
        public P10000592()
        {
            this.EventID = 10000592;
        }
    }
    //原始地圖:無限回廊B47F(20070046)
    //目標地圖:無限回廊B46F(20070045)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000593 : RandomPortal
    {
        public P10000593()
        {
            Init(10000593, 20070047, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B47F(20070046)
    //目標地圖:無限回廊B48F(20070047)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000594 : 無限回廊出口
    {
        public P10000594()
        {
            this.EventID = 10000594;
        }
    }
    //原始地圖:無限回廊B48F(20070047)
    //目標地圖:無限回廊B47F(20070046)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000595 : RandomPortal
    {
        public P10000595()
        {
            Init(10000595, 20070048, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B48F(20070047)
    //目標地圖:無限回廊B49F(20070048)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000596 : 無限回廊出口
    {
        public P10000596()
        {
            this.EventID = 10000596;
        }
    }
    //原始地圖:無限回廊B49F(20070048)
    //目標地圖:無限回廊B48F(20070047)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000597 : RandomPortal
    {
        public P10000597()
        {
            Init(10000597, 20071049, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B49F(20070048)
    //目標地圖:無限回廊B50F(20071049)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000598 : 無限回廊出口
    {
        public P10000598()
        {
            this.EventID = 10000598;
        }
    }
    //原始地圖:無限回廊B50F(20071049)
    //目標地圖:無限回廊B49F(20070048)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000599 : RandomPortal
    {
        public P10000599()
        {
            Init(10000599, 20070000, 22, 83, 25, 85);
        }
    }
    //原始地圖:
    //目標地圖:無限回廊B1F(20070000)
    //目標坐標:(22,83) ~ (25,85)



    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓咖啡館(30010001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000601 : RandomPortal
    {
        public P10000601()
        {
            Init(10000601, 10065000, 65, 186, 65, 187);
        }
    }
    //原始地圖:諾頓咖啡館(30010001)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(65,186) ~ (65,187)

    public class P10000602 : RandomPortal
    {
        public P10000602()
        {
            Init(10000602, 30012001, 3, 5, 3, 5);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓武器商人(30012001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000603 : RandomPortal
    {
        public P10000603()
        {
            Init(10000603, 10065000, 65, 172, 65, 173);
        }
    }
    //原始地圖:諾頓武器商人(30012001)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(65,172) ~ (65,173)

    public class P10000606 : RandomPortal
    {
        public P10000606()
        {
            Init(10000606, 30001001, 2, 4, 2, 4);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓魔法商店(30001001)
    //目標坐標:(2,4) ~ (2,4)

    public class P10000607 : RandomPortal
    {
        public P10000607()
        {
            Init(10000607, 10065000, 65, 152, 65, 153);
        }
    }
    //原始地圖:諾頓魔法商店(30001001)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(65,152) ~ (65,153)

    public class P10000608 : RandomPortal
    {
        public P10000608()
        {
            Init(10000608, 30060001, 4, 7, 4, 7);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓商店(30060001)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000609 : RandomPortal
    {
        public P10000609()
        {
            Init(10000609, 10065000, 65, 146, 65, 147);
        }
    }
    //原始地圖:諾頓商店(30060001)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(65,146) ~ (65,147)

    public class P10000610 : RandomPortal
    {
        public P10000610()
        {
            Init(10000610, 30011001, 3, 5, 3, 5);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓鑑定所(30011001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000611 : RandomPortal
    {
        public P10000611()
        {
            Init(10000611, 10065000, 65, 132, 65, 133);
        }
    }
    //原始地圖:諾頓鑑定所(30011001)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(65,132) ~ (65,133)

    public class P10000612 : RandomPortal
    {
        public P10000612()
        {
            Init(10000612, 30011002, 3, 5, 3, 5);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓鑑定所(30011002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000613 : RandomPortal
    {
        public P10000613()
        {
            Init(10000613, 10065000, 38, 186, 38, 187);
        }
    }
    //原始地圖:諾頓鑑定所(30011002)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(38,186) ~ (38,187)

    public class P10000614 : RandomPortal
    {
        public P10000614()
        {
            Init(10000614, 30060002, 4, 7, 4, 7);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓商店(30060002)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000615 : RandomPortal
    {
        public P10000615()
        {
            Init(10000615, 10065000, 38, 172, 38, 173);
        }
    }
    //原始地圖:諾頓商店(30060002)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(38,172) ~ (38,173)

    public class P10000616 : RandomPortal
    {
        public P10000616()
        {
            Init(10000616, 30020002, 3, 5, 3, 5);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓裁縫店(30020002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000617 : RandomPortal
    {
        public P10000617()
        {
            Init(10000617, 10065000, 38, 152, 38, 153);
        }
    }
    //原始地圖:諾頓裁縫店(30020002)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(38,152) ~ (38,153)

    public class P10000618 : RandomPortal
    {
        public P10000618()
        {
            Init(10000618, 30021001, 3, 5, 3, 5);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓寶石商店(30021001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000619 : RandomPortal
    {
        public P10000619()
        {
            Init(10000619, 10065000, 38, 146, 38, 147);
        }
    }
    //原始地圖:諾頓寶石商店(30021001)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(38,146) ~ (38,147)

    public class P10000620 : RandomPortal
    {
        public P10000620()
        {
            Init(10000620, 30010002, 3, 5, 3, 5);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓咖啡館(30010002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000621 : RandomPortal
    {
        public P10000621()
        {
            Init(10000621, 10065000, 38, 132, 38, 133);
        }
    }
    //原始地圖:諾頓咖啡館(30010002)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(38,132) ~ (38,133)

    public class P10000622 : RandomPortal
    {
        public P10000622()
        {
            Init(10000622, 30163000, 11, 23, 13, 24);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:魔法行會總部門廊(30163000)
    //目標坐標:(11,23) ~ (13,24)

    public class P10000623 : RandomPortal
    {
        public P10000623()
        {
            Init(10000623, 10065000, 59, 80, 63, 82);
        }
    }
    //原始地圖:魔法行會總部門廊(30163000)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(59,80) ~ (63,82)


    /*
    public class P10000624 : RandomPortal
    {
        public P10000624()
        {
            Init(10000624, 30164000, 8, 16, 10, 16);
        }
    }
    */

    //原始地圖:魔法行會總部門廊(30163000)
    //目標地圖:大導師的房間(30164000)
    //目標坐標:(8,16) ~ (10,16)

    public class P10000625 : RandomPortal
    {
        public P10000625()
        {
            Init(10000625, 30163000, 11, 3, 13, 4);
        }
    }
    //原始地圖:大導師的房間(30164000)
    //目標地圖:魔法行會總部門廊(30163000)
    //目標坐標:(11,3) ~ (13,4)

    public class P10000626 : RandomPortal
    {
        public P10000626()
        {
            Init(10000626, 30165000, 2, 6, 2, 6);
        }
    }
    //原始地圖:魔法行會總部門廊(30163000)
    //目標地圖:總部的房間(30165000)
    //目標坐標:(2,6) ~ (2,6)

    public class P10000627 : RandomPortal
    {
        public P10000627()
        {
            Init(10000627, 30163000, 11, 3, 13, 4);
        }
    }
    //原始地圖:總部的房間(30165000)
    //目標地圖:魔法行會總部門廊(30163000)
    //目標坐標:(11,3) ~ (13,4)

    public class P10000628 : RandomPortal
    {
        public P10000628()
        {
            Init(10000628, 30160000, 10, 21, 13, 23);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓宮殿宴會廳(30160000)
    //目標坐標:(10,21) ~ (13,23)

    public class P10000629 : RandomPortal
    {
        public P10000629()
        {
            Init(10000629, 10065000, 50, 21, 53, 24);
        }
    }
    //原始地圖:諾頓宮殿宴會廳(30160000)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(50,21) ~ (53,24)

    public class P10000630 : RandomPortal
    {
        public P10000630()
        {
            Init(10000630, 10067000, 36, 61, 38, 62);
        }
    }
    //原始地圖:諾頓宮殿宴會廳(30160000)
    //目標地圖:女王謁見之間(10067000)
    //目標坐標:(36,61) ~ (38,62)

    public class P10000631 : RandomPortal
    {
        public P10000631()
        {
            Init(10000631, 30160000, 10, 2, 13, 3);
        }
    }
    //原始地圖:女王謁見之間(10067000)
    //目標地圖:諾頓宮殿宴會廳(30160000)
    //目標坐標:(10,2) ~ (13,3)



    public class S10000632 : Event
    {
        public S10000632()
        {
            this.EventID = 10000632;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (CountItem(pc, 10043303) > 0)
            {
                Warp(pc, 30162000, 8, 16);
                return;
            }
            if (pc.Gender == PC_GENDER.MALE)
            {
                Warp(pc, 30162000, 8, 16);
                return;
            }
            Say(pc, 131, "女士們請回吧$R;");
        }
    }

    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓王國軍等候室(30162000)
    //目標坐標:(8,16) ~ (10,17)

    public class P10000633 : RandomPortal
    {
        public P10000633()
        {
            Init(10000633, 10065000, 32, 6, 33, 7);
        }
    }
    //原始地圖:諾頓王國軍等候室(30162000)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(32,6) ~ (33,7)


    public class S10000634 : Event
    {
        public S10000634()
        {
            this.EventID = 10000634;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (CountItem(pc, 10005581) > 0)
            {
                Warp(pc, 30162001, 8, 16);
                return;
            }
            if (pc.Gender == PC_GENDER.FEMALE)
            {
                Warp(pc, 30162001, 8, 16);
                return;
            }
            Say(pc, 131, "男士們請回吧$R;");
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:諾頓王國軍等候室(30162001)
    //目標坐標:(8,16) ~ (10,17)

    public class P10000635 : RandomPortal
    {
        public P10000635()
        {
            Init(10000635, 10065000, 70, 6, 71, 7);
        }
    }
    //原始地圖:諾頓王國軍等候室(30162001)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(70,6) ~ (71,7)

    public class P10000636 : RandomPortal
    {
        public P10000636()
        {
            Init(10000636, 30171000, 3, 6, 3, 6);
        }
    }
    //原始地圖:北方中央山脈(10050001)
    //目標地圖:伊戈路雜貨商人(30171000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000637 : RandomPortal
    {
        public P10000637()
        {
            Init(10000637, 10050001, 222, 134, 222, 134);
        }
    }
    //原始地圖:伊戈路雜貨商人(30171000)
    //目標地圖:北方中央山脈(10050001)
    //目標坐標:(222,134) ~ (222,134)

        
    //原始地圖:永恆之北部極地(10051000)
    //目標地圖:伊戈路(30170000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000639 : RandomPortal
    {
        public P10000639()
        {
            Init(10000639, 10051000, 164, 128, 166, 129);
        }
    }
    //原始地圖:伊戈路(30170000)
    //目標地圖:永恆之北部極地(10051000)
    //目標坐標:(164,128) ~ (166,129)

    public class P10000640 : RandomPortal
    {
        public P10000640()
        {
            Init(10000640, 30171001, 3, 6, 3, 6);
        }
    }
    //原始地圖:北部地牢(20014000)
    //目標地圖:伊戈路雜貨商人(30171001)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000641 : RandomPortal
    {
        public P10000641()
        {
            Init(10000641, 20014000, 14, 160, 14, 160);
        }
    }
    //原始地圖:伊戈路雜貨商人(30171001)
    //目標地圖:北部地牢(20014000)
    //目標坐標:(14,160) ~ (14,160)

    public class P10000642 : RandomPortal
    {
        public P10000642()
        {
            Init(10000642, 30163000, 11, 23, 13, 24);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:魔法行會總部門廊(30163000)
    //目標坐標:(11,23) ~ (13,24)

    public class P10000643 : RandomPortal
    {
        public P10000643()
        {
            Init(10000643, 30163000, 11, 23, 13, 24);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:魔法行會總部門廊(30163000)
    //目標坐標:(11,23) ~ (13,24)

    public class P10000644 : RandomPortal
    {
        public P10000644()
        {
            Init(10000644, 30163000, 11, 23, 13, 24);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:魔法行會總部門廊(30163000)
    //目標坐標:(11,23) ~ (13,24)

    public class P10000646 : RandomPortal
    {
        public P10000646()
        {
            Init(10000646, 30165001, 2, 6, 2, 6);
        }
    }
    //原始地圖:魔法行會總部門廊(30163000)
    //目標地圖:總部的秘密房間(30165001)
    //目標坐標:(2,6) ~ (2,6)

    public class P10000648 : RandomPortal
    {
        public P10000648()
        {
            Init(10000648, 30030001, 1, 1, 3, 2);
        }
    }
    //原始地圖:
    //目標地圖:道具的小部屋(30030001)
    //目標坐標:(1,1) ~ (3,2)

    public class P10000649 : RandomPortal
    {
        public P10000649()
        {
            Init(10000649, 20012002, 113, 64, 114, 67);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20012002)
    //目標坐標:(113,64) ~ (114,67)

    public class P10000650 : RandomPortal
    {
        public P10000650()
        {
            Init(10000650, 20012002, 56, 64, 58, 67);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20012002)
    //目標坐標:(56,64) ~ (58,67)

    public class P10000651 : RandomPortal
    {
        public P10000651()
        {
            Init(10000651, 20012002, 79, 64, 80, 67);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20012002)
    //目標坐標:(79,64) ~ (80,67)

    public class P10000652 : RandomPortal
    {
        public P10000652()
        {
            Init(10000652, 30030002, 1, 1, 3, 2);
        }
    }
    //原始地圖:
    //目標地圖:活動木偶的小屋(30030002)
    //目標坐標:(1,1) ~ (3,2)

    public class P10000653 : RandomPortal
    {
        public P10000653()
        {
            Init(10000653, 20002003, 70, 69, 73, 70);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20002003)
    //目標坐標:(70,69) ~ (73,70)

    public class P10000654 : RandomPortal
    {
        public P10000654()
        {
            Init(10000654, 20002003, 97, 31, 99, 33);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20002003)
    //目標坐標:(97,31) ~ (99,33)

    public class P10000655 : RandomPortal
    {
        public P10000655()
        {
            Init(10000655, 20002003, 97, 48, 98, 49);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20002003)
    //目標坐標:(97,48) ~ (98,49)

    public class P10000656 : RandomPortal
    {
        public P10000656()
        {
            Init(10000656, 20080006, 14, 14, 36, 36);
        }
    }
    //原始地圖:
    //目標地圖:訓練所1F(20080006)
    //目標坐標:(14,14) ~ (36,36)

    public class P10000657 : RandomPortal
    {
        public P10000657()
        {
            Init(10000657, 20002003, 21, 63, 23, 65);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20002003)
    //目標坐標:(21,63) ~ (23,65)

    public class P10000658 : RandomPortal
    {
        public P10000658()
        {
            Init(10000658, 20080000, 25, 43, 25, 43);
        }
    }
    //原始地圖:
    //目標地圖:鬥技場(20080000)
    //目標坐標:(25,43) ~ (25,43)

    public class P10000659 : RandomPortal
    {
        public P10000659()
        {
            Init(10000659, 20080000, 25, 7, 25, 7);
        }
    }
    //原始地圖:
    //目標地圖:鬥技場(20080000)
    //目標坐標:(25,7) ~ (25,7)

    public class P10000660 : RandomPortal
    {
        public P10000660()
        {
            Init(10000660, 50000000, 3, 3, 3, 3);
        }
    }
    //原始地圖:
    //目標地圖:總部的房間(50000000)
    //目標坐標:(3,3) ~ (3,3)

    public class P10000661 : RandomPortal
    {
        public P10000661()
        {
            Init(10000661, 10067000, 36, 31, 38, 33);
        }
    }
    //原始地圖:
    //目標地圖:女王謁見之間(10067000)
    //目標坐標:(36,31) ~ (38,33)

    public class P10000662 : RandomPortal
    {
        public P10000662()
        {
            Init(10000662, 30160000, 20, 20, 20, 20);
        }
    }
    //原始地圖:寶物庫(20013002)
    //目標地圖:諾頓宮殿宴會廳(30160000)
    //目標坐標:(20,20) ~ (20,20)

    public class P10000663 : RandomPortal
    {
        public P10000663()
        {
            Init(10000663, 20013002, 63, 60, 64, 60);
        }
    }
    //原始地圖:諾頓宮殿宴會廳(30160000)
    //目標地圖:寶物庫(20013002)
    //目標坐標:(63,60) ~ (64,60)

    //原始地圖:南方海角(10046000)
    //目標地圖:鬼之寢岩(10061000)
    //目標坐標:(144,2) ~ (147,4)

    public class P10000666 : RandomPortal
    {
        public P10000666()
        {
            Init(10000666, 10046000, 195, 251, 198, 253);
        }
    }
    //原始地圖:鬼之寢岩(10061000)
    //目標地圖:南方海角(10046000)
    //目標坐標:(195,251) ~ (198,253)

    public class P10000667 : RandomPortal
    {
        public P10000667()
        {
            Init(10000667, 10064000, 185, 2, 188, 4);
        }
    }
    //原始地圖:鬼之寢岩(10061000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(185,2) ~ (188,4)


    public class P10000669 : RandomPortal
    {
        public P10000669()
        {
            Init(10000669, 10064000, 26, 2, 29, 4);
        }
    }
    //原始地圖:鬼之寢岩(10061000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(26,2) ~ (29,4)


    public class P10000676 : RandomPortal
    {
        public P10000676()
        {
            Init(10000676, 10063000, 161, 156, 163, 159);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩薩烏斯路(10063000)
    //目標坐標:(161,156) ~ (163,159)

    public class P10000681 : RandomPortal
    {
        public P10000681()
        {
            Init(10000681, 10066000, 111, 68, 112, 70);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(111,68) ~ (112,70)

    public class P10000682 : RandomPortal
    {
        public P10000682()
        {
            Init(10000682, 10063100, 111, 64, 112, 66);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(111,64) ~ (112,66)

    public class P10000683 : RandomPortal
    {
        public P10000683()
        {
            Init(10000683, 10066000, 113, 138, 114, 138);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(113,138) ~ (114,138)

    public class P10000684 : RandomPortal
    {
        public P10000684()
        {
            Init(10000684, 10063100, 113, 140, 114, 142);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(113,140) ~ (114,142)

    public class P10000685 : RandomPortal
    {
        public P10000685()
        {
            Init(10000685, 10066000, 51, 68, 52, 70);
        }
    }
    //原始地圖:阿伊恩市上層(10063100
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(51,68) ~ (52,70)

    public class P10000686 : RandomPortal
    {
        public P10000686()
        {
            Init(10000686, 10063100, 51, 64, 52, 66);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(51,64) ~ (52,66)

    public class P10000687 : RandomPortal
    {
        public P10000687()
        {
            Init(10000687, 10066000, 49, 137, 50, 139);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(49,137) ~ (50,139)

    public class P10000688 : RandomPortal
    {
        public P10000688()
        {
            Init(10000688, 10063100, 49, 141, 50, 143);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(49,141) ~ (50,143)

    public class P10000691 : RandomPortal
    {
        public P10000691()
        {
            Init(10000691, 20020000, 99, 247, 102, 249);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:南部地牢B1F(20020000)
    //目標坐標:(99,247) ~ (102,249)
    

    public class P10000693 : RandomPortal
    {
        public P10000693()
        {
            Init(10000693, 20020000, 153, 247, 156, 249);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:南部地牢B1F(20020000)
    //目標坐標:(153,247) ~ (156,249)

    //目標坐標:(180,70) ~ (182,73)

    public class P10000698 : RandomPortal
    {
        public P10000698()
        {
            Init(10000698, 20023000, 127, 251, 130, 253);
        }
    }
    //原始地圖:南部地牢B1F(20020000)
    //目標地圖:馬克特碼頭(20023000)
    //目標坐標:(127,251) ~ (130,253)

    public class P10000699 : RandomPortal
    {
        public P10000699()
        {
            Init(10000699, 20020000, 126, 3, 129, 5);
        }
    }
    //原始地圖:馬克特碼頭(20023000)
    //目標地圖:南部地牢B1F(20020000)
    //目標坐標:(126,3) ~ (129,5)


    //原始地圖:愛伊斯島之地下通道(20015000)
    //目標地圖:愛伊斯島之地下通道(20015000)
    //目標坐標:(7,36) ~ (12,36)
    
    //原始地圖:南部地牢B3F(20022000)
    //目標地圖:南部地牢B2F(20021000)
    //目標坐標:(126,241) ~ (129,243)

    public class P10000707 : RandomPortal
    {
        public P10000707()
        {
            Init(10000707, 30072000, 4, 7, 4, 7);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:富翁家(30072000)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000708 : RandomPortal
    {
        public P10000708()
        {
            Init(10000708, 10063100, 130, 132, 130, 132);
        }
    }
    //原始地圖:富翁家(30072000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(130,132) ~ (130,132)

    public class P10000709 : RandomPortal
    {
        public P10000709()
        {
            Init(10000709, 30073000, 4, 8, 4, 8);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:傭兵軍團之大廳(30073000)
    //目標坐標:(4,8) ~ (4,8)

    public class P10000710 : RandomPortal
    {
        public P10000710()
        {
            Init(10000710, 10063100, 47, 155, 47, 156);
        }
    }
    //原始地圖:傭兵軍團之大廳(30073000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(47,155) ~ (47,156)

    public class P10000711 : RandomPortal
    {
        public P10000711()
        {
            Init(10000711, 30075000, 5, 10, 5, 10);
        }
    }
    //原始地圖:傭兵軍團之大廳(30073000)
    //目標地圖:傭兵軍團長官室(30075000)
    //目標坐標:(5,10) ~ (5,10)

    public class P10000712 : RandomPortal
    {
        public P10000712()
        {
            Init(10000712, 30073000, 4, 1, 4, 1);
        }
    }
    //原始地圖:傭兵軍團長官室(30075000)
    //目標地圖:傭兵軍團之大廳(30073000)
    //目標坐標:(4,1) ~ (4,1)

    public class P10000713 : RandomPortal
    {
        public P10000713()
        {
            Init(10000713, 30074000, 4, 8, 4, 8);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:空軍之大廳(30074000)
    //目標坐標:(4,8) ~ (4,8)

    public class P10000714 : RandomPortal
    {
        public P10000714()
        {
            Init(10000714, 10063100, 43, 71, 43, 72);
        }
    }
    //原始地圖:空軍之大廳(30074000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(43,71) ~ (43,72)

    public class P10000715 : RandomPortal
    {
        public P10000715()
        {
            Init(10000715, 30076000, 5, 10, 5, 10);
        }
    }
    //原始地圖:空軍之大廳(30074000)
    //目標地圖:空軍長官室(30076000)
    //目標坐標:(5,10) ~ (5,10)

    public class P10000716 : RandomPortal
    {
        public P10000716()
        {
            Init(10000716, 30074000, 4, 1, 4, 1);
        }
    }
    //原始地圖:空軍長官室(30076000)
    //目標地圖:空軍之大廳(30074000)
    //目標坐標:(4,1) ~ (4,1)

    public class P10000717 : RandomPortal
    {
        public P10000717()
        {
            Init(10000717, 30078000, 9, 17, 11, 18);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:議會大廳(30078000)
    //目標坐標:(9,17) ~ (11,18)

    public class P10000718 : RandomPortal
    {
        public P10000718()
        {
            Init(10000718, 10063100, 50, 103, 50, 104);
        }
    }
    //原始地圖:議會大廳(30078000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(50,103) ~ (50,104)

    public class P10000719 : RandomPortal
    {
        public P10000719()
        {
            Init(10000719, 30079000, 9, 19, 10, 19);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:合同舍大廳(30079000)
    //目標坐標:(9,19) ~ (10,19)

    public class P10000720 : RandomPortal
    {
        public P10000720()
        {
            Init(10000720, 10063100, 125, 103, 125, 104);
        }
    }
    //原始地圖:合同舍大廳(30079000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(125,103) ~ (125,104)

    public class P10000721 : RandomPortal
    {
        public P10000721()
        {
            Init(10000721, 30020003, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市裁縫店(30020003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000722 : RandomPortal
    {
        public P10000722()
        {
            Init(10000722, 10063100, 137, 169, 137, 169);
        }
    }
    //原始地圖:阿伊恩市裁縫店(30020003)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(137,169) ~ (137,169)

    public class P10000723 : RandomPortal
    {
        public P10000723()
        {
            Init(10000723, 30021002, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市寶石商店(30021002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000724 : RandomPortal
    {
        public P10000724()
        {
            Init(10000724, 10063100, 137, 177, 137, 177);
        }
    }
    //原始地圖:阿伊恩市寶石商店(30021002)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(137,177) ~ (137,177)

    public class P10000725 : RandomPortal
    {
        public P10000725()
        {
            Init(10000725, 30060003, 4, 7, 4, 7);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市商店(30060003)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000726 : RandomPortal
    {
        public P10000726()
        {
            Init(10000726, 10063100, 125, 172, 125, 172);
        }
    }
    //原始地圖:阿伊恩市商店(30060003)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(125,172) ~ (125,172)

    public class P10000727 : RandomPortal
    {
        public P10000727()
        {
            Init(10000727, 30011003, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市鑑定所(30011003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000728 : RandomPortal
    {
        public P10000728()
        {
            Init(10000728, 10063100, 121, 170, 121, 170);
        }
    }
    //原始地圖:阿伊恩市鑑定所(30011003)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(121,170) ~ (121,170)

    public class P10000729 : RandomPortal
    {
        public P10000729()
        {
            Init(10000729, 30010003, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市咖啡館(30010003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000730 : RandomPortal
    {
        public P10000730()
        {
            Init(10000730, 10063100, 119, 167, 119, 167);
        }
    }
    //原始地圖:阿伊恩市咖啡館(30010003)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(119,167) ~ (119,167)

    public class P10000731 : RandomPortal
    {
        public P10000731()
        {
            Init(10000731, 30071000, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市之民家(30071000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000732 : RandomPortal
    {
        public P10000732()
        {
            Init(10000732, 10066000, 85, 77, 85, 77);
        }
    }
    //原始地圖:阿伊恩市之民家(30071000)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(85,77) ~ (85,77)

    public class P10000733 : RandomPortal
    {
        public P10000733()
        {
            Init(10000733, 30081000, 10, 20, 11, 21);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:大工場大廳(30081000)
    //目標坐標:(10,20) ~ (11,21)

    public class P10000734 : RandomPortal
    {
        public P10000734()
        {
            Init(10000734, 30081000, 10, 20, 11, 21);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:大工場大廳(30081000)
    //目標坐標:(10,20) ~ (11,21)

    public class P10000735 : RandomPortal
    {
        public P10000735()
        {
            Init(10000735, 10066000, 154, 145, 157, 147);
        }
    }
    //原始地圖:大工場大廳(30081000)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(154,145) ~ (157,147)

    public class P10000736 : RandomPortal
    {
        public P10000736()
        {
            Init(10000736, 30082000, 10, 20, 11, 21);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:鋼鐵工廠大廳(30082000)
    //目標坐標:(10,20) ~ (11,21)

    public class P10000737 : RandomPortal
    {
        public P10000737()
        {
            Init(10000737, 30082000, 10, 20, 11, 21);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:鋼鐵工廠大廳(30082000)
    //目標坐標:(10,20) ~ (11,21)

    public class P10000738 : RandomPortal
    {
        public P10000738()
        {
            Init(10000738, 10066000, 154, 60, 157, 62);
        }
    }
    //原始地圖:鋼鐵工廠大廳(30082000)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(154,60) ~ (157,62)

    public class P10000739 : RandomPortal
    {
        public P10000739()
        {
            Init(10000739, 30012002, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市武器商店(30012002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000740 : RandomPortal
    {
        public P10000740()
        {
            Init(10000740, 10066000, 121, 52, 122, 52);
        }
    }
    //原始地圖:阿伊恩市武器商店(30012002)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(121,52) ~ (122,52)

    public class P10000741 : RandomPortal
    {
        public P10000741()
        {
            Init(10000741, 30013001, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市武器製造所(30013001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000742 : RandomPortal
    {
        public P10000742()
        {
            Init(10000742, 10066000, 135, 63, 136, 63);
        }
    }
    //原始地圖:阿伊恩市武器製造所(30013001)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(135,63) ~ (136,63)

    public class P10000743 : RandomPortal
    {
        public P10000743()
        {
            Init(10000743, 30014001, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市古董商店(30014001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000744 : RandomPortal
    {
        public P10000744()
        {
            Init(10000744, 10066000, 139, 63, 140, 63);
        }
    }
    //原始地圖:阿伊恩市古董商店(30014001)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(139,63) ~ (140,63)

    public class P10000745 : RandomPortal
    {
        public P10000745()
        {
            Init(10000745, 30060004, 4, 7, 4, 7);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市商店(30060004)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000746 : RandomPortal
    {
        public P10000746()
        {
            Init(10000746, 10066000, 121, 155, 122, 155);
        }
    }
    //原始地圖:阿伊恩市商店(30060004)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(121,155) ~ (122,155)

    public class P10000747 : RandomPortal
    {
        public P10000747()
        {
            Init(10000747, 30010004, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市咖啡館(30010004)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000748 : RandomPortal
    {
        public P10000748()
        {
            Init(10000748, 10066000, 135, 144, 136, 144);
        }
    }
    //原始地圖:阿伊恩市咖啡館(30010004)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(135,144) ~ (136,144)

    public class P10000749 : RandomPortal
    {
        public P10000749()
        {
            Init(10000749, 30011004, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市鑑定所(30011004)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000750 : RandomPortal
    {
        public P10000750()
        {
            Init(10000750, 10066000, 139, 144, 140, 144);
        }
    }
    //原始地圖:阿伊恩市鑑定所(30011004)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(139,144) ~ (140,144)

    public class P10000752 : RandomPortal
    {
        public P10000752()
        {
            Init(10000752, 20080007, 21, 21, 29, 29);
        }
    }
    //原始地圖:
    //目標地圖:東軍團大廳(20080007)
    //目標坐標:(21,21) ~ (29,29)

    public class P10000753 : RandomPortal
    {
        public P10000753()
        {
            Init(10000753, 20080008, 21, 21, 29, 29);
        }
    }
    //原始地圖:
    //目標地圖:西軍團大廳(20080008)
    //目標坐標:(21,21) ~ (29,29)

    public class P10000754 : RandomPortal
    {
        public P10000754()
        {
            Init(10000754, 20080009, 21, 21, 29, 29);
        }
    }
    //原始地圖:
    //目標地圖:南軍團大廳(20080009)
    //目標坐標:(21,21) ~ (29,29)

    public class P10000755 : RandomPortal
    {
        public P10000755()
        {
            Init(10000755, 20080010, 21, 21, 29, 29);
        }
    }
    //原始地圖:
    //目標地圖:北軍團大廳(20080010)
    //目標坐標:(21,21) ~ (29,29)

    public class P10000756 : RandomPortal
    {
        public P10000756()
        {
            Init(10000756, 20080011, 21, 21, 29, 29);
        }
    }
    //原始地圖:
    //目標地圖:鬥技場2(20080011)
    //目標坐標:(21,21) ~ (29,29)

    public class P10000757 : RandomPortal
    {
        public P10000757()
        {
            Init(10000757, 10023001, 217, 126, 218, 129);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:上城練習場(10023001)
    //目標坐標:(217,126) ~ (218,129)

    public class P10000758 : RandomPortal
    {
        public P10000758()
        {
            Init(10000758, 10023001, 37, 126, 38, 129);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:上城練習場(10023001)
    //目標坐標:(37,126) ~ (38,129)

    public class P10000759 : RandomPortal
    {
        public P10000759()
        {
            Init(10000759, 10023001, 126, 218, 129, 219);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:上城練習場(10023001)
    //目標坐標:(126,218) ~ (129,219)

    public class P10000760 : RandomPortal
    {
        public P10000760()
        {
            Init(10000760, 10023001, 126, 37, 129, 38);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:上城練習場(10023001)
    //目標坐標:(126,37) ~ (129,38)

    public class P10000765 : RandomPortal
    {
        public P10000765()
        {
            Init(10000765, 10020000, 182, 48, 184, 50);
        }
    }
    //原始地圖:蜂之巢穴(20004002)
    //目標地圖:殺人蜂山路(10020000)
    //目標坐標:(182,48) ~ (184,50)

    public class P10000766 : RandomPortal
    {
        public P10000766()
        {
            Init(10000766, 10020000, 182, 48, 185, 50);
        }
    }
    //原始地圖:蜂之巢穴(20004002)
    //目標地圖:殺人蜂山路(10020000)
    //目標坐標:(182,48) ~ (185,50)

    public class P10000767 : RandomPortal
    {
        public P10000767()
        {
            Init(10000767, 20004002, 105, 101, 107, 103);
        }
    }
    //原始地圖:殺人蜂山路(10020000)
    //目標地圖:蜂之巢穴(20004002)
    //目標坐標:(105,101) ~ (107,103)



    public class P10000770 : RandomPortal
    {
        public P10000770()
        {
            Init(10000770, 10066000, 175, 102, 177, 105);
        }
    }
    //原始地圖:動力制御室(30077000)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(175,102) ~ (177,105)

    public class P10000771 : RandomPortal
    {
        public P10000771()
        {
            Init(10000771, 30080000, 3, 6, 3, 6);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:避難所(30080000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000772 : RandomPortal
    {
        public P10000772()
        {
            Init(10000772, 10064000, 51, 111, 51, 111);
        }
    }
    //原始地圖:避難所(30080000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(51,111) ~ (51,111)

    public class P10000773 : RandomPortal
    {
        public P10000773()
        {
            Init(10000773, 30080001, 3, 6, 3, 6);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:避難所(30080001)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000774 : RandomPortal
    {
        public P10000774()
        {
            Init(10000774, 10064000, 211, 127, 211, 127);
        }
    }
    //原始地圖:避難所(30080001)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(211,127) ~ (211,127)

    public class P10000775 : RandomPortal
    {
        public P10000775()
        {
            Init(10000775, 30080002, 3, 6, 3, 6);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:避難所(30080002)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000776 : RandomPortal
    {
        public P10000776()
        {
            Init(10000776, 10064000, 102, 209, 102, 209);
        }
    }
    //原始地圖:避難所(30080002)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(102,209) ~ (102,209)

    public class P10000777 : RandomPortal
    {
        public P10000777()
        {
            Init(10000777, 60064000, 161, 110, 163, 116);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:鐵火山(60064000)
    //目標坐標:(161,110) ~ (163,116)

    public class P10000778 : RandomPortal
    {
        public P10000778()
        {
            Init(10000778, 10064000, 161, 110, 163, 116);
        }
    }
    //原始地圖:鐵火山(60064000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(161,110) ~ (163,116)

    public class P10000780 : RandomPortal
    {
        public P10000780()
        {
            Init(10000780, 20022000, 104, 30, 104, 30);
        }
    }
    //原始地圖:
    //目標地圖:南部地牢B3F(20022000)
    //目標坐標:(104,30) ~ (104,30)

    public class P10000779 : RandomPortal
    {
        public P10000779()
        {
            Init(10000779, 20022000, 121, 49, 135, 59);
        }
    }
    //原始地圖:南部地牢B3F(20022000)
    //目標地圖:南部地牢B3F(20022000)
    //目標坐標:(121,49) ~ (135,59)

    public class P10000781 : RandomPortal
    {
        public P10000781()
        {
            Init(10000781, 30113001, 12, 14, 14, 16);
        }
    }
    //原始地圖:行會宮殿大樓中庭(30110000)、行會宮殿2樓(30111000)、行會宮殿4樓(30113000)、行會宮殿5樓(30114000)
    //目標地圖:行會宮殿4樓(30113001)
    //目標坐標:(12,14) ~ (14,16)

    public class P10000782 : RandomPortal
    {
        public P10000782()
        {
            Init(10000782, 30020004, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:民家(30020004)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000783 : RandomPortal
    {
        public P10000783()
        {
            Init(10000783, 30010005, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:諾頓咖啡館(30010005)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000784 : RandomPortal
    {
        public P10000784()
        {
            Init(10000784, 30077001, 8, 12, 8, 12);
        }
    }
    //原始地圖:
    //目標地圖:動力制御室(30077001)
    //目標坐標:(8,12) ~ (8,12)

    public class P10000785 : RandomPortal
    {
        public P10000785()
        {
            Init(10000785, 30170001, 3, 6, 3, 6);
        }
    }
    //原始地圖:
    //目標地圖:伊戈路(30170001)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000786 : RandomPortal
    {
        public P10000786()
        {
            Init(10000786, 30140003, 11, 15, 12, 16);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞傳送室(30140003)
    //目標坐標:(11,15) ~ (12,16)

    public class P10000787 : RandomPortal
    {
        public P10000787()
        {
            Init(10000787, 30120000, 11, 8, 12, 9);
        }
    }
    //原始地圖:塔妮亞傳送室(30140003)
    //目標地圖:白之聖堂(30120000)
    //目標坐標:(11,8) ~ (12,9)

    public class P10000788 : RandomPortal
    {
        public P10000788()
        {
            Init(10000788, 30113001, 25, 13, 25, 13);
        }
    }
    //原始地圖:鍊金術師行會(30048000)
    //目標地圖:行會宮殿4樓(30113001)
    //目標坐標:(25,13) ~ (25,13)

    public class P10000789 : RandomPortal
    {
        public P10000789()
        {
            Init(10000789, 30113001, 1, 13, 1, 13);
        }
    }
    //原始地圖:木偶使行會(30049000)
    //目標地圖:行會宮殿4樓(30113001)
    //目標坐標:(1,13) ~ (1,13)

    public class P10000790 : RandomPortal
    {
        public P10000790()
        {
            Init(10000790, 30113001, 13, 25, 13, 25);
        }
    }
    //原始地圖:冒險家行會(30050000)
    //目標地圖:行會宮殿4樓(30113001)
    //目標坐標:(13,25) ~ (13,25)

    public class P10000791 : RandomPortal
    {
        public P10000791()
        {
            Init(10000791, 30113001, 13, 1, 13, 1);
        }
    }
    //原始地圖:商人行會(30051000)
    //目標地圖:行會宮殿4樓(30113001)
    //目標坐標:(13,1) ~ (13,1)

    public class P10000792 : RandomPortal
    {
        public P10000792()
        {
            Init(10000792, 10023000, 123, 143, 131, 159);
        }
    }
    //原始地圖:奧克魯尼亞大聖堂(30122002)
    //目標地圖:上城(10023000)
    //目標坐標:(123,143) ~ (131,159)

    public class P10000793 : RandomPortal
    {
        public P10000793()
        {
            Init(10000793, 10065000, 46, 114, 57, 123);
        }
    }
    //原始地圖:
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(46,114) ~ (57,123)

    public class P10000794 : RandomPortal
    {
        public P10000794()
        {
            Init(10000794, 10062000, 195, 125, 196, 126);
        }
    }
    //原始地圖:
    //目標地圖:唐卡島(10062000)
    //目標坐標:(195,125) ~ (196,126)

    public class P10000795 : RandomPortal
    {
        public P10000795()
        {
            Init(10000795, 10069000, 125, 125, 125, 125);
        }
    }
    //原始地圖:
    //目標地圖:不死皇城(10069000)
    //目標坐標:(125,125) ~ (125,125)

    public class P10000796 : RandomPortal
    {
        public P10000796()
        {
            Init(10000796, 30122000, 10, 21, 13, 23);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:情人教堂(30122000)
    //目標坐標:(10,21) ~ (13,23)

    public class P10000797 : RandomPortal
    {
        public P10000797()
        {
            Init(10000797, 10024000, 99, 160, 101, 162);
        }
    }
    //原始地圖:情人教堂(30122000)
    //目標地圖:下城(10024000)
    //目標坐標:(99,160) ~ (101,162)

    public class P10000798 : RandomPortal
    {
        public P10000798()
        {
            Init(10000798, 30122001, 10, 21, 13, 23);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:情人教堂(30122001)
    //目標坐標:(10,21) ~ (13,23)

    public class P10000799 : RandomPortal
    {
        public P10000799()
        {
            Init(10000799, 10023000, 126, 149, 128, 151);
        }
    }
    //原始地圖:情人教堂(30122001)
    //目標地圖:上城(10023000)
    //目標坐標:(126,149) ~ (128,151)


    public class P10000809 : RandomPortal
    {
        public P10000809()
        {
            Init(10000809, 30131001, 6, 1, 6, 1);
        }
    }
    //原始地圖:謎之團要塞(10054000)、謎之團要塞北部(10054100)
    //目標地圖:謎之團本部(30131001)
    //目標坐標:(6,1) ~ (6,1)

    //原始地圖:東方海角(10018100)
    //目標地圖:牛牛草原(10056000)
    //目標坐標:(3,80) ~ (5,83)

    public class P10000811 : RandomPortal
    {
        public P10000811()
        {
            Init(10000811, 10018100, 251, 80, 253, 83);
        }
    }
    //原始地圖:牛牛草原(10056000)
    //目標地圖:東方海角(10018100)
    //目標坐標:(251,80) ~ (253,83)
    
    public class P10000813 : RandomPortal
    {
        public P10000813()
        {
            Init(10000813, 10056000, 251, 140, 253, 143);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:牛牛草原(10056000)
    //目標坐標:(251,140) ~ (253,143)

    public class P10000814 : RandomPortal
    {
        public P10000814()
        {
            Init(10000814, 10054001, 2, 202, 4, 205);
        }
    }
    //原始地圖:牛牛草原(10056000)
    //目標地圖:謎之團要塞(10054001)
    //目標坐標:(2,202) ~ (4,205)

    public class P10000815 : RandomPortal
    {
        public P10000815()
        {
            Init(10000815, 10056000, 207, 2, 210, 4);
        }
    }
    //原始地圖:謎之團要塞(10054001)
    //目標地圖:牛牛草原(10056000)
    //目標坐標:(207,2) ~ (210,4)


    public class P10000810 : Event
    {
        public P10000810()
        {
            this.EventID = 10000810;
        }

        public override void OnEvent(ActorPC pc)
        {
                Warp(pc, 10056000, 4, 81);
        }
    }
    //原始地圖:謎之團本部(30131001)
    //目標地圖:謎之團要塞北部(10054100)
    //目標坐標:(224,86) ~ (225,87)

    public class P10000818 : RandomPortal
    {
        public P10000818()
        {
            Init(10000818, 10054100, 123, 77, 123, 79);
        }
    }
    //原始地圖:謎之團本部(30131001)
    //目標地圖:謎之團要塞北部(10054100)
    //目標坐標:(123,77) ~ (123,79)

    public class P10000819 : RandomPortal
    {
        public P10000819()
        {
            Init(10000819, 10054000, 72, 140, 72, 140);
        }
    }
    //原始地圖:謎之團本部(30131001)
    //目標地圖:謎之團要塞(10054000)
    //目標坐標:(72,140) ~ (72,140)

    public class P10000820 : RandomPortal
    {
        public P10000820()
        {
            Init(10000820, 10054001, 166, 251, 169, 253);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:謎之團要塞(10054001)
    //目標坐標:(166,251) ~ (169,253)

    public class P10000821 : RandomPortal
    {
        public P10000821()
        {
            Init(10000821, 10068000, 134, 2, 137, 4);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:榖倉地帶(10068000)
    //目標坐標:(134,2) ~ (137,4)

    public class P10000822 : RandomPortal
    {
        public P10000822()
        {
            Init(10000822, 10057000, 134, 251, 137, 253);
        }
    }
    //原始地圖:榖倉地帶(10068000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(134,251) ~ (137,253)

    public class P10000823 : RandomPortal
    {
        public P10000823()
        {
            Init(10000823, 20090000, 111, 251, 114, 253);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:東方地牢(20090000)
    //目標坐標:(111,251) ~ (114,253)

    public class P10000824 : RandomPortal
    {
        public P10000824()
        {
            Init(10000824, 10057000, 251, 114, 253, 117);
        }
    }
    //原始地圖:東方地牢(20090000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(251,114) ~ (253,117)

    public class P10000825 : RandomPortal
    {
        public P10000825()
        {
            Init(10000825, 20091000, 48, 251, 51, 253);
        }
    }
    //原始地圖:東方地牢(20090000)
    //目標地圖:毒濕地(20091000)
    //目標坐標:(48,251) ~ (51,253)

    public class P10000826 : RandomPortal
    {
        public P10000826()
        {
            Init(10000826, 20090000, 48, 2, 51, 4);
        }
    }
    //原始地圖:毒濕地(20091000)
    //目標地圖:東方地牢(20090000)
    //目標坐標:(48,2) ~ (51,4)

    public class P10000827 : RandomPortal
    {
        public P10000827()
        {
            Init(10000827, 20091000, 92, 251, 95, 253);
        }
    }
    //原始地圖:東方地牢(20090000)
    //目標地圖:毒濕地(20091000)
    //目標坐標:(92,251) ~ (95,253)

    public class P10000828 : RandomPortal
    {
        public P10000828()
        {
            Init(10000828, 20090000, 93, 2, 96, 4);
        }
    }
    //原始地圖:毒濕地(20091000)
    //目標地圖:東方地牢(20090000)
    //目標坐標:(93,2) ~ (96,4)

    public class P10000829 : RandomPortal
    {
        public P10000829()
        {
            Init(10000829, 20092000, 122, 251, 125, 253);
        }
    }
    //原始地圖:東方地牢(20090000)
    //目標地圖:原始森林(20092000)
    //目標坐標:(122,251) ~ (125,253)

    public class P10000830 : RandomPortal
    {
        public P10000830()
        {
            Init(10000830, 20090000, 228, 2, 231, 4);
        }
    }
    //原始地圖:原始森林(20092000)
    //目標地圖:東方地牢(20090000)
    //目標坐標:(228,2) ~ (231,4)

    public class P10000831 : RandomPortal
    {
        public P10000831()
        {
            Init(10000831, 20091000, 186, 225, 190, 226);
        }
    }
    //原始地圖:原始森林(20092000)
    //目標地圖:毒濕地(20091000)
    //目標坐標:(186,225) ~ (190,226)
    
    //原始地圖:毒濕地(20091000)
    //目標地圖:東方地牢(20090000)
    //目標坐標:(34,66) ~ (37,69)

    public class P10000833 : RandomPortal
    {
        public P10000833()
        {
            Init(10000833, 20092000, 168, 32, 171, 34);
        }
    }
    //原始地圖:毒濕地(20091000)
    //目標地圖:原始森林(20092000)
    //目標坐標:(168,32) ~ (171,34)

    public class P10000834 : RandomPortal
    {
        public P10000834()
        {
            Init(10000834, 20092000, 108, 77, 110, 79);
        }
    }
    //原始地圖:原始森林(20092000)
    //目標地圖:原始森林(20092000)
    //目標坐標:(108,77) ~ (110,79)

    public class P10000835 : RandomPortal
    {
        public P10000835()
        {
            Init(10000835, 10069000, 143, 209, 146, 211);
        }
    }
    //原始地圖:榖倉地帶(10068000)
    //目標地圖:不死皇城(10069000)
    //目標坐標:(143,209) ~ (146,211)

    public class P10000836 : RandomPortal
    {
        public P10000836()
        {
            Init(10000836, 10069000, 143, 209, 146, 211);
        }
    }
    //原始地圖:榖倉地帶(10068000)
    //目標地圖:不死皇城(10069000)
    //目標坐標:(143,209) ~ (146,211)

    public class P10000837 : RandomPortal
    {
        public P10000837()
        {
            Init(10000837, 10068000, 194, 214, 205, 216);
        }
    }
    //原始地圖:不死皇城(10069000)
    //目標地圖:榖倉地帶(10068000)
    //目標坐標:(194,214) ~ (205,216)
    

    public class P10000941 : RandomPortal
    {
        public P10000941()
        {
            Init(10000941, 10057000, 171, 83, 172, 84);
        }
    }
    //原始地圖:帕斯特管理局(30130000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(171,83) ~ (172,84)

    public class P10000942 : RandomPortal
    {
        public P10000942()
        {
            Init(10000942, 30131000, 5, 9, 7, 10);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:綠色防備軍本部(30131000)
    //目標坐標:(5,9) ~ (7,10)

    public class P10000943 : RandomPortal
    {
        public P10000943()
        {
            Init(10000943, 10057000, 26, 101, 29, 103);
        }
    }
    //原始地圖:綠色防備軍本部(30131000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(26,101) ~ (29,103)

    public class P10000944 : RandomPortal
    {
        public P10000944()
        {
            Init(10000944, 30134000, 4, 15, 5, 16);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:馬廄(30134000)
    //目標坐標:(4,15) ~ (5,16)

    public class P10000945 : RandomPortal
    {
        public P10000945()
        {
            Init(10000945, 10057000, 29, 67, 30, 69);
        }
    }
    //原始地圖:馬廄(30134000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(29,67) ~ (30,69)

    public class P10000946 : RandomPortal
    {
        public P10000946()
        {
            Init(10000946, 30134001, 4, 15, 5, 16);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:馬廄(30134001)
    //目標坐標:(4,15) ~ (5,16)

    public class P10000947 : RandomPortal
    {
        public P10000947()
        {
            Init(10000947, 10057000, 200, 57, 202, 58);
        }
    }
    //原始地圖:馬廄(30134001)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(200,57) ~ (202,58)

    public class P10000948 : RandomPortal
    {
        public P10000948()
        {
            Init(10000948, 30132000, 6, 11, 6, 11);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:農夫行會總部(30132000)
    //目標坐標:(6,11) ~ (6,11)

    public class P10000949 : RandomPortal
    {
        public P10000949()
        {
            Init(10000949, 10057000, 172, 100, 173, 101);
        }
    }
    //原始地圖:農夫行會總部(30132000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(172,100) ~ (173,101)

    public class P10000950 : RandomPortal
    {
        public P10000950()
        {
            Init(10000950, 30133000, 5, 10, 5, 10);
        }
    }
    //原始地圖:農夫行會總部(30132000)
    //目標地圖:農夫行會會長的房間(30133000)
    //目標坐標:(5,10) ~ (5,10)

    public class P10000951 : RandomPortal
    {
        public P10000951()
        {
            Init(10000951, 30132000, 6, 2, 6, 2);
        }
    }
    //原始地圖:農夫行會會長的房間(30133000)
    //目標地圖:農夫行會總部(30132000)
    //目標坐標:(6,2) ~ (6,2)

    public class P10000952 : RandomPortal
    {
        public P10000952()
        {
            Init(10000952, 30091000, 6, 15, 6, 15);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:學校(30091000)
    //目標坐標:(6,15) ~ (6,15)

    public class P10000953 : RandomPortal
    {
        public P10000953()
        {
            Init(10000953, 10057000, 147, 117, 148, 118);
        }
    }
    //原始地圖:學校(30091000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(147,117) ~ (148,118)

    public class P10000954 : RandomPortal
    {
        public P10000954()
        {
            Init(10000954, 30090000, 4, 7, 4, 7);
        }
    }
    //原始地圖:牛牛草原(10056000)
    //目標地圖:寵物小屋(30090000)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000955 : RandomPortal
    {
        public P10000955()
        {
            Init(10000955, 10056000, 180, 56, 180, 56);
        }
    }
    //原始地圖:寵物小屋(30090000)
    //目標地圖:牛牛草原(10056000)
    //目標坐標:(180,56) ~ (180,56)

    public class P10000956 : RandomPortal
    {
        public P10000956()
        {
            Init(10000956, 30001002, 2, 4, 2, 4);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特魔法商店(30001002)
    //目標坐標:(2,4) ~ (2,4)

    public class P10000957 : RandomPortal
    {
        public P10000957()
        {
            Init(10000957, 10057000, 128, 106, 128, 106);
        }
    }
    //原始地圖:帕斯特魔法商店(30001002)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(128,106) ~ (128,106)

    public class P10000958 : RandomPortal
    {
        public P10000958()
        {
            Init(10000958, 30002001, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特的小屋(30002001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000959 : RandomPortal
    {
        public P10000959()
        {
            Init(10000959, 10057000, 94, 114, 94, 114);
        }
    }
    //原始地圖:帕斯特的小屋(30002001)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(94,114) ~ (94,114)

    public class P10000960 : RandomPortal
    {
        public P10000960()
        {
            Init(10000960, 30010006, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特咖啡館(30010006)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000961 : RandomPortal
    {
        public P10000961()
        {
            Init(10000961, 10057000, 142, 108, 142, 108);
        }
    }
    //原始地圖:帕斯特咖啡館(30010006)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(142,108) ~ (142,108)


    public class P10000964 : RandomPortal
    {
        public P10000964()
        {
            Init(10000964, 30011005, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特鑑定所(30011005)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000965 : RandomPortal
    {
        public P10000965()
        {
            Init(10000965, 10057000, 128, 100, 128, 100);
        }
    }
    //原始地圖:帕斯特鑑定所(30011005)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(128,100) ~ (128,100)

    public class P10000966 : RandomPortal
    {
        public P10000966()
        {
            Init(10000966, 30012003, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特武器商店(30012003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000967 : RandomPortal
    {
        public P10000967()
        {
            Init(10000967, 10057000, 119, 100, 119, 100);
        }
    }
    //原始地圖:帕斯特武器商店(30012003)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(119,100) ~ (119,100)


    public class P10000971 : RandomPortal
    {
        public P10000971()
        {
            Init(10000971, 10057000, 119, 107, 119, 107);
        }
    }
    //原始地圖:帕斯特裁縫店(30020005)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(119,107) ~ (119,107)

    public class P10000972 : RandomPortal
    {
        public P10000972()
        {
            Init(10000972, 30021003, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特寶石商店(30021003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000973 : RandomPortal
    {
        public P10000973()
        {
            Init(10000973, 10057000, 141, 86, 141, 86);
        }
    }
    //原始地圖:帕斯特寶石商店(30021003)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(141,86) ~ (141,86)

    public class P10000974 : RandomPortal
    {
        public P10000974()
        {
            Init(10000974, 30060005, 4, 7, 4, 7);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特商店(30060005)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000975 : RandomPortal
    {
        public P10000975()
        {
            Init(10000975, 10057000, 141, 96, 141, 96);
        }
    }
    //原始地圖:帕斯特商店(30060005)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(141,96) ~ (141,96)

    public class P10000976 : RandomPortal
    {
        public P10000976()
        {
            Init(10000976, 30060006, 4, 7, 4, 7);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特商店(30060006)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000977 : RandomPortal
    {
        public P10000977()
        {
            Init(10000977, 10057000, 123, 120, 123, 120);
        }
    }
    //原始地圖:帕斯特商店(30060006)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(123,120) ~ (123,120)

    public class P10000978 : RandomPortal
    {
        public P10000978()
        {
            Init(10000978, 10054000, 153, 159, 154, 160);
        }
    }
    //原始地圖:謎之團要塞(10054001)
    //目標地圖:謎之團要塞(10054000)
    //目標坐標:(153,159) ~ (154,160)
    

    public class P10000980 : RandomPortal
    {
        public P10000980()
        {
            Init(10000980, 10056000, 39, 90, 41, 91);
        }
    }
    //原始地圖:普羅莎娜的監獄(30141003)
    //目標地圖:牛牛草原(10056000)
    //目標坐標:(39,90) ~ (41,91)

    public class P10000981 : RandomPortal
    {
        public P10000981()
        {
            Init(10000981, 30141003, 11, 14, 12, 15);
        }
    }
    //原始地圖:牛牛草原(10056000)
    //目標地圖:普羅莎娜的監獄(30141003)
    //目標坐標:(11,14) ~ (12,15)

    public class P10000982 : RandomPortal
    {
        public P10000982()
        {
            Init(10000982, 20092001, 168, 32, 171, 34);
        }
    }
    //原始地圖:毒濕地(20091001)
    //目標地圖:冥王之森(20092001)
    //目標坐標:(168,32) ~ (171,34)

    public class P10000983 : RandomPortal
    {
        public P10000983()
        {
            Init(10000983, 50001000, 7, 26, 9, 27);
        }
    }
    //原始地圖:皇宮1F(20108000)
    //目標地圖:阿卡茲的房間(50001000)
    //目標坐標:(7,26) ~ (9,27)

    public class P10000985 : RandomPortal
    {
        public P10000985()
        {
            Init(10000985, 10023000, 126, 149, 128, 151);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(126,149) ~ (128,151)

    public class P10000986 : RandomPortal
    {
        public P10000986()
        {
            Init(10000986, 10900000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 1(10900000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000987 : RandomPortal
    {
        public P10000987()
        {
            Init(10000987, 10901000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 2(10901000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000988 : RandomPortal
    {
        public P10000988()
        {
            Init(10000988, 10902000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 3(10902000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000989 : RandomPortal
    {
        public P10000989()
        {
            Init(10000989, 10903000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 4(10903000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000990 : RandomPortal
    {
        public P10000990()
        {
            Init(10000990, 10904000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 5(10904000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000991 : RandomPortal
    {
        public P10000991()
        {
            Init(10000991, 10905000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 6(10905000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000992 : RandomPortal
    {
        public P10000992()
        {
            Init(10000992, 20900000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 7(20900000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000993 : RandomPortal
    {
        public P10000993()
        {
            Init(10000993, 20901000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 8(20901000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000994 : RandomPortal
    {
        public P10000994()
        {
            Init(10000994, 20902000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 9(20902000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000995 : RandomPortal
    {
        public P10000995()
        {
            Init(10000995, 20903000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 10(20903000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000996 : RandomPortal
    {
        public P10000996()
        {
            Init(10000996, 20904000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 11(20904000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000997 : RandomPortal
    {
        public P10000997()
        {
            Init(10000997, 20905000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 12(20905000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000998 : RandomPortal
    {
        public P10000998()
        {
            Init(10000998, 20906000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:測試地圖(20906000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000999 : RandomPortal
    {
        public P10000999()
        {
            Init(10000999, 20907000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:測試地圖(20907000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001000 : RandomPortal
    {
        public P10001000()
        {
            Init(10001000, 10068000, 194, 214, 205, 216);
        }
    }
    //原始地圖:
    //目標地圖:榖倉地帶(10068000)
    //目標坐標:(194,214) ~ (205,216)

    public class P10001001 : RandomPortal
    {
        public P10001001()
        {
            Init(10001001, 10032001, 219, 61, 221, 63);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:樂天娜湖泊練習場(10032001)
    //目標坐標:(219,61) ~ (221,63)

    public class P10001002 : RandomPortal
    {
        public P10001002()
        {
            Init(10001002, 10032001, 2, 200, 4, 202);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:樂天娜湖泊練習場(10032001)
    //目標坐標:(2,200) ~ (4,202)

    public class P10001003 : RandomPortal
    {
        public P10001003()
        {
            Init(10001003, 10032001, 131, 209, 133, 211);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:樂天娜湖泊練習場(10032001)
    //目標坐標:(131,209) ~ (133,211)

    public class P10001004 : RandomPortal
    {
        public P10001004()
        {
            Init(10001004, 10032001, 45, 80, 47, 82);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:樂天娜湖泊練習場(10032001)
    //目標坐標:(45,80) ~ (47,82)

    public class P10001005 : RandomPortal
    {
        public P10001005()
        {
            Init(10001005, 10034001, 208, 235, 210, 237);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:奧克魯尼亞東海岸練習場(10034001)
    //目標坐標:(208,235) ~ (210,237)

    public class P10001006 : RandomPortal
    {
        public P10001006()
        {
            Init(10001006, 10034001, 84, 87, 86, 89);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:奧克魯尼亞東海岸練習場(10034001)
    //目標坐標:(84,87) ~ (86,89)

    public class P10001007 : RandomPortal
    {
        public P10001007()
        {
            Init(10001007, 10034001, 49, 192, 51, 194);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:奧克魯尼亞東海岸練習場(10034001)
    //目標坐標:(49,192) ~ (51,194)

    public class P10001008 : RandomPortal
    {
        public P10001008()
        {
            Init(10001008, 10034001, 214, 16, 216, 18);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:奧克魯尼亞東海岸練習場(10034001)
    //目標坐標:(214,16) ~ (216,18)

    public class P10001009 : RandomPortal
    {
        public P10001009()
        {
            Init(10001009, 10042001, 233, 33, 235, 35);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:步伐沙漠練習場(10042001)
    //目標坐標:(233,33) ~ (235,35)

    public class P10001010 : RandomPortal
    {
        public P10001010()
        {
            Init(10001010, 10042001, 72, 141, 74, 143);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:步伐沙漠練習場(10042001)
    //目標坐標:(72,141) ~ (74,143)

    public class P10001011 : RandomPortal
    {
        public P10001011()
        {
            Init(10001011, 10042001, 54, 239, 56, 241);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:步伐沙漠練習場(10042001)
    //目標坐標:(54,239) ~ (56,241)

    public class P10001012 : RandomPortal
    {
        public P10001012()
        {
            Init(10001012, 10042001, 41, 37, 43, 39);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:步伐沙漠練習場(10042001)
    //目標坐標:(41,37) ~ (43,39)

    public class P10001013 : RandomPortal
    {
        public P10001013()
        {
            Init(10001013, 10064001, 230, 27, 232, 29);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:鐵火山練習場(10064001)
    //目標坐標:(230,27) ~ (232,29)

    public class P10001014 : RandomPortal
    {
        public P10001014()
        {
            Init(10001014, 10064001, 60, 208, 62, 210);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:鐵火山練習場(10064001)
    //目標坐標:(60,208) ~ (62,210)

    public class P10001015 : RandomPortal
    {
        public P10001015()
        {
            Init(10001015, 10064001, 161, 110, 163, 112);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:鐵火山練習場(10064001)
    //目標坐標:(161,110) ~ (163,112)

    public class P10001016 : RandomPortal
    {
        public P10001016()
        {
            Init(10001016, 10064001, 16, 16, 18, 18);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:鐵火山練習場(10064001)
    //目標坐標:(16,16) ~ (18,18)

    public class P10001017 : RandomPortal
    {
        public P10001017()
        {
            Init(10001017, 20020001, 245, 136, 247, 138);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:南部地牢B1F練習場(20020001)
    //目標坐標:(245,136) ~ (247,138)

    public class P10001018 : RandomPortal
    {
        public P10001018()
        {
            Init(10001018, 20020001, 15, 119, 17, 121);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:南部地牢B1F練習場(20020001)
    //目標坐標:(15,119) ~ (17,121)

    public class P10001019 : RandomPortal
    {
        public P10001019()
        {
            Init(10001019, 20020001, 127, 225, 129, 227);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:南部地牢B1F練習場(20020001)
    //目標坐標:(127,225) ~ (129,227)

    public class P10001020 : RandomPortal
    {
        public P10001020()
        {
            Init(10001020, 20020001, 127, 2, 129, 4);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:南部地牢B1F練習場(20020001)
    //目標坐標:(127,2) ~ (129,4)

    public class P10001024 : RandomPortal
    {
        public P10001024()
        {
            Init(10001024, 10071000, 244, 82, 246, 84);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:泰迪島(10071000)
    //目標坐標:(244,82) ~ (246,84)

    public class P10001025 : RandomPortal
    {
        public P10001025()
        {
            Init(10001025, 10071000, 64, 209, 64, 211);
        }
    }
    //原始地圖:
    //目標地圖:泰迪島(10071000)
    //目標坐標:(64,209) ~ (64,211)

    public class P10001026 : RandomPortal
    {
        public P10001026()
        {
            Init(10001026, 30051001, 3, 5, 3, 5);
        }
    }
    //原始地圖:行會宮殿4樓(30113000)
    //目標地圖:商人行會(30051001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001027 : RandomPortal
    {
        public P10001027()
        {
            Init(10001027, 30055001, 3, 5, 3, 5);
        }
    }
    //原始地圖:行會宮殿5樓(30114000)
    //目標地圖:？？？的房間(30055001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001028 : RandomPortal
    {
        public P10001028()
        {
            Init(10001028, 10062000, 129, 179, 129, 179);
        }
    }
    //原始地圖:
    //目標地圖:唐卡島(10062000)
    //目標坐標:(129,179) ~ (129,179)
    
    public class P10001032 : RandomPortal
    {
        public P10001032()
        {
            Init(10001032, 10054100, 43, 64, 43, 64);
        }
    }
    //原始地圖:海盜會館(30131002)
    //目標地圖:謎之團要塞北部(10054100)
    //目標坐標:(43,64) ~ (43,64)

    public class P10001033 : RandomPortal
    {
        public P10001033()
        {
            Init(10001033, 30131002, 5, 9, 7, 10);
        }
    }
    //原始地圖:謎之團要塞北部(10054100)
    //目標地圖:海盜會館(30131002)
    //目標坐標:(5,9) ~ (7,10)

    //原始地圖:軍艦島(10035000)
    //目標地圖:摩根市(10060000)
    //目標坐標:(228,171) ~ (229,203)

    //原始地圖:摩根市(10060000)
    //目標地圖:軍艦島(10035000)
    //目標坐標:(97,200) ~ (105,211)

    public class P10001034 : RandomPortal
    {
        public P10001034()
        {
            this.EventID = 10001034;
            //Init(10001036, 10060000, 49, 129, 60, 130);
        }
        public override void OnEvent(ActorPC pc)
        {
            switch (Select(pc, "這是往摩根市的飛空庭喔", "", "搭乘飛空庭", "暫時不用"))
            {
                case 1:
                    PlaySound(pc, 2426, false, 100, 50);
                    Say(pc, 0, 131, "向摩根市出發$R;");
                    PlaySound(pc, 2438, false, 100, 50);
                    ShowEffect(pc, 206, 144, 8066);
                    Wait(pc, 2000);
                    Warp(pc, 10060000, 223, 174);
                    break;
                case 2:
                    break;
            }
        }
    }
    public class P10001035 : RandomPortal
    {
        public P10001035()
        {
            this.EventID = 10001035;
            //Init(10001036, 10060000, 49, 129, 60, 130);
        }
        public override void OnEvent(ActorPC pc)
        {
            switch (Select(pc, "要搭乘飞空庭回去军舰岛吗？", "", "搭乘飞空庭", "暂时不用"))
            {
                case 1:
                    PlaySound(pc, 2426, false, 100, 50);
                    Say(pc, 0, 131, "向军舰岛出发$R;");
                    PlaySound(pc, 2438, false, 100, 50);
                    ShowEffect(pc, 206, 144, 8066);
                    Wait(pc, 2000);
                    Warp(pc, 10035000, 96, 211);
                    break;
                case 2:
                    break;
            }
        }
    }
    public class P10001036 : RandomPortal
    {
        public P10001036()
        {
            this.EventID = 10001036;
            //Init(10001036, 10060000, 49, 129, 60, 130);
        }
        public override void OnEvent(ActorPC pc)
        {
            switch (Select(pc, "這是往摩根市的飛空庭喔", "", "搭乘飛空庭", "暫時不用"))
            {
                case 1:
                    PlaySound(pc, 2426, false, 100, 50);
                    Say(pc, 0, 131, "向摩根市出發$R;");
                    PlaySound(pc, 2438, false, 100, 50);
                    ShowEffect(pc, 206, 144, 8066);
                    Wait(pc, 2000);
                    Warp(pc, 10060000, 55, 129);
                    break;
                case 2:
                    break;
            }
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:摩根市(10060000)
    //目標坐標:(49,129) ~ (60,130)

    //原始地圖:摩根市(10060000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(199,142) ~ (200,145)

    public class P10001038 : RandomPortal
    {
        public P10001038()
        {
            Init(10001038, 10060000, 157, 91, 158, 92);
        }
    }
    //原始地圖:摩根傭兵軍團本部(30094000)
    //目標地圖:摩根市(10060000)
    //目標坐標:(157,91) ~ (158,92)

    public class P10001039 : RandomPortal
    {
        public P10001039()
        {
            Init(10001039, 30094000, 6, 10, 6, 10);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:摩根傭兵軍團本部(30094000)
    //目標坐標:(6,10) ~ (6,10)

    public class P10001040 : RandomPortal
    {
        public P10001040()
        {
            Init(10001040, 10060000, 155, 68, 156, 69);
        }
    }
    //原始地圖:戰士系行會分會(30096000)
    //目標地圖:摩根市(10060000)
    //目標坐標:(155,68) ~ (156,69)

    public class P10001041 : RandomPortal
    {
        public P10001041()
        {
            Init(10001041, 30096000, 7, 12, 9, 12);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:戰士系行會分會(30096000)
    //目標坐標:(7,12) ~ (9,12)

    public class P10001042 : RandomPortal
    {
        public P10001042()
        {
            Init(10001042, 10060000, 139, 68, 140, 68);
        }
    }
    //原始地圖:摩根政府大廈(30095000)
    //目標地圖:摩根市(10060000)
    //目標坐標:(139,68) ~ (140,68)

    public class P10001043 : RandomPortal
    {
        public P10001043()
        {
            Init(10001043, 30095000, 8, 12, 8, 12);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:摩根政府大廈(30095000)
    //目標坐標:(8,12) ~ (8,12)

    public class P10001044 : RandomPortal
    {
        public P10001044()
        {
            Init(10001044, 10060000, 109, 97, 109, 97);
        }
    }
    //原始地圖:國營精煉所(30099000)
    //目標地圖:摩根市(10060000)
    //目標坐標:(109,97) ~ (109,97)

    public class P10001045 : RandomPortal
    {
        public P10001045()
        {
            Init(10001045, 30099000, 7, 15, 7, 15);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:國營精煉所(30099000)
    //目標坐標:(7,15) ~ (7,15)

    public class P10001046 : RandomPortal
    {
        public P10001046()
        {
            Init(10001046, 10060000, 142, 97, 142, 97);
        }
    }
    //原始地圖:迪澳曼特私人精煉所(30099001)
    //目標地圖:摩根市(10060000)
    //目標坐標:(142,97) ~ (142,97)

    public class P10001047 : RandomPortal
    {
        public P10001047()
        {
            Init(10001047, 30099001, 7, 15, 7, 15);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:迪澳曼特私人精煉所(30099001)
    //目標坐標:(7,15) ~ (7,15)

    public class P10001048 : RandomPortal
    {
        public P10001048()
        {
            Init(10001048, 10060000, 119, 186, 120, 186);
        }
    }
    //原始地圖:國營精煉所(30099002)
    //目標地圖:摩根市(10060000)
    //目標坐標:(119,186) ~ (120,186)

    public class P10001049 : RandomPortal
    {
        public P10001049()
        {
            Init(10001049, 30099002, 7, 15, 7, 15);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:國營精煉所(30099002)
    //目標坐標:(7,15) ~ (7,15)

    public class P10001050 : RandomPortal
    {
        public P10001050()
        {
            this.EventID = 10001050;
            //Init(10001050, 10060000, 81, 152, 81, 153);
        }

        public override void OnEvent(ActorPC pc)
        {
            NPCMotion(pc, 11000828, 159);
            NPCMotion(pc, 11000829, 159);
            Wait(pc, 1000);
            Say(pc, 0, 131, "謝謝唷$R;", "\"介紹負責人\"");
            Warp(pc, 10060000, 81, 152);
        }
    }
    //原始地圖:商人行會總部(30097000)
    //目標地圖:摩根市(10060000)
    //目標坐標:(81,152) ~ (81,153)

    public class P10001051 : RandomPortal
    {
        public P10001051()
        {
            Init(10001051, 30097000, 8, 12, 8, 12);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:商人行會總部(30097000)
    //目標坐標:(8,12) ~ (8,12)

    public class P10001052 : RandomPortal
    {
        public P10001052()
        {
            Init(10001052, 10060000, 105, 175, 105, 176);
        }
    }
    //原始地圖:碳礦監督廳(30098000)
    //目標地圖:摩根市(10060000)
    //目標坐標:(105,175) ~ (105,176)

    public class P10001053 : RandomPortal
    {
        public P10001053()
        {
            Init(10001053, 30098000, 6, 8, 6, 8);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:碳礦監督廳(30098000)
    //目標坐標:(6,8) ~ (6,8)

    public class P10001054 : RandomPortal
    {
        public P10001054()
        {
            Init(10001054, 10060000, 97, 101, 97, 101);
        }
    }
    //原始地圖:礦工之部屋(30092000)
    //目標地圖:摩根市(10060000)
    //目標坐標:(97,101) ~ (97,101)

    public class P10001055 : RandomPortal
    {
        public P10001055()
        {
            Init(10001055, 30092000, 4, 7, 4, 7);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:礦工之部屋(30092000)
    //目標坐標:(4,7) ~ (4,7)

    public class P10001056 : RandomPortal
    {
        public P10001056()
        {
            Init(10001056, 10060000, 149, 163, 149, 164);
        }
    }
    //原始地圖:摩根咖啡館(30010008)
    //目標地圖:摩根市(10060000)
    //目標坐標:(149,163) ~ (149,164)

    public class P10001057 : RandomPortal
    {
        public P10001057()
        {
            Init(10001057, 30010008, 3, 5, 3, 5);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:摩根咖啡館(30010008)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001058 : RandomPortal
    {
        public P10001058()
        {
            Init(10001058, 10060000, 127, 78, 128, 78);
        }
    }
    //原始地圖:摩根寵物咖啡館(30010009)
    //目標地圖:摩根市(10060000)
    //目標坐標:(127,78) ~ (128,78)

    public class P10001059 : RandomPortal
    {
        public P10001059()
        {
            Init(10001059, 30010009, 3, 5, 3, 5);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:摩根寵物咖啡館(30010009)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001060 : RandomPortal
    {
        public P10001060()
        {
            Init(10001060, 10060000, 170, 91, 170, 92);
        }
    }
    //原始地圖:摩根古董商店(30014002)
    //目標地圖:摩根市(10060000)
    //目標坐標:(170,91) ~ (170,92)

    public class P10001061 : RandomPortal
    {
        public P10001061()
        {
            Init(10001061, 30014002, 3, 5, 3, 5);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:摩根古董商店(30014002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001062 : RandomPortal
    {
        public P10001062()
        {
            Init(10001062, 10060000, 151, 130, 152, 130);
        }
    }
    //原始地圖:摩根裁縫店(30020006)
    //目標地圖:摩根市(10060000)
    //目標坐標:(151,130) ~ (152,130)

    public class P10001063 : RandomPortal
    {
        public P10001063()
        {
            Init(10001063, 30020006, 3, 5, 3, 5);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:摩根裁縫店(30020006)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001064 : RandomPortal
    {
        public P10001064()
        {
            Init(10001064, 10060000, 167, 130, 168, 130);
        }
    }
    //原始地圖:摩根寶石商店(30021004)
    //目標地圖:摩根市(10060000)
    //目標坐標:(167,130) ~ (168,130)

    public class P10001065 : RandomPortal
    {
        public P10001065()
        {
            Init(10001065, 30021004, 3, 5, 3, 5);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:摩根寶石商店(30021004)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001066 : RandomPortal
    {
        public P10001066()
        {
            Init(10001066, 10060000, 139, 149, 140, 149);
        }
    }
    //原始地圖:摩根武器商店(30012004)
    //目標地圖:摩根市(10060000)
    //目標坐標:(139,149) ~ (140,149)

    public class P10001067 : RandomPortal
    {
        public P10001067()
        {
            Init(10001067, 30012004, 3, 5, 3, 5);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:摩根武器商店(30012004)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001068 : RandomPortal
    {
        public P10001068()
        {
            Init(10001068, 10060000, 145, 124, 145, 125);
        }
    }
    //原始地圖:闇黑武器屋(30002002)
    //目標地圖:摩根市(10060000)
    //目標坐標:(145,124) ~ (145,125)

    public class P10001069 : RandomPortal
    {
        public P10001069()
        {
            Init(10001069, 30002002, 3, 5, 3, 5);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:闇黑武器屋(30002002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001070 : RandomPortal
    {
        public P10001070()
        {
            Init(10001070, 10060000, 88, 144, 90, 146);
        }
    }
    //原始地圖:
    //目標地圖:摩根市(10060000)
    //目標坐標:(88,144) ~ (90,146)

    public class P10001071 : RandomPortal
    {
        public P10001071()
        {
            Init(10001071, 10060000, 145, 141, 145, 146);
        }
    }
    //原始地圖:
    //目標地圖:摩根市(10060000)
    //目標坐標:(145,141) ~ (145,146)

    public class P10001076 : RandomPortal
    {
        public P10001076()
        {
            Init(10001076, 60001000, 24, 24, 27, 27);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(60001000)
    //目標坐標:(24,24) ~ (27,27)

    public class P10001077 : RandomPortal
    {
        public P10001077()
        {
            Init(10001077, 61004000, 83, 76, 83, 76);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(61004000)
    //目標坐標:(83,76) ~ (83,76)

    public class P10001078 : RandomPortal
    {
        public P10001078()
        {
            Init(10001078, 63006000, 40, 40, 40, 40);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(63006000)
    //目標坐標:(40,40) ~ (40,40)

    public class P10001079 : RandomPortal
    {
        public P10001079()
        {
            Init(10001079, 63007000, 27, 27, 27, 27);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(63007000)
    //目標坐標:(27,27) ~ (27,27)

    public class P10001080 : RandomPortal
    {
        public P10001080()
        {
            Init(10001080, 63008000, 19, 19, 19, 19);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(63008000)
    //目標坐標:(19,19) ~ (19,19)

    public class P10001081 : RandomPortal
    {
        public P10001081()
        {
            Init(10001081, 62002000, 47, 47, 47, 47);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(62002000)
    //目標坐標:(47,47) ~ (47,47)

    public class P10001082 : RandomPortal
    {
        public P10001082()
        {
            Init(10001082, 62003000, 56, 56, 56, 56);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(62003000)
    //目標坐標:(56,56) ~ (56,56)

    public class P10001083 : RandomPortal
    {
        public P10001083()
        {
            Init(10001083, 64008000, 8, 56, 8, 56);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(64008000)
    //目標坐標:(8,56) ~ (8,56)

    public class P10001084 : RandomPortal
    {
        public P10001084()
        {
            Init(10001084, 64009000, 24, 28, 24, 28);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(64009000)
    //目標坐標:(24,28) ~ (24,28)

    public class P10001085 : RandomPortal
    {
        public P10001085()
        {
            Init(10001085, 64010000, 31, 23, 31, 23);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(64010000)
    //目標坐標:(31,23) ~ (31,23)

    public class P10001086 : RandomPortal
    {
        public P10001086()
        {
            Init(10001086, 64011000, 37, 17, 37, 17);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(64011000)
    //目標坐標:(37,17) ~ (37,17)

    public class P10001087 : RandomPortal
    {
        public P10001087()
        {
            Init(10001087, 64012000, 43, 41, 43, 41);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(64012000)
    //目標坐標:(43,41) ~ (43,41)

    public class P10001095 : RandomPortal
    {
        public P10001095()
        {
            Init(10001095, 50021000, 8, 12, 8, 12);
        }
    }
    //原始地圖:摩根市(10060000)
    //目標地圖:古魯杜的大宅(50021000)
    //目標坐標:(8,12) ~ (8,12)

    public class P10001096 : RandomPortal
    {
        public P10001096()
        {
            Init(10001096, 10060000, 80, 130, 81, 131);
        }
    }
    //原始地圖:古魯杜的大宅(50021000)
    //目標地圖:摩根市(10060000)
    //目標坐標:(80,130) ~ (81,131)

    public class P10001097 : Event
    {
        public P10001097()
        {
            this.EventID = 10001097;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 131, "好像進不去呢.", " ");
        }
    }
    /*
    public class P10001097 : RandomPortal
    {
        public P10001097()
        {
            Init(10001097, 50022000, 3, 6, 3, 6);
        }
    }//*/
    //原始地圖:北部地牢(20014000)
    //目標地圖:空置小屋(50022000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10001098 : RandomPortal
    {
        public P10001098()
        {
            Init(10001098, 20014000, 22, 160, 22, 160);
        }
    }
    //原始地圖:空置小屋(50022000)
    //目標地圖:北部地牢(20014000)
    //目標坐標:(22,160) ~ (22,160)

    public class P10001099 : RandomPortal
    {
        public P10001099()
        {
            Init(10001099, 50023000, 3, 6, 3, 6);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:避難所(50023000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10001100 : RandomPortal
    {
        public P10001100()
        {
            Init(10001100, 30130000, 7, 4, 7, 4);
        }
    }
    //原始地圖:
    //目標地圖:帕斯特管理局(30130000)
    //目標坐標:(7,4) ~ (7,4)

    public class P10001101 : RandomPortal
    {
        public P10001101()
        {
            Init(10001101, 10064000, 102, 209, 102, 209);
        }
    }
    //原始地圖:避難所(50023000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(102,209) ~ (102,209)

    public class P10001103 : RandomPortal
    {
        public P10001103()
        {
            Init(10001103, 60000000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:INSD:遺跡內部(60000000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001104 : RandomPortal
    {
        public P10001104()
        {
            Init(10001104, 61000000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:INSD:遺跡內部(61000000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001105 : RandomPortal
    {
        public P10001105()
        {
            Init(10001105, 61001000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:(61001000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001106 : RandomPortal
    {
        public P10001106()
        {
            Init(10001106, 61002000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:(61002000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001107 : RandomPortal
    {
        public P10001107()
        {
            Init(10001107, 61003000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:(61003000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001108 : RandomPortal
    {
        public P10001108()
        {
            Init(10001108, 62000000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:INSD:遺跡內部(62000000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001109 : RandomPortal
    {
        public P10001109()
        {
            Init(10001109, 20080012, 22, 28, 28, 41);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:遺跡入口前廣場(20080012)
    //目標坐標:(22,28) ~ (28,41)

    public class P10001110 : RandomPortal
    {
        public P10001110()
        {
            Init(10001110, 20080013, 22, 28, 28, 41);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:遺跡入口前廣場(20080013)
    //目標坐標:(22,28) ~ (28,41)

    public class P10001111 : RandomPortal
    {
        public P10001111()
        {
            Init(10001111, 20080014, 22, 28, 28, 41);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:遺跡入口前廣場(20080014)
    //目標坐標:(22,28) ~ (28,41)

    public class P10001112 : RandomPortal
    {
        public P10001112()
        {
            Init(10001112, 10024000, 131, 55, 137, 59);
        }
    }
    //原始地圖:遺跡入口前廣場(20080012)
    //目標地圖:下城(10024000)
    //目標坐標:(131,55) ~ (137,59)

    public class P10001113 : RandomPortal
    {
        public P10001113()
        {
            Init(10001113, 10063100, 47, 148, 50, 152);
        }
    }
    //原始地圖:遺跡入口前廣場(20080014)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(47,148) ~ (50,152)

    public class P10001114 : RandomPortal
    {
        public P10001114()
        {
            Init(10001114, 10065000, 74, 40, 78, 48);
        }
    }
    //原始地圖:遺跡入口前廣場(20080013)
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(74,40) ~ (78,48)

    //原始地圖:上城(10023000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(186,64) ~ (187,65)

    public class P10001258 : RandomPortal
    {
        public P10001258()
        {
            Init(10001258, 10023000, 152, 192, 155, 196);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:上城(10023000)
    //目標坐標:(152,192) ~ (155,196)

    public class P10001260 : RandomPortal
    {
        public P10001260()
        {
            Init(10001260, 10034002, 162, 29, 166, 33);
        }
    }
    //原始地圖:奧克魯尼亞東海岸(10034000)
    //目標地圖:東海岸寵物養殖場(10034002)
    //目標坐標:(162,29) ~ (166,33)

    public class P10001261 : RandomPortal
    {
        public P10001261()
        {
            Init(10001261, 10034000, 162, 29, 166, 33);
        }
    }
    //原始地圖:東海岸寵物養殖場(10034002)
    //目標地圖:奧克魯尼亞東海岸(10034000)
    //目標坐標:(162,29) ~ (166,33)

    public class P10001262 : RandomPortal
    {
        public P10001262()
        {
            Init(10001262, 10002001, 217, 21, 219, 23);
        }
    }
    //原始地圖:瑞路斯雪原(10002000)
    //目標地圖:瑞路斯雪原寵物養殖場(10002001)
    //目標坐標:(217,21) ~ (219,23)

    public class P10001263 : RandomPortal
    {
        public P10001263()
        {
            Init(10001263, 10002000, 217, 21, 219, 23);
        }
    }
    //原始地圖:瑞路斯雪原寵物養殖場(10002001)
    //目標地圖:瑞路斯雪原(10002000)
    //目標坐標:(217,21) ~ (219,23)

    public class P10001264 : RandomPortal
    {
        public P10001264()
        {
            Init(10001264, 20070100, 22, 83, 25, 85);
        }
    }
    //原始地圖:步伐沙漠(10042000)、回廊養殖場2F(20070101)、回廊養殖場3F(20070102)
    //目標地圖:回廊養殖場1F(20070100)
    //目標坐標:(22,83) ~ (25,85)

    public class P10001266 : RandomPortal
    {
        public P10001266()
        {
            Init(10001266, 20070102, 22, 83, 25, 85);
        }
    }
    //原始地圖:回廊養殖場1F(20070100)、回廊養殖場2F(20070101)
    //目標地圖:回廊養殖場3F(20070102)
    //目標坐標:(22,83) ~ (25,85)

    public class P10001267 : RandomPortal
    {
        public P10001267()
        {
            Init(10001267, 20070101, 22, 83, 25, 85);
        }
    }
    //原始地圖:回廊養殖場1F(20070100)、回廊養殖場3F(20070102)
    //目標地圖:回廊養殖場2F(20070101)
    //目標坐標:(22,83) ~ (25,85)

    public class P10001268 : RandomPortal
    {
        public P10001268()
        {
            Init(10001268, 20070100, 22, 83, 25, 85);
        }
    }
    //原始地圖:步伐沙漠(10042000)
    //目標地圖:回廊養殖場1F(20070100)
    //目標坐標:(22,83) ~ (25,85)

    public class P10001269 : RandomPortal
    {
        public P10001269()
        {
            Init(10001269, 10042000, 74, 131, 76, 133);
        }
    }
    //原始地圖:回廊養殖場1F(20070100)
    //目標地圖:步伐沙漠(10042000)
    //目標坐標:(74,131) ~ (76,133)


    //原始地圖:馬克特碼頭(20023000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(194,58) ~ (195,59)

    public class P10001271 : RandomPortal
    {
        public P10001271()
        {
            Init(10001271, 20023000, 133, 32, 138, 34);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:馬克特碼頭(20023000)
    //目標坐標:(133,32) ~ (138,34)

    public class P10001272 : RandomPortal
    {
        public P10001272()
        {
            Init(10001272, 30154000, 6, 15, 6, 15);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:活動木偶第一研究所(30154000)
    //目標坐標:(6,15) ~ (6,15)

    public class P10001273 : RandomPortal
    {
        public P10001273()
        {
            Init(10001273, 10062000, 208, 101, 209, 102);
        }
    }
    //原始地圖:活動木偶第一研究所(30154000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(208,101) ~ (209,102)

    public class P10001274 : RandomPortal
    {
        public P10001274()
        {
            Init(10001274, 30154001, 6, 15, 6, 15);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:活動木偶第二研究所(30154001)
    //目標坐標:(6,15) ~ (6,15)

    public class P10001275 : RandomPortal
    {
        public P10001275()
        {
            Init(10001275, 10062000, 208, 141, 209, 142);
        }
    }
    //原始地圖:活動木偶第二研究所(30154001)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(208,141) ~ (209,142)

    public class P10001276 : RandomPortal
    {
        public P10001276()
        {
            Init(10001276, 30156000, 7, 16, 7, 16);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:活動木偶本部(30156000)
    //目標坐標:(7,16) ~ (7,16)

    public class P10001277 : RandomPortal
    {
        public P10001277()
        {
            Init(10001277, 10062000, 179, 143, 180, 144);
        }
    }
    //原始地圖:活動木偶本部(30156000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(179,143) ~ (180,144)

    public class P10001278 : RandomPortal
    {
        public P10001278()
        {
            Init(10001278, 30155000, 6, 11, 6, 11);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:多爾斯軍本部(30155000)
    //目標坐標:(6,11) ~ (6,11)

    public class P10001279 : RandomPortal
    {
        public P10001279()
        {
            Init(10001279, 10062000, 174, 122, 175, 123);
        }
    }
    //原始地圖:多爾斯軍本部(30155000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(174,122) ~ (175,123)

    public class P10001280 : RandomPortal
    {
        public P10001280()
        {
            Init(10001280, 30157000, 6, 13, 6, 13);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:機械師本部(30157000)
    //目標坐標:(6,13) ~ (6,13)

    public class P10001281 : RandomPortal
    {
        public P10001281()
        {
            Init(10001281, 10062000, 131, 28, 132, 28);
        }
    }
    //原始地圖:機械師本部(30157000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(131,28) ~ (132,28)

    public class P10001282 : RandomPortal
    {
        public P10001282()
        {
            Init(10001282, 30152000, 6, 11, 6, 11);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:雷奧的活動木偶工作室(30152000)
    //目標坐標:(6,11) ~ (6,11)

    public class P10001283 : RandomPortal
    {
        public P10001283()
        {
            Init(10001283, 10062000, 124, 46, 124, 46);
        }
    }
    //原始地圖:雷奧的活動木偶工作室(30152000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(124,46) ~ (124,46)
    
    //原始地圖:唐卡島(10062000)
    //目標地圖:莉塔的活動木偶工作室(30152001)
    //目標坐標:(6,11) ~ (6,11)

    public class P10001285 : RandomPortal
    {
        public P10001285()
        {
            Init(10001285, 10062000, 110, 88, 110, 88);
        }
    }
    //原始地圖:莉塔的活動木偶工作室(30152001)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(110,88) ~ (110,88)

    public class P10001286 : RandomPortal
    {
        public P10001286()
        {
            Init(10001286, 30153000, 6, 11, 6, 11);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:卡米羅的機械工場(30153000)
    //目標坐標:(6,11) ~ (6,11)

    public class P10001287 : RandomPortal
    {
        public P10001287()
        {
            Init(10001287, 10062000, 138, 33, 138, 33);
        }
    }
    //原始地圖:卡米羅的機械工場(30153000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(138,33) ~ (138,33)

    public class P10001288 : RandomPortal
    {
        public P10001288()
        {
            Init(10001288, 30153001, 6, 11, 6, 11);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:利迪亞的機械工場(30153001)
    //目標坐標:(6,11) ~ (6,11)

    public class P10001289 : RandomPortal
    {
        public P10001289()
        {
            Init(10001289, 10062000, 120, 78, 120, 78);
        }
    }
    //原始地圖:利迪亞的機械工場(30153001)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(120,78) ~ (120,78)

    public class P10001290 : RandomPortal
    {
        public P10001290()
        {
            Init(10001290, 30151000, 6, 13, 6, 13);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:唐卡政務大樓(30151000)
    //目標坐標:(6,13) ~ (6,13)

    public class P10001291 : RandomPortal
    {
        public P10001291()
        {
            Init(10001291, 10062000, 92, 150, 92, 152);
        }
    }
    //原始地圖:唐卡政務大樓(30151000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(92,150) ~ (92,152)

    public class P10001292 : RandomPortal
    {
        public P10001292()
        {
            Init(10001292, 30150000, 4, 7, 4, 7);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:唐卡民家(30150000)
    //目標坐標:(4,7) ~ (4,7)

    public class P10001293 : RandomPortal
    {
        public P10001293()
        {
            Init(10001293, 10062000, 41, 120, 41, 120);
        }
    }
    //原始地圖:唐卡民家(30150000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(41,120) ~ (41,120)

    public class P10001294 : RandomPortal
    {
        public P10001294()
        {
            Init(10001294, 30011006, 3, 5, 3, 5);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:砦壁之咖啡館(30011006)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001295 : RandomPortal
    {
        public P10001295()
        {
            Init(10001295, 10062000, 135, 82, 135, 82);
        }
    }
    //原始地圖:砦壁之咖啡館(30011006)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(135,82) ~ (135,82)

    public class P10001296 : RandomPortal
    {
        public P10001296()
        {
            Init(10001296, 30060007, 4, 7, 4, 7);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:唐卡商店(30060007)
    //目標坐標:(4,7) ~ (4,7)

    public class P10001297 : RandomPortal
    {
        public P10001297()
        {
            Init(10001297, 10062000, 125, 92, 125, 92);
        }
    }
    //原始地圖:唐卡商店(30060007)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(125,92) ~ (125,92)

    public class P10001298 : RandomPortal
    {
        public P10001298()
        {
            Init(10001298, 30060008, 4, 7, 4, 7);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:唐卡商店(30060008)
    //目標坐標:(4,7) ~ (4,7)

    public class P10001299 : RandomPortal
    {
        public P10001299()
        {
            Init(10001299, 10062000, 118, 185, 119, 185);
        }
    }
    //原始地圖:唐卡商店(30060008)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(118,185) ~ (119,185)

    public class P10001300 : RandomPortal
    {
        public P10001300()
        {
            Init(10001300, 10025001, 22, 126, 24, 129);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞東部平原(10025001)
    //目標坐標:(22,126) ~ (24,129)


    //原始地圖:東方海角(10018101)
    //目標地圖:東方海角(10018001)
    //目標坐標:(187,64) ~ (189,67)

    public class P10001302 : RandomPortal
    {
        public P10001302()
        {
            Init(10001302, 10018101, 194, 66, 196, 68);
        }
    }
    //原始地圖:東方海角(10018001)
    //目標地圖:東方海角(10018101)
    //目標坐標:(194,66) ~ (196,68)

    public class P10001303 : RandomPortal
    {
        public P10001303()
        {
            Init(10001303, 30201000, 7, 12, 7, 12);
        }
    }
    //原始地圖:東方海角(10018001)
    //目標地圖:飛空庭的庭院(30201000)
    //目標坐標:(7,12) ~ (7,12)

    public class P10001304 : RandomPortal
    {
        public P10001304()
        {
            Init(10001304, 30202000, 9, 14, 9, 14);
        }
    }
    //原始地圖:飛空庭的庭院(30201000)
    //目標地圖:飛空庭的房間(30202000)
    //目標坐標:(9,14) ~ (9,14)
    
    //原始地圖:飛空庭的房間(30202000)
    //目標地圖:飛空庭的庭院(30201000)
    //目標坐標:(7,9) ~ (7,9)

    public class P10001306 : RandomPortal
    {
        public P10001306()
        {
            Init(10001306, 10025001, 170, 98, 173, 101);
        }
    }
    //原始地圖:飛空庭的庭院(30201000)
    //目標地圖:奧克魯尼亞東部平原(10025001)
    //目標坐標:(170,98) ~ (173,101)

    public class P10001307 : RandomPortal
    {
        public P10001307()
        {
            Init(10001307, 30200000, 2, 5, 2, 5);
        }
    }
    //原始地圖:奧克魯尼亞東部平原(10025001)
    //目標地圖:帳篷(30200000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10001308 : RandomPortal
    {
        public P10001308()
        {
            Init(10001308, 10025001, 119, 137, 119, 137);
        }
    }
    //原始地圖:帳篷(30200000)
    //目標地圖:奧克魯尼亞東部平原(10025001)
    //目標坐標:(119,137) ~ (119,137)

    public class P10001309 : RandomPortal
    {
        public P10001309()
        {
            Init(10001309, 10018001, 62, 64, 65, 67);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018001)
    //目標坐標:(62,64) ~ (65,67)

    public class P10001310 : RandomPortal
    {
        public P10001310()
        {
            Init(10001310, 10018101, 197, 64, 200, 67);
        }
    }
    //原始地圖:埃米爾族的夢中(30203000)、道米尼世界的幻影(30205000)、塔妮亞世界的幻影(30204000)
    //目標地圖:東方海角(10018101)
    //目標坐標:(197,64) ~ (200,67)

    public class P10001311 : RandomPortal
    {
        public P10001311()
        {
            Init(10001311, 10023100, 251, 126, 253, 129);
        }
    }
    //原始地圖:
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(251,126) ~ (253,129)

    public class P10001312 : RandomPortal
    {
        public P10001312()
        {
            Init(10001312, 10018001, 62, 64, 65, 67);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018001)
    //目標坐標:(62,64) ~ (65,67)

    public class P10001316 : RandomPortal
    {
        public P10001316()
        {
            Init(10001316, 30201003, 7, 9, 7, 9);
        }
    }
    //原始地圖:飛空庭的房間(30202002)
    //目標地圖:飛空庭的庭院(30201003)
    //目標坐標:(7,9) ~ (7,9)
    
    //原始地圖:奧克魯尼亞東部平原(10025000)
    //目標地圖:東部平原初心者學校(30091001)
    //目標坐標:(6,15) ~ (6,15)

    public class P10001318 : Event
    {
        public P10001318()
        {
            this.EventID = 10001318;
        }

        public override void OnEvent(ActorPC pc)
        {
            switch (Select(pc, "想去哪裡呢?", "", "奧克魯尼亞東部平原", "奧克魯尼亞西部平原", "奧克魯尼亞南部平原", "奧克魯尼亞北部平原", "不出去"))
            {
                case 1:
                    Warp(pc, 10025000, 108, 123);
                    break;

                case 2:
                    Warp(pc, 10022000, 143, 133);
                    break;

                case 3:
                    Warp(pc, 10031000, 132, 121);
                    break;

                case 4:
                    Warp(pc, 10014000, 123, 147);
                    break;

                case 5:
                    break;
            }
        }
    }
    //原始地圖:東部平原初心者學校(30091001)
    //目標地圖:奧克魯尼亞東部平原(10025000)
    //目標坐標:(108,123) ~ (108,123)

    public class P10001319 : Event
    {
        public P10001319()
        {
            this.EventID = 10001319;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (pc.Level < 15)
            {
                Warp(pc, 30091001, 6, 15);
            }
            else
            {
                Say(pc, 0, 65535, "……??$R;" +
                                  "$R不能進入?$R;" +
                                  "$P啊…忘記說了。$R;" +
                                  "$R有一定經驗的人不能進入「初心者學校」呀!$R;", " ");
            }
        }
    }
    //原始地圖:奧克魯尼亞西部平原(10022000)
    //目標地圖:西部平原初心者學校(30091002)
    //目標坐標:(6,15) ~ (6,15)

    public class P10001320 : Event
    {
        public P10001320()
        {
            this.EventID = 10001320;
        }

        public override void OnEvent(ActorPC pc)
        {
            switch (Select(pc, "想去哪裡呢?", "", "奧克魯尼亞東部平原", "奧克魯尼亞西部平原", "奧克魯尼亞南部平原", "奧克魯尼亞北部平原", "不出去"))
            {
                case 1:
                    Warp(pc, 10025000, 108, 123);
                    break;

                case 2:
                    Warp(pc, 10022000, 143, 133);
                    break;

                case 3:
                    Warp(pc, 10031000, 132, 121);
                    break;

                case 4:
                    Warp(pc, 10014000, 123, 147);
                    break;

                case 5:
                    break;
            }
        }
    }
    //原始地圖:西部平原初心者學校(30091002)
    //目標地圖:奧克魯尼亞西部平原(10022000)
    //目標坐標:(143,132) ~ (143,132)

    public class P10001321 : Event
    {
        public P10001321()
        {
            this.EventID = 10001321;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (pc.Level < 15)
            {
                Warp(pc, 30091001, 6, 15);
            }
            else
            {
                Say(pc, 0, 65535, "……??$R;" +
                                  "$R不能進入?$R;" +
                                  "$P啊…忘記說了。$R;" +
                                  "$R有一定經驗的人不能進入「初心者學校」呀!$R;", " ");
            }
        }
    }
    //原始地圖:奧克魯尼亞南部平原(10031000)
    //目標地圖:南部平原初心者學校(30091003)
    //目標坐標:(6,15) ~ (6,15)

    public class P10001322 : Event
    {
        public P10001322()
        {
            this.EventID = 10001322;
        }

        public override void OnEvent(ActorPC pc)
        {
            switch (Select(pc, "想去哪裡呢?", "", "奧克魯尼亞東部平原", "奧克魯尼亞西部平原", "奧克魯尼亞南部平原", "奧克魯尼亞北部平原", "不出去"))
            {
                case 1:
                    Warp(pc, 10025000, 108, 123);
                    break;

                case 2:
                    Warp(pc, 10022000, 143, 133);
                    break;

                case 3:
                    Warp(pc, 10031000, 132, 121);
                    break;

                case 4:
                    Warp(pc, 10014000, 123, 147);
                    break;

                case 5:
                    break;
            }
        }
    }
    //原始地圖:南部平原初心者學校(30091003)
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(132,121) ~ (132,121)

    public class P10001323 : Event
    {
        public P10001323()
        {
            this.EventID = 10001323;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (pc.Level < 15)
            {
                Warp(pc, 30091001, 6, 15);
            }
            else
            {
                Say(pc, 0, 65535, "……??$R;" +
                                  "$R不能進入?$R;" +
                                  "$P啊…忘記說了。$R;" +
                                  "$R有一定經驗的人不能進入「初心者學校」呀!$R;", " ");
            }
        }
    }
    //原始地圖:奧克魯尼亞北部平原(10014000)
    //目標地圖:北部平原初心者學校(30091004)
    //目標坐標:(6,15) ~ (6,15)

    public class P10001324 : Event
    {
        public P10001324()
        {
            this.EventID = 10001324;
        }

        public override void OnEvent(ActorPC pc)
        {
            switch (Select(pc, "想去哪裡呢?", "", "奧克魯尼亞東部平原", "奧克魯尼亞西部平原", "奧克魯尼亞南部平原", "奧克魯尼亞北部平原", "不出去"))
            {
                case 1:
                    Warp(pc, 10025000, 108, 123);
                    break;

                case 2:
                    Warp(pc, 10022000, 143, 133);
                    break;

                case 3:
                    Warp(pc, 10031000, 132, 121);
                    break;

                case 4:
                    Warp(pc, 10014000, 123, 147);
                    break;

                case 5:
                    break;
            }
        }
    }
    //原始地圖:北部平原初心者學校(30091004)
    //目標地圖:奧克魯尼亞北部平原(10014000)
    //目標坐標:(123,147) ~ (123,147)

    public class P10001325 : RandomPortal
    {
        public P10001325()
        {
            Init(10001325, 10018002, 45, 94, 57, 96);
        }
    }
    //原始地圖:東方海角(10018000)
    //目標地圖:東方海角(10018002)
    //目標坐標:(45,94) ~ (57,96)

    public class P10001326 : RandomPortal
    {
        public P10001326()
        {
            Init(10001326, 10018000, 45, 94, 57, 96);
        }
    }
    //原始地圖:東方海角(10018002)
    //目標地圖:東方海角(10018000)
    //目標坐標:(45,94) ~ (57,96)

    public class P10001327 : RandomPortal
    {
        public P10001327()
        {
            Init(10001327, 30090002, 2, 2, 4, 3);
        }
    }
    //原始地圖:
    //目標地圖:初始之家(30090002)
    //目標坐標:(2,2) ~ (4,3)

    public class P10001328 : RandomPortal
    {
        public P10001328()
        {
            Init(10001328, 30090003, 2, 2, 4, 3);
        }
    }
    //原始地圖:
    //目標地圖:初始之家(30090003)
    //目標坐標:(2,2) ~ (4,3)

    public class P10001329 : RandomPortal
    {
        public P10001329()
        {
            Init(10001329, 30090004, 2, 2, 4, 3);
        }
    }
    //原始地圖:
    //目標地圖:初始之家(30090004)
    //目標坐標:(2,2) ~ (4,3)

    public class P10001330 : RandomPortal
    {
        public P10001330()
        {
            Init(10001330, 10014002, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014002)
    //目標坐標:(126,197) ~ (129,199)

    public class P10001331 : RandomPortal
    {
        public P10001331()
        {
            Init(10001331, 10025001, 22, 124, 25, 131);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞東部平原(10025001)
    //目標坐標:(22,124) ~ (25,131)

    public class P10001332 : RandomPortal
    {
        public P10001332()
        {
            Init(10001332, 10018001, 135, 64, 137, 66);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018001)
    //目標坐標:(135,64) ~ (137,66)

    public class P10001334 : RandomPortal
    {
        public P10001334()
        {
            Init(10001334, 30097001, 8, 12, 8, 12);
        }
    }
    //原始地圖:
    //目標地圖:賭徒行會(30097001)
    //目標坐標:(8,12) ~ (8,12)

    public class P10001336 : RandomPortal
    {
        public P10001336()
        {
            Init(10001336, 50005000, 11, 16, 11, 16);
        }
    }
    //原始地圖:
    //目標地圖:賭徒監獄(50005000)
    //目標坐標:(11,16) ~ (11,16)

    public class P10001337 : RandomPortal
    {
        public P10001337()
        {
            Init(10001337, 50005000, 3, 1, 3, 1);
        }
    }
    //原始地圖:
    //目標地圖:賭徒監獄(50005000)
    //目標坐標:(3,1) ~ (3,1)

    public class P10001338 : RandomPortal
    {
        public P10001338()
        {
            Init(10001338, 30097001, 8, 5, 8, 5);
        }
    }
    //原始地圖:
    //目標地圖:賭徒行會(30097001)
    //目標坐標:(8,5) ~ (8,5)

    public class P10001339 : RandomPortal
    {
        public P10001339()
        {
            Init(10001339, 10023000, 93, 163, 98, 171);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(93,163) ~ (98,171)

    public class P10001341 : RandomPortal
    {
        public P10001341()
        {
            Init(10001341, 30091005, 6, 15, 6, 15);
        }
    }
    //原始地圖:奧克魯尼亞東部平原(10025001)
    //目標地圖:東部平原初心者學校(30091005)
    //目標坐標:(6,15) ~ (6,15)

    public class P10001342 : RandomPortal
    {
        public P10001342()
        {
            Init(10001342, 10025001, 108, 123, 108, 123);
        }
    }
    //原始地圖:東部平原初心者學校(30091005)
    //目標地圖:奧克魯尼亞東部平原(10025001)
    //目標坐標:(108,123) ~ (108,123)

    public class P10001343 : RandomPortal
    {
        public P10001343()
        {
            Init(10001343, 20146001, 181, 130, 183, 132);
        }
    }
    //原始地圖:
    //目標地圖:光之塔下層(20146001)
    //目標坐標:(181,130) ~ (183,132)

    public class P10001345 : RandomPortal
    {
        public P10001345()
        {
            Init(10001345, 30021005, 3, 5, 3, 5);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:唐卡寶石商店(30021005)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001346 : RandomPortal
    {
        public P10001346()
        {
            Init(10001346, 10062000, 116, 133, 116, 133);
        }
    }
    //原始地圖:唐卡寶石商店(30021005)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(116,133) ~ (116,133)

    public class P10001347 : RandomPortal
    {
        public P10001347()
        {
            Init(10001347, 30002003, 3, 5, 3, 5);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:唐卡秘密商店(30002003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001348 : RandomPortal
    {
        public P10001348()
        {
            Init(10001348, 10062000, 139, 154, 139, 154);
        }
    }
    //原始地圖:唐卡秘密商店(30002003)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(139,154) ~ (139,154)

    public class P10001349 : RandomPortal
    {
        public P10001349()
        {
            Init(10001349, 30020007, 3, 5, 3, 5);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:唐卡裁縫店(30020007)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001350 : RandomPortal
    {
        public P10001350()
        {
            Init(10001350, 10062000, 65, 153, 65, 153);
        }
    }
    //原始地圖:唐卡裁縫店(30020007)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(65,153) ~ (65,153)

    public class P10001351 : RandomPortal
    {
        public P10001351()
        {
            Init(10001351, 30012005, 3, 5, 3, 5);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:唐卡武器商店(30012005)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001352 : RandomPortal
    {
        public P10001352()
        {
            Init(10001352, 10062000, 54, 154, 54, 154);
        }
    }
    //原始地圖:唐卡武器商店(30012005)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(54,154) ~ (54,154)

    public class P10001353 : RandomPortal
    {
        public P10001353()
        {
            Init(10001353, 30014003, 3, 5, 3, 5);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:唐卡古董商店(30014003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001354 : RandomPortal
    {
        public P10001354()
        {
            Init(10001354, 10062000, 46, 160, 46, 160);
        }
    }
    //原始地圖:唐卡古董商店(30014003)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(46,160) ~ (46,160)

    public class P10001355 : RandomPortal
    {
        public P10001355()
        {
            Init(10001355, 30010010, 3, 5, 3, 5);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:唐卡咖啡館(30010010)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001356 : RandomPortal
    {
        public P10001356()
        {
            Init(10001356, 10062000, 58, 166, 58, 166);
        }
    }
    //原始地圖:唐卡咖啡館(30010010)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(58,166) ~ (58,166)

    public class P10001357 : RandomPortal
    {
        public P10001357()
        {
            Init(10001357, 10059000, 68, 147, 72, 150);
        }
    }
    //原始地圖:唐卡島(10062000)
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(68,147) ~ (72,150)

    public class P10001358 : RandomPortal
    {
        public P10001358()
        {
            Init(10001358, 10062000, 182, 70, 185, 71);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(182,70) ~ (185,71)

    public class P10001359 : RandomPortal
    {
        public P10001359()
        {
            Init(10001359, 30156001, 7, 16, 7, 16);
        }
    }
    //原始地圖:
    //目標地圖:活動木偶本部(30156001)
    //目標坐標:(7,16) ~ (7,16)

    public class P10001360 : RandomPortal
    {
        public P10001360()
        {
            Init(10001360, 30157001, 6, 13, 6, 13);
        }
    }
    //原始地圖:
    //目標地圖:機械師本部(30157001)
    //目標坐標:(6,13) ~ (6,13)

    public class P10001361 : RandomPortal
    {
        public P10001361()
        {
            Init(10001361, 50009000, 11, 3, 11, 3);
        }
    }
    //原始地圖:
    //目標地圖:活動木偶第二研究所(50009000)
    //目標坐標:(11,3) ~ (11,3)

    public class P10001362 : RandomPortal
    {
        public P10001362()
        {
            Init(10001362, 50010000, 9, 3, 9, 3);
        }
    }
    //原始地圖:
    //目標地圖:活動木偶第二研究所(50010000)
    //目標坐標:(9,3) ~ (9,3)

    public class P10001363 : RandomPortal
    {
        public P10001363()
        {
            Init(10001363, 10059100, 88, 158, 89, 159);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:麵包樹森林(10059100)
    //目標坐標:(88,158) ~ (89,159)

    public class P10001364 : RandomPortal
    {
        public P10001364()
        {
            Init(10001364, 10059000, 83, 155, 84, 156);
        }
    }
    //原始地圖:麵包樹森林(10059100)
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(83,155) ~ (84,156)

    public class P10001365 : RandomPortal
    {
        public P10001365()
        {
            Init(10001365, 30060009, 4, 7, 4, 7);
        }
    }
    //原始地圖:
    //目標地圖:商人之店(30060009)
    //目標坐標:(4,7) ~ (4,7)

    public class P10001366 : RandomPortal
    {
        public P10001366()
        {
            Init(10001366, 50006000, 7, 12, 7, 12);
        }
    }
    //原始地圖:
    //目標地圖:飛空庭的庭院(50006000)
    //目標坐標:(7,12) ~ (7,12)

    public class P10001367 : RandomPortal
    {
        public P10001367()
        {
            Init(10001367, 10025000, 112, 122, 114, 124);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞東部平原(10025000)
    //目標坐標:(112,122) ~ (114,124)

    public class P10001368 : RandomPortal
    {
        public P10001368()
        {
            Init(10001368, 50007000, 8, 26, 8, 26);
        }
    }
    //原始地圖:
    //目標地圖:阿高普路斯市地下房間(50007000)
    //目標坐標:(8,26) ~ (8,26)

    public class P10001369 : RandomPortal
    {
        public P10001369()
        {
            Init(10001369, 50008000, 8, 3, 8, 3);
        }
    }
    //原始地圖:
    //目標地圖:阿高普路斯市地下房間(50008000)
    //目標坐標:(8,3) ~ (8,3)

    public class P10001370 : RandomPortal
    {
        public P10001370()
        {
            Init(10001370, 30102001, 5, 7, 5, 7);
        }
    }
    //原始地圖:
    //目標地圖:南軍本部長官室(30102001)
    //目標坐標:(5,7) ~ (5,7)

    public class P10001371 : RandomPortal
    {
        public P10001371()
        {
            Init(10001371, 10018100, 221, 68, 221, 68);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018100)
    //目標坐標:(221,68) ~ (221,68)

    public class P10001372 : RandomPortal
    {
        public P10001372()
        {
            Init(10001372, 30032000, 2, 1, 2, 1);
        }
    }
    //原始地圖:
    //目標地圖:南軍本部入口(30032000)
    //目標坐標:(2,1) ~ (2,1)

    public class P10001373 : Event
    {
        public P10001373()
        {
            this.EventID = 10001373;
        }

        public override void OnEvent(ActorPC pc)
        {
            Wait(pc, 333);
            ShowEffect(pc, 0, 9571);
            Wait(pc, 1000);
            Say(pc, 0, 131, "$R有看不見的牆，$R進不去呀$R;");
        }
    }
    

    public class P10001375 : RandomPortal
    {
        public P10001375()
        {
            Init(10001375, 30102001, 5, 15, 5, 15);
        }
    }
    //原始地圖:
    //目標地圖:南軍本部長官室(30102001)
    //目標坐標:(5,15) ~ (5,15)

    public class P10001376 : RandomPortal
    {
        public P10001376()
        {
            Init(10001376, 10071001, 171, 46, 173, 48);
        }
    }
    //原始地圖:
    //目標地圖:得菩提島(10071001)
    //目標坐標:(171,46) ~ (173,48)

    public class P10001377 : RandomPortal
    {
        public P10001377()
        {
            Init(10001377, 20080015, 26, 26, 28, 28);
        }
    }
    //原始地圖:
    //目標地圖:發怒的得菩提的休息室(20080015)
    //目標坐標:(26,26) ~ (28,28)

    public class P10001378 : RandomPortal
    {
        public P10001378()
        {
            Init(10001378, 10071001, 62, 153, 64, 155);
        }
    }
    //原始地圖:
    //目標地圖:得菩提島(10071001)
    //目標坐標:(62,153) ~ (64,155)

    public class P10001379 : RandomPortal
    {
        public P10001379()
        {
            Init(10001379, 10023000, 126, 149, 128, 151);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(126,149) ~ (128,151)

    public class P10001380 : RandomPortal
    {
        public P10001380()
        {
            Init(10001380, 10071000, 211, 135, 217, 147);
        }
    }
    //原始地圖:
    //目標地圖:泰迪島(10071000)
    //目標坐標:(211,135) ~ (217,147)

    public class P10001381 : RandomPortal
    {
        public P10001381()
        {
            Init(10001381, 10071001, 157, 144, 163, 154);
        }
    }
    //原始地圖:
    //目標地圖:得菩提島(10071001)
    //目標坐標:(157,144) ~ (163,154)

    public class P10001383 : RandomPortal
    {
        public P10001383()
        {
            Init(10001383, 10023000, 178, 164, 187, 177);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(178,164) ~ (187,177)

    public class P10001384 : RandomPortal
    {
        public P10001384()
        {
            Init(10001384, 10018100, 215, 90, 219, 98);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018100)
    //目標坐標:(215,90) ~ (219,98)

    public class P10001385 : RandomPortal
    {
        public P10001385()
        {
            Init(10001385, 10035000, 97, 200, 105, 211);
        }
    }
    //原始地圖:
    //目標地圖:軍艦島(10035000)
    //目標坐標:(97,200) ~ (105,211)

    public class P10001386 : RandomPortal
    {
        public P10001386()
        {
            Init(10001386, 10019000, 116, 111, 120, 114);
        }
    }
    //原始地圖:
    //目標地圖:不死島嶼(10019000)
    //目標坐標:(116,111) ~ (120,114)

    public class P10001387 : RandomPortal
    {
        public P10001387()
        {
            Init(10001387, 10046000, 205, 197, 215, 200);
        }
    }
    //原始地圖:
    //目標地圖:南方海角(10046000)
    //目標坐標:(205,197) ~ (215,200)

    public class P10001388 : RandomPortal
    {
        public P10001388()
        {
            Init(10001388, 10001000, 102, 36, 105, 39);
        }
    }
    //原始地圖:
    //目標地圖:北方海角(10001000)
    //目標坐標:(102,36) ~ (105,39)

    public class P10001389 : RandomPortal
    {
        public P10001389()
        {
            Init(10001389, 10056000, 36, 69, 45, 72);
        }
    }
    //原始地圖:
    //目標地圖:牛牛草原(10056000)
    //目標坐標:(36,69) ~ (45,72)

    public class P10001390 : RandomPortal
    {
        public P10001390()
        {
            Init(10001390, 10054000, 203, 162, 208, 165);
        }
    }
    //原始地圖:
    //目標地圖:謎之團要塞(10054000)
    //目標坐標:(203,162) ~ (208,165)

    public class P10001391 : RandomPortal
    {
        public P10001391()
        {
            Init(10001391, 10060000, 228, 171, 229, 203);
        }
    }
    //原始地圖:
    //目標地圖:摩根市(10060000)
    //目標坐標:(228,171) ~ (229,203)

    public class P10001392 : RandomPortal
    {
        public P10001392()
        {
            Init(10001392, 20163000, 144, 68, 154, 71);
        }
    }
    //原始地圖:
    //目標地圖:光之塔上層(20163000)
    //目標坐標:(144,68) ~ (154,71)

    public class P10001393 : RandomPortal
    {
        public P10001393()
        {
            Init(10001393, 10061000, 161, 74, 171, 78);
        }
    }
    //原始地圖:
    //目標地圖:鬼之寢岩(10061000)
    //目標坐標:(161,74) ~ (171,78)

    public class P10001394 : RandomPortal
    {
        public P10001394()
        {
            Init(10001394, 10063100, 118, 46, 121, 58);
        }
    }
    //原始地圖:
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(118,46) ~ (121,58)

    public class P10001395 : RandomPortal
    {
        public P10001395()
        {
            Init(10001395, 10062000, 190, 42, 194, 45);
        }
    }
    //原始地圖:
    //目標地圖:唐卡島(10062000)
    //目標坐標:(190,42) ~ (194,45)

    public class P10001396 : RandomPortal
    {
        public P10001396()
        {
            Init(10001396, 10059000, 68, 147, 72, 150);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(68,147) ~ (72,150)

    public class P10001397 : RandomPortal
    {
        public P10001397()
        {
            Init(10001397, 10050000, 72, 140, 76, 145);
        }
    }
    //原始地圖:
    //目標地圖:北方中央山脈(10050000)
    //目標坐標:(72,140) ~ (76,145)

    public class P10001402 : RandomPortal
    {
        public P10001402()
        {
            Init(10001402, 10066000, 73, 130, 73, 130);
        }
    }
    //原始地圖:皮歐之家(30071001)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(73,130) ~ (73,130)

    public class P10001403 : RandomPortal
    {
        public P10001403()
        {
            Init(10001403, 30071001, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:皮歐之家(30071001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001407 : RandomPortal
    {
        public P10001407()
        {
            Init(10001407, 30102002, 5, 15, 5, 15);
        }
    }
    //原始地圖:
    //目標地圖:南軍本部長官室(30102002)
    //目標坐標:(5,15) ~ (5,15)

    public class P10001408 : RandomPortal
    {
        public P10001408()
        {
            Init(10001408, 20146001, 199, 144, 199, 144);
        }
    }
 
    public class P10001429 : RandomPortal
    {
        public P10001429()
        {
            Init(10001429, 10059101, 88, 158, 89, 159);
        }
    }
    //原始地圖:瑪依瑪依島 (夜)(10059001)
    //目標地圖:麵包樹森林 (夜)(10059101)
    //目標坐標:(88,158) ~ (89,159)

    public class P10001430 : RandomPortal
    {
        public P10001430()
        {
            Init(10001430, 10059001, 83, 155, 84, 156);
        }
    }
    //原始地圖:麵包樹森林 (夜)(10059101)
    //目標地圖:瑪依瑪依島 (夜)(10059001)
    //目標坐標:(83,155) ~ (84,156)

    public class P10001431 : RandomPortal
    {
        public P10001431()
        {
            Init(10001431, 10059101, 234, 35, 234, 35);
        }
    }
    //原始地圖:
    //目標地圖:麵包樹森林 (夜)(10059101)
    //目標坐標:(234,35) ~ (234,35)

    public class P10001432 : RandomPortal
    {
        public P10001432()
        {
            Init(10001432, 10059100, 234, 35, 234, 35);
        }
    }
    //原始地圖:
    //目標地圖:麵包樹森林(10059100)
    //目標坐標:(234,35) ~ (234,35)

    public class P10001433 : RandomPortal
    {
        public P10001433()
        {
            Init(10001433, 30200001, 2, 5, 2, 5);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:朝聖者的住宿設施(30200001)
    //目標坐標:(2,5) ~ (2,5)

    public class P10001434 : RandomPortal
    {
        public P10001434()
        {
            Init(10001434, 30200002, 2, 5, 2, 5);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:朝聖者的住宿設施(30200002)
    //目標坐標:(2,5) ~ (2,5)

    public class P10001435 : RandomPortal
    {
        public P10001435()
        {
            Init(10001435, 30200003, 2, 5, 2, 5);
        }
    }
    //原始地圖:瑪依瑪依島 (夜)(10059001)
    //目標地圖:朝聖者的住宿設施(30200003)
    //目標坐標:(2,5) ~ (2,5)

    public class P10001436 : RandomPortal
    {
        public P10001436()
        {
            Init(10001436, 30200004, 2, 5, 2, 5);
        }
    }
    //原始地圖:瑪依瑪依島 (夜)(10059001)
    //目標地圖:朝聖者的住宿設施(30200004)
    //目標坐標:(2,5) ~ (2,5)

    public class P10001437 : RandomPortal
    {
        public P10001437()
        {
            Init(10001437, 10059000, 103, 52, 103, 52);
        }
    }
    //原始地圖:朝聖者的住宿設施(30200001)
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(103,52) ~ (103,52)

    public class P10001438 : RandomPortal
    {
        public P10001438()
        {
            Init(10001438, 10059000, 101, 46, 101, 46);
        }
    }
    //原始地圖:朝聖者的住宿設施(30200002)
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(101,46) ~ (101,46)

    public class P10001439 : RandomPortal
    {
        public P10001439()
        {
            Init(10001439, 10059001, 103, 52, 103, 52);
        }
    }
    //原始地圖:朝聖者的住宿設施(30200003)
    //目標地圖:瑪依瑪依島 (夜)(10059001)
    //目標坐標:(103,52) ~ (103,52)

    public class P10001440 : RandomPortal
    {
        public P10001440()
        {
            Init(10001440, 10059001, 101, 46, 101, 46);
        }
    }
    //原始地圖:朝聖者的住宿設施(30200004)
    //目標地圖:瑪依瑪依島 (夜)(10059001)
    //目標坐標:(101,46) ~ (101,46)

    public class P10001441 : RandomPortal
    {
        public P10001441()
        {
            Init(10001441, 10059000, 81, 138, 86, 143);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(81,138) ~ (86,143)

    public class P10001442 : RandomPortal
    {
        public P10001442()
        {
            Init(10001442, 10059000, 92, 92, 95, 95);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(92,92) ~ (95,95)

    public class P10001443 : RandomPortal
    {
        public P10001443()
        {
            Init(10001443, 10059102, 234, 35, 234, 35);
        }
    }
    //原始地圖:
    //目標地圖:麵包樹森林(10059102)
    //目標坐標:(234,35) ~ (234,35)

    public class P10001444 : RandomPortal
    {
        public P10001444()
        {
            Init(10001444, 20164000, 125, 125, 130, 130);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:瑪依瑪依遺跡第一甲板(20164000)
    //目標坐標:(125,125) ~ (130,130)

    public class P10001445 : RandomPortal
    {
        public P10001445()
        {
            Init(10001445, 10059000, 97, 93, 97, 94);
        }
    }
    //原始地圖:瑪依瑪依遺跡第一甲板(20164000)
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(97,93) ~ (97,94)

    public class P10001450 : RandomPortal
    {
        public P10001450()
        {
            Init(10001450, 10018102, 197, 64, 200, 67);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018102)
    //目標坐標:(197,64) ~ (200,67)

    public class P10001451 : RandomPortal
    {
        public P10001451()
        {
            Init(10001451, 10018103, 197, 64, 200, 67);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018103)
    //目標坐標:(197,64) ~ (200,67)

    public class P10001452 : RandomPortal
    {
        public P10001452()
        {
            Init(10001452, 10018003, 187, 64, 189, 67);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018003)
    //目標坐標:(187,64) ~ (189,67)

    public class P10001453 : RandomPortal
    {
        public P10001453()
        {
            Init(10001453, 10018102, 194, 66, 196, 68);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018102)
    //目標坐標:(194,66) ~ (196,68)

    public class P10001454 : RandomPortal
    {
        public P10001454()
        {
            Init(10001454, 10018103, 195, 65, 196, 66);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018103)
    //目標坐標:(195,65) ~ (196,66)

    public class P10001455 : RandomPortal
    {
        public P10001455()
        {
            Init(10001455, 30202001, 9, 14, 9, 14);
        }
    }
    //原始地圖:
    //目標地圖:飛空庭的房間(30202001)
    //目標坐標:(9,14) ~ (9,14)

    public class P10001456 : RandomPortal
    {
        public P10001456()
        {
            Init(10001456, 30201001, 7, 9, 7, 9);
        }
    }
    //原始地圖:
    //目標地圖:飛空庭的庭院(30201001)
    //目標坐標:(7,9) ~ (7,9)

    public class P10001457 : RandomPortal
    {
        public P10001457()
        {
            Init(10001457, 30201001, 7, 12, 7, 12);
        }
    }
    //原始地圖:
    //目標地圖:飛空庭的庭院(30201001)
    //目標坐標:(7,12) ~ (7,12)

    public class P10001458 : RandomPortal
    {
        public P10001458()
        {
            Init(10001458, 30203000, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:埃米爾族的夢中(30203000)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001459 : RandomPortal
    {
        public P10001459()
        {
            Init(10001459, 30203001, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:埃米爾族的夢中(30203001)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001460 : RandomPortal
    {
        public P10001460()
        {
            Init(10001460, 30203002, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:埃米爾族的夢中(30203002)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001461 : RandomPortal
    {
        public P10001461()
        {
            Init(10001461, 30204000, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞世界的幻影(30204000)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001462 : RandomPortal
    {
        public P10001462()
        {
            Init(10001462, 30204001, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞世界的幻影(30204001)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001463 : RandomPortal
    {
        public P10001463()
        {
            Init(10001463, 30204002, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞世界的幻影(30204002)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001464 : RandomPortal
    {
        public P10001464()
        {
            Init(10001464, 30205000, 15, 12, 20, 15);
        }
    }
    //原始地圖:
    //目標地圖:道米尼世界的幻影(30205000)
    //目標坐標:(15,12) ~ (20,15)

    public class P10001465 : RandomPortal
    {
        public P10001465()
        {
            Init(10001465, 30205001, 15, 12, 20, 15);
        }
    }
    //原始地圖:
    //目標地圖:道米尼世界的幻影(30205001)
    //目標坐標:(15,12) ~ (20,15)

    public class P10001466 : RandomPortal
    {
        public P10001466()
        {
            Init(10001466, 30205002, 15, 12, 20, 15);
        }
    }
    //原始地圖:
    //目標地圖:道米尼世界的幻影(30205002)
    //目標坐標:(15,12) ~ (20,15)

    public class P10001467 : RandomPortal
    {
        public P10001467()
        {
            Init(10001467, 10025000, 117, 131, 119, 133);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞東部平原(10025000)
    //目標坐標:(117,131) ~ (119,133)

    public class P10001468 : RandomPortal
    {
        public P10001468()
        {
            Init(10001468, 10022000, 142, 121, 144, 123);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞西部平原(10022000)
    //目標坐標:(142,121) ~ (144,123)

    public class P10001469 : RandomPortal
    {
        public P10001469()
        {
            Init(10001469, 10031000, 121, 130, 123, 132);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(121,130) ~ (123,132)

    public class P10001470 : RandomPortal
    {
        public P10001470()
        {
            Init(10001470, 10014000, 132, 136, 134, 138);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞北部平原(10014000)
    //目標坐標:(132,136) ~ (134,138)

    public class P10001471 : RandomPortal
    {
        public P10001471()
        {
            Init(10001471, 20081000, 11, 21, 13, 22);
        }
    }
    //原始地圖:
    //目標地圖:空中之咖啡室(20081000)
    //目標坐標:(11,21) ~ (13,22)

    public class P10001472 : RandomPortal
    {
        public P10001472()
        {
            Init(10001472, 20081000, 11, 4, 13, 6);
        }
    }
    //原始地圖:
    //目標地圖:空中之咖啡室(20081000)
    //目標坐標:(11,4) ~ (13,6)

    public class P10001473 : RandomPortal
    {
        public P10001473()
        {
            Init(10001473, 30208000, 3, 5, 3, 5);
        }
    }
    //原始地圖:奧克魯尼亞南部平原(10031000)
    //目標地圖:僕人的房間(30208000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001474 : RandomPortal
    {
        public P10001474()
        {
            Init(10001474, 30206000, 7, 16, 7, 16);
        }
    }
    //原始地圖:奧克魯尼亞南部平原(10031000)
    //目標地圖:愛麗絲之部屋(30206000)
    //目標坐標:(7,16) ~ (7,16)

    public class P10001475 : RandomPortal
    {
        public P10001475()
        {
            Init(10001475, 30207000, 3, 5, 3, 5);
        }
    }
    //原始地圖:奧克魯尼亞南部平原(10031000)
    //目標地圖:使用者之部屋(30207000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001476 : RandomPortal
    {
        public P10001476()
        {
            Init(10001476, 10031000, 209, 214, 209, 214);
        }
    }
    //原始地圖:僕人的房間(30208000)
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(209,214) ~ (209,214)

    public class P10001477 : RandomPortal
    {
        public P10001477()
        {
            Init(10001477, 10031000, 217, 215, 218, 216);
        }
    }
    //原始地圖:愛麗絲之部屋(30206000)
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(217,215) ~ (218,216)

    public class P10001478 : RandomPortal
    {
        public P10001478()
        {
            Init(10001478, 10031000, 209, 217, 209, 217);
        }
    }
    //原始地圖:使用者之部屋(30207000)
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(209,217) ~ (209,217)

    public class P10001483 : RandomPortal
    {
        public P10001483()
        {
            Init(10001483, 10059002, 86, 16, 89, 18);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059002)
    //目標坐標:(86,16) ~ (89,18)

    public class P10001484 : RandomPortal
    {
        public P10001484()
        {
            Init(10001484, 10059103, 88, 158, 89, 159);
        }
    }
    //原始地圖:
    //目標地圖:麵包樹森林(10059103)
    //目標坐標:(88,158) ~ (89,159)

    public class P10001485 : RandomPortal
    {
        public P10001485()
        {
            Init(10001485, 10059002, 83, 155, 84, 156);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059002)
    //目標坐標:(83,155) ~ (84,156)

    public class P10001486 : RandomPortal
    {
        public P10001486()
        {
            Init(10001486, 10022000, 112, 102, 114, 104);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞西部平原(10022000)
    //目標坐標:(112,102) ~ (114,104)

    public class P10001487 : RandomPortal
    {
        public P10001487()
        {
            Init(10001487, 20091001, 92, 251, 95, 253);
        }
    }
    //原始地圖:
    //目標地圖:毒濕地(20091001)
    //目標坐標:(92,251) ~ (95,253)

    public class P10001488 : RandomPortal
    {
        public P10001488()
        {
            Init(10001488, 30122002, 10, 21, 13, 23);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞大聖堂(30122002)
    //目標坐標:(10,21) ~ (13,23)

    public class P10001489 : RandomPortal
    {
        public P10001489()
        {
            Init(10001489, 19900000, 2, 138, 4, 141);
        }
    }
    //原始地圖:
    //目標地圖:因緣之聖地(19900000)
    //目標坐標:(2,138) ~ (4,141)

    public class P10001490 : RandomPortal
    {
        public P10001490()
        {
            Init(10001490, 30200005, 3, 1, 4, 5);
        }
    }
    //原始地圖:
    //目標地圖:帳篷(30200005)
    //目標坐標:(3,1) ~ (4,5)

    public class P10001491 : RandomPortal
    {
        public P10001491()
        {
            Init(10001491, 10024000, 168, 120, 171, 123);
        }
    }
    //原始地圖:
    //目標地圖:下城(10024000)
    //目標坐標:(168,120) ~ (171,123)

    public class P10001492 : RandomPortal
    {
        public P10001492()
        {
            Init(10001492, 30002004, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:埃米爾之家(30002004)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001493 : RandomPortal
    {
        public P10001493()
        {
            Init(10001493, 20012003, 56, 63, 58, 70);
        }
    }
    //原始地圖:
    //目標地圖:冰結的坑道B3F(20012003)
    //目標坐標:(56,63) ~ (58,70)

    public class P10001494 : RandomPortal
    {
        public P10001494()
        {
            Init(10001494, 50044000, 11, 19, 11, 19);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞傳送室(50044000)
    //目標坐標:(11,19) ~ (11,19)

    public class P10001495 : RandomPortal
    {
        public P10001495()
        {
            Init(10001495, 50045000, 13, 17, 13, 17);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞傳送室(50045000)
    //目標坐標:(13,17) ~ (13,17)

    public class P10001496 : RandomPortal
    {
        public P10001496()
        {
            Init(10001496, 10024000, 197, 167, 197, 167);
        }
    }
    //原始地圖:
    //目標地圖:下城(10024000)
    //目標坐標:(197,167) ~ (197,167)

    public class P10001497 : RandomPortal
    {
        public P10001497()
        {
            Init(10001497, 30091006, 5, 14, 7, 15);
        }
    }
    //原始地圖:
    //目標地圖:等候室(30091006)
    //目標坐標:(5,14) ~ (7,15)

    public class P10001498 : RandomPortal
    {
        public P10001498()
        {
            Init(10001498, 10023000, 168, 109, 171, 111);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(168,109) ~ (171,111)

    public class P10001499 : RandomPortal
    {
        public P10001499()
        {
            Init(10001499, 20117001, 8, 57, 12, 61);
        }
    }
    //原始地圖:
    //目標地圖:大廳(20117001)
    //目標坐標:(8,57) ~ (12,61)

    public class P10001500 : Event
    {
        public P10001500()
        {
            this.EventID = 10001500;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 30098001, 5, 7);
        }
    }
    //原始地圖:
    //目標地圖:恐佈的房間(30098001)
    //目標坐標:(5,7) ~ (7,8)
    
    //原始地圖:
    //目標地圖:大廳(20117001)
    //目標坐標:(14,28) ~ (15,29)
    
    //原始地圖:
    //目標地圖:恐佈的房間(30154002)
    //目標坐標:(5,14) ~ (7,15)

    public class P10001503 : Event
    {
        public P10001503()
        {
            this.EventID = 10001503;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 20117001, 1, 31);
        }
    }
    //原始地圖:
    //目標地圖:大廳(20117001)
    //目標坐標:(1,30) ~ (2,32)

    public class P10001504 : Event
    {
        public P10001504()
        {
            this.EventID = 10001504;
        }

        public override void OnEvent(ActorPC pc)
        {

            Warp(pc, 20117001, 14, 33);
        }
    }
    //原始地圖:
    //目標地圖:大廳(20117001)
    //目標坐標:(14,33) ~ (15,34)
    
    //原始地圖:
    //目標地圖:秘室(50049000)
    //目標坐標:(3,4) ~ (4,5)

    public class P10001506 : Event
    {
        public P10001506()
        {
            this.EventID = 10001506;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 50050000, 3, 31);
        }
    }
    //原始地圖:
    //目標地圖:地下室(50050000)
    //目標坐標:(2,31) ~ (4,33)

    public class P10001507 : RandomPortal
    {
        public P10001507()
        {
            Init(10001507, 20117001, 6, 2, 10, 4);
        }
    }
    //原始地圖:
    //目標地圖:大廳(20117001)
    //目標坐標:(6,2) ~ (10,4)

    public class P10001508 : RandomPortal
    {
        public P10001508()
        {
            Init(10001508, 10023000, 177, 100, 180, 102);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(177,100) ~ (180,102)

    public class P10001510 : RandomPortal
    {
        public P10001510()
        {
            Init(10001510, 50055000, 209, 125, 239, 142);
        }
    }

    //原始地圖:
    //目標地圖:瑪依瑪依島(10059003)
    //目標坐標:(83,155) ~ (84,156)

    public class P10001524 : RandomPortal
    {
        public P10001524()
        {
            Init(10001524, 10059003, 81, 138, 86, 143);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059003)
    //目標坐標:(81,138) ~ (86,143)

    public class P10001525 : RandomPortal
    {
        public P10001525()
        {
            Init(10001525, 30022001, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:書籍抵押所(30022001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001526 : RandomPortal
    {
        public P10001526()
        {
            Init(10001526, 10032000, 235, 84, 236, 85);
        }
    }
    //原始地圖:
    //目標地圖:樂天娜湖泊(10032000)
    //目標坐標:(235,84) ~ (236,85)

    public class P10001527 : RandomPortal
    {
        public P10001527()
        {
            Init(10001527, 30164001, 9, 17, 9, 17);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞王宮（王妃的寢室）(30164001)
    //目標坐標:(9,17) ~ (9,17)

    public class P10001528 : RandomPortal
    {
        public P10001528()
        {
            Init(10001528, 10030002, 193, 3, 194, 3);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞王國領土(10030002)
    //目標坐標:(193,3) ~ (194,3)

    public class P10001529 : RandomPortal
    {
        public P10001529()
        {
            Init(10001529, 10064002, 186, 2, 187, 2);
        }
    }
    //原始地圖:
    //目標地圖:聖火之山(10064002)
    //目標坐標:(186,2) ~ (187,2)

    public class P10001530 : RandomPortal
    {
        public P10001530()
        {
            Init(10001530, 20111001, 30, 21, 30, 21);
        }
    }
    //原始地圖:
    //目標地圖:受詛咒之城(20111001)
    //目標坐標:(30,21) ~ (30,21)

    public class P10001531 : RandomPortal
    {
        public P10001531()
        {
            Init(10001531, 20111001, 3, 21, 3, 21);
        }
    }
    //原始地圖:
    //目標地圖:受詛咒之城(20111001)
    //目標坐標:(3,21) ~ (3,21)

    public class P10001532 : RandomPortal
    {
        public P10001532()
        {
            Init(10001532, 20111002, 16, 3, 16, 3);
        }
    }
    //原始地圖:
    //目標地圖:受詛咒之城(20111002)
    //目標坐標:(16,3) ~ (16,3)

    public class P10001533 : RandomPortal
    {
        public P10001533()
        {
            Init(10001533, 30164001, 9, 17, 9, 17);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞王宮（王妃的寢室）(30164001)
    //目標坐標:(9,17) ~ (9,17)

    public class P10001534 : RandomPortal
    {
        public P10001534()
        {
            Init(10001534, 30022001, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:書籍抵押所(30022001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001535 : RandomPortal
    {
        public P10001535()
        {
            Init(10001535, 30157002, 6, 13, 6, 13);
        }
    }
    //原始地圖:
    //目標地圖:電路機械研究所(30157002)
    //目標坐標:(6,13) ~ (6,13)

    public class P10001536 : RandomPortal
    {
        public P10001536()
        {
            Init(10001536, 20142001, 62, 10, 66, 13);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡上層(20142001)
    //目標坐標:(62,10) ~ (66,13)

    public class P10001537 : RandomPortal
    {
        public P10001537()
        {
            Init(10001537, 20142001, 68, 78, 68, 78);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡上層(20142001)
    //目標坐標:(68,78) ~ (68,78)

    public class P10001538 : RandomPortal
    {
        public P10001538()
        {
            Init(10001538, 20142001, 83, 70, 83, 70);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡上層(20142001)
    //目標坐標:(83,70) ~ (83,70)

    public class P10001539 : RandomPortal
    {
        public P10001539()
        {
            Init(10001539, 20141001, 58, 85, 58, 85);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡下層(20141001)
    //目標坐標:(58,85) ~ (58,85)

    public class P10001540 : RandomPortal
    {
        public P10001540()
        {
            Init(10001540, 20141001, 92, 64, 92, 64);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡下層(20141001)
    //目標坐標:(92,64) ~ (92,64)

    public class P10001541 : RandomPortal
    {
        public P10001541()
        {
            Init(10001541, 10024000, 163, 163, 166, 166);
        }
    }
    //原始地圖:
    //目標地圖:下城(10024000)
    //目標坐標:(163,163) ~ (166,166)

    public class P10001542 : RandomPortal
    {
        public P10001542()
        {
            Init(10001542, 10058000, 125, 244, 125, 244);
        }
    }
    //原始地圖:
    //目標地圖:通天之塔(10058000)
    //目標坐標:(125,244) ~ (125,244)

    public class P10001543 : RandomPortal
    {
        public P10001543()
        {
            Init(10001543, 10054000,200, 166, 202, 169);
        }
    }
    //原始地圖:
    //目標地圖:摩根市(10060000)
    //目標坐標:(82,38) ~ (85,42)

    public class P10001544 : RandomPortal
    {
        public P10001544()
        {
            this.EventID = 10001544;
        }
        public override void OnEvent(ActorPC pc)
        {
            {
                Say(pc, 0, 0, "要出去？（埃米爾界）$R;", "");
                if (Select(pc, "出去？（埃米爾界）", "", "不好", "好") == 2)
                {
                    Warp(pc, 10058000, 128, 157);
                }
            }
        }
    }
    //原始地圖:
    //目標地圖:通天之塔(10058000)
    //目標坐標:(126,157) ~ (129,158)

    public class P10001545 : Event
    {
        public P10001545()
        {
            this.EventID = 10001545;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (CountItem(pc, 10011605) > 0)
            {
                Say(pc, 0, 0, "……。$R;", "");
                ShowEffect(pc, 4048);

                Say(pc, 0, 0, "『降竜石』$R;" +
               "開始放出淡淡的光芒！$R;", "");

                Say(pc, 0, 0, "要把$R;" +
                "『降竜石』舉起來么？$R;", "");
                if (Select(pc, "把『降竜石』舉起來？", "", "不舉起來", "舉起來") == 2)
                {
                    Say(pc, 0, 0, "高高的舉起了『降竜石』。$R;", "");

                    ShowEffect(pc, 4007);
                    Wait(pc, 660);
                    ShowEffect(pc, 4007);
                    Wait(pc, 660);
                    ShowEffect(pc, 4007);
                    ShowEffect(pc, 127, 153, 5306);
                    PlaySound(pc, 2407, false, 100, 50);
                    Wait(pc, 990);
                    Wait(pc, 3960);
                    Say(pc, 0, 0, "『降竜石』碎掉了。$R;", "");
                    TakeItem(pc, 10011605, 1);
                    Warp(pc, 20170001, 32, 59);
                    return;

                }
            }

            if (Select(pc, "要進入塔內么？", "", "不進去", "進去") == 2)
            {
                ShowEffect(pc, 127, 153, 5306);
                PlaySound(pc, 2407, false, 100, 50);
                Wait(pc, 990);
                NPCMotion(pc, 12002089, 621);
                Wait(pc, 3960);
                Warp(pc, 20170000, 31, 59);
            }
        }

    }
    //原始地圖:
    //目標地圖:升降機室(20170000)
    //目標坐標:(30,59) ~ (33,60)

    public class P10001546 : Event
    {
        public P10001546()
        {
            this.EventID = 10001546;
        }
        public override void OnEvent(ActorPC pc)
        {

            Say(pc, 0, 0, "控制面板的$R;" +
            "電源還連接著。$R;", "");
            switch (Select(pc, "要操作畫面么？", "", "不做", "按上方的按鈕", "按下方的按鈕"))
            {

                case 2:
                    ShowEffect(pc, 5289);

                    Say(pc, 0, 131, "嗶……。$R;" +
                    "$P……。$R;" +
                    "$P…………。$R;" +
                    "$P………………。$R;" +
                    "$P訪問成功。$R;" +
                    "開始傳送到塔尼亞界。$R;", " ");
                    ShowEffect(pc, 5314);
                    Wait(pc, 990);
                    Warp(pc, 11058000, 128, 157);
                    break;
                case 3:
                    if (pc.PossesionedActors.Count != 0)
                    {
                        Say(pc, 131, "解除凭依之后才能通过哦.");
                        return;
                    }
                    if (pc.Quest != null)
                        Say(pc, 131, "要交掉任务以后才能通过.");
                    else
                    {
                        ShowEffect(pc, 5289);

                        Say(pc, 0, 0, "ピッ……。$R;" +
                        "$P……。$R;" +
                        "$P…………。$R;" +
                        "$P………………。$R;" +
                        "$Pアクセス成功。$R;" +
                        "ドミニオンワールドニ転移シマスカ？$R;", "");
                        if (Select(pc, "転移シマスカ？", "", "次元転生ついて", "行く") == 2)
                        {
                            Say(pc, 0, 0, "現在あなたのドミニオン界でのＬＶは$R;" +
                            "$RＬＶ$R;" + pc.DominionLevel.ToString() +
                            "$RＪＯＢＬＶ$R;" + pc.DominionJobLevel.ToString() +
                            "。$R;", "");
                            ShowEffect(pc, 5313);
                            Wait(pc, 990);
                            Warp(pc, 12058000, 127, 155);
                            SetHomePoint(pc, 12058000, 128, 155);
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.BACK))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.BACK].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.BACK);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.CHEST_ACCE))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.CHEST_ACCE].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.CHEST_ACCE);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.FACE))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.FACE].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.FACE);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.FACE_ACCE))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.FACE_ACCE].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.FACE_ACCE);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.HEAD))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.HEAD].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.HEAD);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.HEAD_ACCE))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.HEAD_ACCE].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.HEAD_ACCE);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.LEFT_HAND))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.LEFT_HAND].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.LEFT_HAND);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.LOWER_BODY))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.LOWER_BODY].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.LOWER_BODY);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.RIGHT_HAND))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.RIGHT_HAND].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.RIGHT_HAND);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.SHOES))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.SHOES].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.SHOES);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.SOCKS))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.SOCKS].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.SOCKS);
                            }
                            if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.UPPER_BODY))
                            {
                                if (pc.Inventory.Equipments[EnumEquipSlot.UPPER_BODY].BaseData.possibleLv > pc.DominionLevel)
                                    RemoveEquipment(pc, EnumEquipSlot.UPPER_BODY);
                            }
                        }
                    }
                    break;
            }
        }
    }
    //原始地圖:
    //目標地圖:通天之塔(11058000)
    //目標坐標:(126,157) ~ (129,158)

    public class P10001547 : Event
    {
        public P10001547()
        {
            this.EventID = 10001547;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 0, 0, "乘坐么？$R;" +
            "能帶你到漂流水鄉去哦♪$R;", "");
            if (Select(pc, "乘坐么？", "", "不去", "去") == 2)
            {
                Warp(pc, 11053000, 21, 230);
            }
            //Init(10001547, 11053000, 18, 232, 22, 236);
        }
    }
    //原始地圖:
    //目標地圖:飄流水鄉(11053000)
    //目標坐標:(18,232) ~ (22,236)


    //原始地圖:
    //目標地圖:通天之塔(11058001)
    //目標坐標:(126,157) ~ (129,158)
    
    //原始地圖:
    //目標地圖:美人魚之家(21003000)
    //目標坐標:(81,48) ~ (83,50)

    public class P10001569 : RandomPortal
    {
        public P10001569()
        {
            Init(10001569, 11053000, 148, 133, 150, 135);
        }
    }
    //原始地圖:
    //目標地圖:飄流水鄉(11053000)
    //目標坐標:(148,133) ~ (150,135)

    public class P10001570 : RandomPortal
    {
        public P10001570()
        {
            Init(10001570, 20020002, 53, 2, 53, 2);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡第2層(20020002)
    //目標坐標:(53,2) ~ (53,2)

    public class P10001571 : RandomPortal
    {
        public P10001571()
        {
            Init(10001571, 20141001, 75, 13, 79, 13);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡下層(20141001)
    //目標坐標:(75,13) ~ (79,13)

    public class P10001580 : RandomPortal
    {
        public P10001580()
        {
            Init(10001580, 30022002, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:上世紀的房間(30022002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001581 : RandomPortal
    {
        public P10001581()
        {
            Init(10001581, 30157003, 6, 13, 6, 13);
        }
    }
    //原始地圖:
    //目標地圖:電路機械研究所(30157003)
    //目標坐標:(6,13) ~ (6,13)

    public class P10001582 : RandomPortal
    {
        public P10001582()
        {
            Init(10001582, 20142002, 63, 10, 66, 13);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡上層(20142002)
    //目標坐標:(63,10) ~ (66,13)

    public class P10001583 : RandomPortal
    {
        public P10001583()
        {
            Init(10001583, 10057000, 67, 141, 67, 141);
        }
    }
    //原始地圖:
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(67,141) ~ (67,141)

    public class P10001584 : RandomPortal
    {
        public P10001584()
        {
            Init(10001584, 30093000, 4, 7, 4, 7);
        }
    }
    //原始地圖:
    //目標地圖:伐木工人之家(30093000)
    //目標坐標:(4,7) ~ (4,7)




    //下面开始是ECO城
    public class P10001661 : RandomPortal
    {
        public P10001661()
        {
            Init(10001661, 11027000, 168, 154, 169, 157);
        }
    }
    //ECO温泉到沙滩

    public class P10001662 : RandomPortal
    {
        public P10001662()
        {
            Init(10001662, 11027000, 114, 105, 116, 109);
        }
    }
    //大厅到沙滩

    public class P10001663 : RandomPortal
    {
        public P10001663()
        {
            Init(10001663, 11027000, 178, 49, 179, 52);
        }
    }
    //市场到沙滩

    public class P10001664 : RandomPortal
    {
        public P10001664()
        {
            Init(10001664, 31300000, 45, 88, 47, 90);
        }
    }
    //沙滩到大厅

    public class P10001665 : RandomPortal
    {
        public P10001665()
        {
            Init(10001665, 31300000, 45, 19, 47, 20);
        }
    }
    //赌场到大厅1
    /*
        public class P11001907 : RandomPortal
        {
            public P11001907()
            {
                Init(11001907, 31300000, 45, 19, 47, 20);
            }
        }
    */
    //赌场到大厅2

    public class P10001666 : RandomPortal
    {
        public P10001666()
        {
            Init(10001666, 31300000, 72, 45, 74, 47);
        }
    }
    //市场到大厅

    public class P10001667 : RandomPortal
    {
        public P10001667()
        {
            Init(10001667, 31300000, 19, 45, 20, 47);
        }
    }
    //温泉入口到大厅

    public class P10001668 : RandomPortal
    {
        public P10001668()
        {
            Init(10001668, 31302000, 41, 76, 43, 76);
        }
    }
    //沙滩到市场

    public class P10001669 : RandomPortal
    {
        public P10001669()
        {
            Init(10001669, 31302000, 14, 44, 15, 47);
        }
    }
    //大厅到市场

    public class P10001670 : RandomPortal
    {
        public P10001670()
        {
            Init(10001670, 31301000, 15, 62, 18, 62);
        }
    }
    //大厅到赌场


    public class P10001671 : Event
    {
        public P10001671()
        {
            this.EventID = 10001671;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 31304000, 47, 83);
            NPCHide(pc, 11001905);
            NPCShow(pc, 11001865);
            NPCShow(pc, 11001864);
            NPCShow(pc, 11001863);
            NPCShow(pc, 11001862);
            NPCShow(pc, 11001861);
            NPCShow(pc, 11001860);
            NPCShow(pc, 11001859);
            NPCShow(pc, 11001858);
            NPCShow(pc, 11001857);
            NPCShow(pc, 11001856);
            NPCShow(pc, 11001855);
            NPCShow(pc, 11001854);
            NPCShow(pc, 11001853);
            NPCShow(pc, 11001852);
            NPCShow(pc, 11001851);
            NPCShow(pc, 11001850);
            NPCShow(pc, 11001849);
            NPCShow(pc, 11001848);
        }
    }
    //大厅到ECO温泉入口

    public class P10001672 : RandomPortal
    {
        public P10001672()
        {
            Init(10001672, 31304000, 29, 69, 30, 70);
        }
    }
    //男更衣室到温泉入口

    public class P10001673 : RandomPortal
    {
        public P10001673()
        {
            Init(10001673, 31304000, 65, 71, 66, 72);
        }
    }
    //女更衣室到温泉入口

    public class P10001674 : RandomPortal
    {
        public P10001674()
        {
            Init(10001674, 31304000, 5, 44, 9, 49);
        }
    }
    //温泉入口到男更衣室

    public class P10001675 : RandomPortal
    {
        public P10001675()
        {
            Init(10001675, 31304000, 8, 15, 10, 17);
        }
    }
    //温泉到男更衣室
    public class P10001676 : Event
    {
        public P10001676()
        {
            this.EventID = 10001676;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 31304000, 86, 44);
            NPCHide(pc, 11001905);
            NPCShow(pc, 11001865);
            NPCShow(pc, 11001864);
            NPCShow(pc, 11001863);
            NPCShow(pc, 11001862);
            NPCShow(pc, 11001861);
            NPCShow(pc, 11001860);
            NPCShow(pc, 11001859);
            NPCShow(pc, 11001858);
            NPCShow(pc, 11001857);
            NPCShow(pc, 11001856);
            NPCShow(pc, 11001855);
            NPCShow(pc, 11001854);
            NPCShow(pc, 11001853);
            NPCShow(pc, 11001852);
            NPCShow(pc, 11001851);
            NPCShow(pc, 11001850);
            NPCShow(pc, 11001849);
            NPCShow(pc, 11001848);
        }
    }
    //温泉入口到女更衣室

    public class P10001677 : RandomPortal
    {
        public P10001677()
        {
            Init(10001677, 31304000, 85, 15, 86, 17);
        }
    }
    //温泉到女更衣室

    public class P10001678 : RandomPortal
    {
        public P10001678()
        {
            Init(10001678, 31303000, 15, 76, 17, 79);
        }
    }
    //男更衣室到ECO温泉

    public class P10001679 : RandomPortal
    {
        public P10001679()
        {
            Init(10001679, 31303000, 43, 76, 45, 77);
        }
    }
    //女更衣室到ECO温泉

    public class P10001680 : RandomPortal
    {
        public P10001680()
        {
            Init(10001680, 31303000, 47, 4, 49, 6);
        }
    }
    //沙滩到ECO温泉

    public class P10001681 : RandomPortal
    {
        public P10001681()
        {
            Init(10001681, 31302000, 27, 8, 30, 9);
        }
    }
    //赌场到市场

    public class P10001682 : RandomPortal
    {
        public P10001682()
        {
            Init(10001682, 31301000, 56, 31, 57, 35);
        }
    }
    //市场到赌场

    public class P10001683 : RandomPortal
    {
        public P10001683()
        {
            Init(10001683, 10071000, 65, 212, 65, 212);
        }
    }
    //从沙滩回泰迪岛



    //下面开始是深渊

    public class P10001686 : RandomPortal
    {
        public P10001686()
        {
            Init(10001686, 21193000, 125, 105, 129, 107);
        }
    }

    public class P10001687 : RandomPortal
    {
        public P10001687()
        {
            Init(10001687, 21193000, 125, 141, 130, 143);
        }
    }

    public class P10001688 : RandomPortal
    {
        public P10001688()
        {
            Init(10001688, 21193000, 94, 112, 97, 114);
        }
    }

    public class P10001689 : RandomPortal
    {
        public P10001689()
        {
            Init(10001689, 21193000, 157, 101, 158, 106);
        }
    }

    public class P10001690 : RandomPortal
    {
        public P10001690()
        {
            Init(10001690, 21193000, 61, 142, 63, 145);
        }
    }

    public class P10001691 : RandomPortal
    {
        public P10001691()
        {
            Init(10001691, 21193000, 69, 113, 74, 115);
        }
    }

    public class P10001692 : RandomPortal
    {
        public P10001692()
        {
            Init(10001692, 21193000, 125, 38, 129, 40);
        }
    }

    public class P10001693 : RandomPortal
    {
        public P10001693()
        {
            Init(10001693, 21193000, 78, 25, 79, 29);
        }
    }


    //下麵是測試

    public class P10001723 : Event
    {
        public P10001723()
        {
            this.EventID = 10001723;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 0, 0, "上にあるクジラの口まで$R;" +
            "ロープが伸びている…$R;" +
            "$R伝って登れば、$R;" +
            "クジラの口の中に入れそうだ。$R;", "");
            switch (Select(pc, "登る？", "", "登らない", "登ってみる"))
            {
                case 2:
                    Warp(pc, 21190000, 32, 184);
                    break;
            }

        }

    }

    public class P10001724 : RandomPortal
    {
        public P10001724()
        {
            Init(10001724, 11027000, 189, 197, 189, 197);
        }
    }

    public class P10001725 : RandomPortal
    {
        public P10001725()
        {
            Init(10001725, 21192000, 63, 63, 64, 64);
        }
    }

    public class P10001726 : RandomPortal
    {
        public P10001726()
        {
            Init(10001726, 21192000, 63, 63, 64, 64);
        }
    }

    public class P10001727 : RandomPortal
    {
        public P10001727()
        {
            Init(10001727, 21195000, 68, 68, 68, 68);
        }
    }

    public class P10001728 : RandomPortal
    {
        public P10001728()
        {
            Init(10001728, 21190000, 17, 122, 18, 124);
        }
    }

    public class P10001729 : RandomPortal
    {
        public P10001729()
        {
            Init(10001729, 21192000, 63, 63, 64, 64);
        }
    }

    public class P10001730 : RandomPortal
    {
        public P10001730()
        {
            Init(10001730, 21192000, 63, 63, 64, 64);
        }
    }

    public class P10001731 : RandomPortal
    {
        public P10001731()
        {
            Init(10001731, 21196000, 24, 24, 24, 24);
        }
    }

    public class P10001732 : RandomPortal
    {
        public P10001732()
        {
            Init(10001732, 21191000, 95, 106, 95, 106);
        }
    }

    public class P10001733 : RandomPortal
    {
        public P10001733()
        {
            Init(10001733, 21190000, 17, 122, 18, 124);
        }
    }

    public class P10001734 : RandomPortal
    {
        public P10001734()
        {
            Init(10001734, 20125001, 24, 24, 24, 24);
        }
    }

    public class P10001735 : Event
    {
        public P10001735()
        {
            this.EventID = 10001735;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 21193000, 127, 241);
            ShowEffect(pc, 10668, 4539);
            ShowEffect(pc, 10698, 4539);
        }
    }

    public class P10001736 : RandomPortal
    {
        public P10001736()
        {
            Init(10001736, 21190000, 17, 122, 18, 124);
        }
    }

    public class P10001695 : RandomPortal
    {
        public P10001695()
        {
            Init(10001695, 21194000, 3, 0, 4, 2);
        }
    }

    public class P10001696 : RandomPortal
    {
        public P10001696()
        {
            Init(10001696, 21193000, 132, 208, 135, 210);
        }
    }




    //進入遺跡
    public class P12001500 : Event
    {
        public P12001500()
        {
            this.EventID = 12001500;
        }

        public override void OnEvent(ActorPC pc)
        {


            if (GetPossibleDungeons(pc).Count == 0)
            {
                if (pc.Quest != null)
                {
                    if (pc.Quest.ID == 26500002 || pc.Quest.ID == 10032027 || pc.Quest.ID == 10032028 || pc.Quest.ID == 10032029)
                    {
                        Say(pc, 131, "您接的任務不能從這裡進入。$R;");
                        return;
                    }
                    if (pc.Quest.Detail.DungeonID != 0)
                    {
                        if (pc.Quest.Status == SagaDB.Quests.QuestStatus.OPEN)
                        {
                            switch (pc.MapID)
                            {
                                case 10066000:
                                    //阿伊恩市下層(10066000)
                                    CreateDungeon(pc, pc.Quest.Detail.DungeonID, 10066000, 79, 112);
                                    WarpToDungeon(pc);
                                    return;

                                case 20080012:
                                    //遺跡入口前廣場(20080012)
                                    CreateDungeon(pc, pc.Quest.Detail.DungeonID, 20080012, 22, 29);
                                    WarpToDungeon(pc);
                                    return;

                                case 20080013:
                                    //遺跡入口前廣場(20080013)
                                    CreateDungeon(pc, pc.Quest.Detail.DungeonID, 20080013, 22, 29);
                                    WarpToDungeon(pc);
                                    return;

                                case 20080014:
                                    //遺跡入口前廣場(20080014)
                                    CreateDungeon(pc, pc.Quest.Detail.DungeonID, 20080014, 22, 29);
                                    WarpToDungeon(pc);
                                    return;

                                case 30100000:
                                    //東軍本部長官室(30100000)
                                    CreateDungeon(pc, pc.Quest.Detail.DungeonID, 30100000, 8, 5);
                                    WarpToDungeon(pc);
                                    return;
                            }
                            CreateDungeon(pc, pc.Quest.Detail.DungeonID, 10023100, 247, 124);
                            WarpToDungeon(pc);
                        }
                        else
                        {
                            Say(pc, 131, "您不可以在這裡出入$R;" +
                                "請重新領取出入許可唷$R;");
                        }
                    }
                    else
                    {
                        Say(pc, 131, "傳送點沒有啟動$R;");
                    }
                }
                else
                {
                    Say(pc, 131, "您不可以在這裡出入$R;" +
                        "請重新領取出入許可唷$R;");
                }
            }
            else
            {
                WarpToDungeon(pc);
            }
        }
    }

    //起点: 谜团北部 
    //终点: 谜团本部
    //黄金桥（12019000） TO 西部要塞(12021000)
    public class P10001623 : Event
    {
        public P10001623()
        {
            this.EventID = 10001623;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (ODWarIsDefence(12021001) == false)
            {
                Warp(pc, 12021001, 182, 128);
                return;
            }

            if (ODWarIsDefence(12021001) == true)
            {
                Say(pc, 0, 0, "現在、ウェストフォートシティでは$R;" +
                "「防衛戦」が行われているため$R;" +
                "街の中へ入ることが出来ません。$R;" +
                "$R「羅城門」への抜け道を$R;" +
                "使用しますか？$R;", "");
                if (Select(pc, "「羅城門」へ移動する？", "", "いいえ", "はい") == 2)
                {
                    NPCShow(pc, 11001698);//让NPC出现
                    Warp(pc, 32003001, 20, 81);
                    return;
                }
            }



            Warp(pc, 12021000, 182, 128);
        }
    }

    public class P10001635 : Event
    {
        public P10001635()
        {
            this.EventID = 10001635;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 32053000, 3, 6);
        }
    }

    public class P10001637 : Event
    {
        public P10001637()
        {
            this.EventID = 10001637;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12021000, 62, 131);
        }
    }

    public class P10001656 : Event
    {
        public P10001656()
        {
            this.EventID = 10001656;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (ODWarIsDefence(12021001) == true)
            {
                if (ODWarCanApply(12021001))
                {
                    NPCMotion(pc, 11001722, 131);

                    Say(pc, 0, 0, "防衛戦中は勝つか負けるか……$R;" +
                    "または貴殿が倒れるまで$R;" +
                    "こちらへ戻ってくることは$R;" +
                    "出来ないぞ。$R;" +
                    "$Rそれでも行くか？$R;", "羅城門門兵");
                    switch (Select(pc, "準備はいいか？", "", "やめる", "先へ進む", "防衛方法を確認したい"))
                    {
                        case 2:
                            NPCMotion(pc, 11001722, 131);

                            Say(pc, 0, 0, "貴殿の武運を祈る！$R;", "羅城門門兵");
                            Warp(pc, 12021001, 11, 127);
                            return;
                        case 3:
                            NPCMotion(pc, 11001722, 131);

                            Say(pc, 0, 0, "分からないことがあれば$R;" +
                            "なんでも聞いてくれ。$R;", "羅城門門兵");
                            switch (Select(pc, "防衛方法の確認", "", "もういい", "街を防衛するには？", "壊れたシンボルの起動方法", "シンボルの回復方法", "シンボルはどこにあるの？", "注意点"))
                            {
                                case 2:
                                    Say(pc, 0, 0, "ウェストフォートに点在する$R;" +
                                    "シンボルを 45 分間$R;" +
                                    "1つでも守り抜くことが出来れば$R;" +
                                    "我々の勝利となる！$R;" +
                                    "$Rなぜ、45分なのかって？$R;" +
                                    "$P詳しい話は知らんが$R;" +
                                    "普段からこの街はバリアのような物に$R;" +
                                    "守られているそうだ。$R;" +
                                    "$R今まではそのバリアのおかげもあり$R;" +
                                    "敵が易々と街へ攻撃仕掛けることも$R;" +
                                    "出来なかったわけだが$R;" +
                                    "チャンプモンスターの出現が$R;" +
                                    "その事情が大きく変えたのだ。$R;" +
                                    "$P奴らの持つチャンプ能力が$R;" +
                                    "このバリアを中和し破壊活動を$R;" +
                                    "可能にしたのだよ。$R;" +
                                    "$Rその活動時間が丁度 45分間。$R;" +
                                    "つまり、敵の限界活動時間$R;" +
                                    "ぎりぎりまで、シンボルを$R;" +
                                    "守り抜くことが出来れば$R;" +
                                    "自然と我々の勝利になるというわけだ。$R;", "羅城門門兵");
                                    break;
                                case 3:
                                    Say(pc, 0, 0, "この街の各所に点在している$R;" +
                                    "「シンボル発生装置」を調べて$R;" +
                                    "「装置を起動する」を選択すると$R;" +
                                    "シンボルは展開するのだが$R;" +
                                    "ここで一つ気をつけなければ$R;" +
                                    "ならないことがある。$R;" +
                                    "$Pシンボルが展開される場所に$R;" +
                                    "障害物があるとシンボル上手く$R;" +
                                    "展開することが出来ない。$R;" +
                                    "$Rつまり、先にその障害物を$R;" +
                                    "除去する必要がある。$R;" +
                                    "$Rよく覚えておくといい。$R;", "羅城門門兵");
                                    break;
                                case 4:
                                    NPCMotion(pc, 11001722, 131);

                                    Say(pc, 0, 0, "シンボルを回復させるには$R;" +
                                    "スキル「シンボル修復」が必要になる。$R;" +
                                    "$Rこれは誰にでも扱えるスキルだが$R;" +
                                    "特にバックパッカー系が上手く$R;" +
                                    "扱う事ができるスキルだ。$R;" +
                                    "$P街へ入ったら$R;" +
                                    "一度試してみるといい。$R;", "羅城門門兵");

                                    break;
                                case 5:
                                    Say(pc, 0, 0, "シンボルの場所は$R;" +
                                    "「ＭＡＰ」上にに表示される$R;" +
                                    "赤い目印、「シンボル発生装置」の$R;" +
                                    "すぐ側に展開している。$R;" +
                                    "$Pさらに赤い目印に$R;" +
                                    "マウスカーソルを合わせることで$R;" +
                                    "近くにあるシンボルの名前が$R;" +
                                    "マップ上に表示されるからな。$R;" +
                                    "$Rここでは試せないが……$R;" +
                                    "まぁ、実際に試してみるといいだろう。$R;", "羅城門門兵");
                                    break;
                                case 6:

                                    break;
                            }
                            break;
                    }
                    return;
                }
            }
            Warp(pc, 12021000, 9, 127);
        }
    }

    public class P10001658 : Event
    {
        public P10001658()
        {
            this.EventID = 10001658;
        }

        public override void OnEvent(ActorPC pc)
        {
            NPCShow(pc, 11001698);//让NPC出现
            Warp(pc, 32003001, 19, 81);
        }
    }

    public class P10001622 : Event
    {
        public P10001622()
        {
            this.EventID = 10001622;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12019000, 3, 80);
        }
    }
    

    public class P10001608 : Event
    {
        public P10001608()
        {
            this.EventID = 10001608;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12035000, 246, 2);
        }
    }

    public class P10001609 : Event
    {
        public P10001609()
        {
            this.EventID = 10001609;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12035001, 246, 2);
        }
    }

    public class P10001610 : Event
    {
        public P10001610()
        {
            this.EventID = 10001610;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12028000, 1, 245);
        }
    }

    public class P10001611 : Event
    {
        public P10001611()
        {
            this.EventID = 10001611;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12028001, 1, 245);
        }
    }

    public class P10001612 : Event
    {
        public P10001612()
        {
            this.EventID = 10001612;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12020000, 41, 245);
        }
    }

    public class P10001613 : Event
    {
        public P10001613()
        {
            this.EventID = 10001613;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12020001, 41, 245);
        }
    }

    public class P10001602 : Event
    {
        public P10001602()
        {
            this.EventID = 10001602;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12028000, 42, 1);
        }
    }

    public class P10001615 : Event
    {
        public P10001615()
        {
            this.EventID = 10001615;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12028001, 42, 1);
        }
    }

    public class P10001616 : Event
    {
        public P10001616()
        {
            this.EventID = 10001616;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12019000, 255, 168);
        }
    }

    public class P10001617 : Event
    {
        public P10001617()
        {
            this.EventID = 10001617;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12019001, 255, 168);
        }
    }

    public class P10001618 : Event
    {
        public P10001618()
        {
            this.EventID = 10001618;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12020000, 1, 168);
        }
    }

    public class P10001619 : Event
    {
        public P10001619()
        {
            this.EventID = 10001619;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12020001, 1, 168);
        }
    }

    public class P10001632 : Event
    {
        public P10001632()
        {
            this.EventID = 10001632;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12022000, 1, 159);
        }
    }

    public class P10001633 : Event
    {
        public P10001633()
        {
            this.EventID = 10001633;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 12020000, 255, 159);
        }
    }


    public class P12001090 : Event
    {
        public P12001090()
        {
            this.EventID = 12001090;
        }

        public override void OnEvent(ActorPC pc)
        {
            ShowEffect(pc, 4539);
            Say(pc, 0, 131, "是陷阱！！$R;");
            Warp(pc, 20091000, 187, 225);
        }
    }

    //カードラボ(30166000)>下城
    public class P10001759 : Event
    {
        public P10001759()
        {
            this.EventID = 10001759;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 10024000, 50, 150);
        }
    }

    public class P10001793 : Event
    {
        public P10001793()
        {
            this.EventID = 10001793;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 10024000, 158, 157);
            DeleteMapInstance(pc.CInt["DEM_Customize_Map"]);
        }
    }

    public class P10002122 : Event
    {
        public P10002122()
        {
            this.EventID = 10002122;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 50208000, 3, 137);
        }
    }

    public class P10002125 : Event
    {
        public P10002125()
        {
            this.EventID = 10002125;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 10005000, 252, 135);
        }
    }

    public class P10002126 : Event
    {
        public P10002126()
        {
            this.EventID = 10002126;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 10005000, 7, 252);
        }
    }

    public class P10002127 : Event
    {
        public P10002127()
        {
            this.EventID = 10002127;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 10020000, 7, 3);
        }
    }
}