using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M30095000
{
    public class S11000855 : Event
    {
        public S11000855()
        {
            this.EventID = 11000855;

        }

        public override void OnEvent(ActorPC pc)
        {
            /*
            if (_6a69)
            {
                Say(pc, 131, "幸虧有您，會是一段好新聞唷$R;");
                return;
            }
            if (CountItem(pc, 10020002) > 0)
            {
                _6a69 = true;
                Say(pc, 131, "等著您了！$R;" +
                    "$P讓我看看…$R;" +
                    "$P嗯…$R;" +
                    "$P還是那樣…$R;" +
                    "$P這是迪澳曼特賄賂恩德議員的發票！$R;" +
                    "$R哦…沒錯，是恩德議員的簽字呀$R;" +
                    "$P真…真了不起！$R;" +
                    "$R原來恩德議員和迪澳曼特$R;" +
                    "真的有關係的阿！$R;" +
                    "$P還說沒見過呢！$R;" +
                    "好！一定要把這個告訴國民！$R;" +
                    "$R該趕快整理新聞了$R;" +
                    "$P太感謝您啦！$R;" +
                    "東西雖然小，但是我的心意$R;" +
                    "$R希望您收下！$R;");
                TakeItem(pc, 10020002, 1);
                pc.Gold += 5000;
                Say(pc, 131, "得到5000金幣$R;");

                Say(pc, 131, "幸虧有您，會是一段好新聞唷$R;");
                return;
            }
            if (_6a71)
            {
                Say(pc, 131, "我朋友在戰士行會分會做事，$R;" +
                    "$R您跟他說，是我委託的$R;" +
                    "他一定會幫您的…那麼，拜託了！$R;");
                return;
            }
            if (_6a70)
            {
                Say(pc, 131, "怎麼聽不明白呢，真是的…$R;");
                Wait(pc, 1000);
                Say(pc, 131, "哦？您是？$R;" +
                    "$R哦…看樣子是冒險者呀$R;" +
                    "嗯～嗯$R;" +
                    "$P正好！$R;" +
                    "拜託您一件事情好嗎？$R;");
                switch (Select(pc, "想不想幫忙呢？", "", "不想？", "知道了…什麼事情啊？"))
                {
                    case 1:
                        break;
                    case 2:
                        Say(pc, 131, "我是摩根新聞記者，叫芝奇$R;" +
                            "為了揭露關於大富豪迪澳曼特的$R不正當行為，$R;" +
                            "現在採集取料$R;" +
                            "$R採訪有關人員，$R;" +
                            "不過不太順利…$R;" +
                            "$P委託朋友暗殺者進行潛入調查，$R;" +
                            "不知進行的怎麼樣了，$R;" +
                            "$R能不能幫我查一下呢？$R;");
                        Select(pc, "怎麼辦呢?", "", "有點懷疑??", "……");
                        Say(pc, 131, "迪澳曼特透過不正當的手段，$R;" +
                            "正在獨享摩根百姓的財富呀。$R;" +
                            "$R我得想盡辦法阻止他阿，$R;" +
                            "我想把摩根建設成更富有的國家呢$R;" +
                            "$P可別小看我，我很有眼光的。$R;" +
                            "$R看您很有正義感$R;" +
                            "重要的是看起來您的心腸很好唷！$R;" +
                            "$P嗯…$R;" +
                            "能不能接受一個請求呢？$R;");
                        switch (Select(pc, "怎麼辦呢?", "", "危險的事情我不做！", "知道了！"))
                        {
                            case 1:
                                break;
                            case 2:
                                _6a71 = true;
                                Say(pc, 131, "謝謝您$R;" +
                                    "我朋友在戰士行會分會做事，$R;" +
                                    "$R只要您跟他說，是我委託的$R;" +
                                    "他一定會幫您的…那麼，拜託了！$R;");
                                break;
                        }
                        break;
                }
                return;
            }
            */

            //_6a70 = true;

            Say(pc, 131, "想邀请其他议员$R;" +
                "接受采访…$R;");
            Say(pc, 11000854, 131, "采访什么？$R;");
            Say(pc, 131, "想跟迪奥曼特密切联系…哦…不对$R;" +
                "$R哈哈…其实是想问一下$R;" +
                "关於摩戈炭的出口量啦$R;");
            Say(pc, 11000854, 131, "其他议员是非常忙的人$R;" +
                "$R没有预约是不能见面的$R;");
            Say(pc, 131, "提前预约？$R;" +
                "那样的话该怎么做？$R;");
            Say(pc, 11000854, 131, "先跟秘书联络$R;" +
                "秘书会安排的。$R;" +
                "然后再通知您$R;" +
                "请您把联系方式写在这里…$R;");
            Say(pc, 11000854, 131, "哎呀…太麻烦了！$R;" +
                "跟您没法儿说！！$R;" +
                "$R算了！联络倒没有必要！$R;" +
                "还是在这里等到$R;" +
                "其他议员回来吧！！$R;");
        }
    }
}