using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaDB.Item;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M10062000
{
    public class S11001065 : Event
    {
        public S11001065()
        {
            this.EventID = 11001065;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Tangka> Tangka_mask = pc.CMask["Tangka"];
            NavigateCancel(pc);
            if (!Tangka_mask.Test(Tangka.嚮導機械人第一次對話))
            {
                Say(pc, 131, "欢迎到工作室城市唐卡$R;" +
                    "我是向导系统$R;" +
                    "$P唐卡市是一个$R;" +
                    "活动木偶和飞空庭为代表的城市$R;" +
                    "$R有很多珍贵的活动木偶或$R;" +
                    "改造飞空庭的研究工作室。$R;" +
                    "$P愿意的话，我会简单说明的。$R;" +
                    "怎么办呢？$R;");
                switch (Select(pc, "怎么办呢？", "", "请说明", "不用了"))
                {
                    case 1:
                        Tangka_mask.SetValue(Tangka.嚮導機械人第一次對話, true);
                        //_7a47 = true;
                        Say(pc, 131, "那么，开始说明吧！$R;" +
                            "$P从这里看到的东边砖瓦建筑$R;" +
                            "就是活动木偶研究设施。$R;" +
                            "$R活动木偶总部和$R;" +
                            "叫『多尔斯』的唐卡军队$R;" +
                            "正共同研究活动木偶。$R;" +
                            "$P这里研究的是关于$R;" +
                            "活动木偶的存在理由和状态，$R;" +
                            "$R对大部分人来说都是挺闷的内容。$R;");
                        Say(pc, 131, "想要活动木偶时，$R;" +
                            "$R请到『个人工作室』看看吧。$R;" +
                            "$P看见西边的圆柱型建筑了吗？$R;" +
                            "那就是『个人工作室』哦。$R;" +
                            "$R这里是任何人都可以自由进出的$R;" +
                            "经济特区所以聚集了很多工匠。$R;" +
                            "$P其中有实力的工匠，$R都拥有个人工作室。$R;" +
                            "$R到那里也许能拿到活动木偶唷。$R;");
                        Say(pc, 131, "沿着个人工作室的工匠街往西走，$R;" +
                            "那里有个很大的飞空庭工厂哦。$R;" +
                            "$P那里可以提供各种$R关于飞空庭的服务，$R由组装到改造，一应俱全$R;" +
                            "$R如果对拥有的飞空庭不满的话$R请去看看吧。$R;" +
                            "$P有一点要注意，需要很多那个……$R;" +
                            "那个…钱…$R;" +
                            "$R我当然没有那么多钱，$R只靠微薄的工资维持生活，$R;" +
                            "$R我已知足了…哈哈哈$R;");
                        Say(pc, 131, "在工匠街的交叉路向北看，$R可以看到机械神匠总部。$R;" +
                            "$R双脚步行机器人停在街上，$R;" +
                            "马上会知道的。$R;" +
                            "$P这个世界的大部分机件都是在$R这总部制作的。$R;" +
                            "$R其实我也是这里人…$R;" +
                            "夸奖自己，有点不好意思，$R;" +
                            "$R但这里的技术确实是世界顶级的。$R;" +
                            "其实跟别的地方，没法相比。$R;" +
                            "$P只是没有投资者认可技术能力，$R所以…$R;" +
                            "$R机械神匠行会一直很穷，$R;" +
                            "所以能不能捐款…$R;");
                        Say(pc, 131, "到工匠街交叉路南边的山丘，$R有住宅街和商店街。$R;" +
                            "$P虽然说是商店街，$R但是来的都是这里的居民，$R;" +
                            "所以不知道有没有从远方来的人$R喜欢的东西呀。$R;");
                        Say(pc, 131, "还有山丘上有巨大的皮诺像的公园。$R;" +
                            "$R对了，这里也能看到。$R;" +
                            "$P也是这条街的地标。$R;" +
                            "对地摊、商人、复活战士来说$R挺繁华的街道。$R;" +
                            "$R去看看吧，$R;" +
                            "$P我推荐您一件好东西吧。$R;" +
                            "听说那个皮诺像有秘密按扭。$R;" +
                            "$P那么，剩下的，$R您自己去看看吧。$R;" +
                            "都告诉了您就没意思了。$R;" +
                            "$P哎呀，说得够长了。$R;" +
                            "谢谢您的聆听。$R;" +
                            "$R那么祝您旅途愉快。$R;" +
                            "$R再见了喔$R;");
                        break;
                    case 2:
                        break;
                }
                return;
            }
            switch (Select(pc, "想让我介绍哪里，请选择。", "", "机场", "活动木偶总部", "多尔斯军本部", "活动木偶研究所", "机械神匠总部", "飞空庭大工厂", "唐卡大厦", "商店街", "放弃"))
            {
                case 1:
                    Say(pc, 131, "机场就在后面不用带路吧？$R;" +
                        "$R在机场可以搭乘去艾恩萨乌斯的$R飞空庭。$R;" +
                        "$P乘一次100金币，不过那里的$R哈尔列尔利小子怕小狗…$R;" +
                        "如果带着狗去…$R;" +
                        "嗯，就当没听见好吗。$R;");
                    break;
                case 2:
                    Navigate(pc, 180, 146);
                    Say(pc, 131, "活动木偶总部就是在东边的$R那座砖瓦房。$R;" +
                        "$R用箭头指示，带您到入口吧。$R;" +
                        "$P那里有贩卖石像产品目录$R;" +
                        "并提供石像制作、$R;" +
                        "发布石像产品目录、$R;" +
                        "设计魔物外型等服务$R;" +
                        "$P总部代表原来是很温和亲切的人，$R;" +
                        "不过最近脸色不太好…$R;" +
                        "$R真担心哪里不舒服$R;");
                    break;
                case 3:
                    Navigate(pc, 173, 121);
                    Say(pc, 131, "多尔斯军本部就是$R东边看到的砖瓦房。$R;" +
                        "$P多尔斯军，是由人偶师军队编成的$R;" +
                        "唐卡防卫军。$R;" +
                        "$R人员少，大部分都是活动木偶。$R;" +
                        "$P叫耶尔德活动木偶的$R特殊活动木偶，$R;" +
                        "听说可以操纵几十…$R不，有时候几百个活动木偶，$R;" +
                        "进行战斗呢。$R;" +
                        "$P是很特殊的部队，所以不接受佣兵。$R;" +
                        "$R现在只是给您带路，$R不过去了也会被赶出来的。$R;");
                    break;
                case 4:
                    Navigate(pc, 210, 100);
                    Say(pc, 131, "从这里看到的东边的砖瓦建筑就是$R;" +
                        "活动木偶研究设施。$R;" +
                        "$R活动木偶研究设施分为$R第1研究所和第2研究所。$R;" +
                        "$P第1研究所研究关于$R得到活动木偶的方法$R;" +
                        "和特性。$R;" +
                        "$R如果您有使用活动木偶，不妨听听？$R;" +
                        "$R也许能听到有用的消息。$R;" +
                        "$P第2研究所就在第1研究所的旁边。$R;" +
                        "但一切都是军事机密，$R;" +
                        "$R入口的哈尔列尔利不会让闲人进去的。$R;" +
                        "$P这是我的想法，$R;" +
                        "那个哈尔列尔利很奇怪。$R;" +
                        "$R说它害怕呢，还是说它冷淡呢。$R;" +
                        "真不敢相信是像我一样的活动木偶$R;" +
                        "$R先躲避为上策。$R;" +
                        "$P那么，先带您到第1研究所吧。$R;");
                    break;
                case 5:
                    Navigate(pc, 132, 27);
                    Say(pc, 131, "从这里看到西北边的$R那栋蓝色混凝土建筑就是$R;" +
                        "机械神匠总部。$R;" +
                        "$R用箭头指示，带您到入口吧。$R;" +
                        "$P这村子里的警备机器人或$R阿克罗波利斯的$R;" +
                        "向导系统，都是在总部制作的喔。$R;" +
                        "$P我在向导系统里是较高级的，$R;" +
                        "与一般的向导系统比起来$R;" +
                        "语言功能更接近人类。$R;" +
                        "$P没有拒否感，但因为太吵，$R常常被骂。$R;" +
                        "$R哎呀，我还是别说废话，快带路吧。$R;" +
                        "$R对不起$R;");
                    break;
                case 6:
                    Navigate(pc, 73, 70);
                    Say(pc, 131, "飞空庭工厂在这里的西北部。$R;" +
                        "$R是衣做非常大的大工厂，$R;" +
                        "用箭头指示，带您到处看看吧$R;" +
                        "$P飞空庭组装$R;" +
                        "家具销售$R;" +
                        "木材加工等都可以做。$R;" +
                        "$P嗯…只要有那个(钱)，$R这里是一个令您$R非常愉快的地方。$R;");
                    break;
                case 7:
                    Navigate(pc, 93, 151);
                    Say(pc, 131, "唐卡大厅在这里的西南部喔$R;" +
                        "$R用箭头指示，带您到入口吧。$R;" +
                        "$P虽然有市长在，但这里的$R;" +
                        "行会力量太强大，$R没有什么可做的事情。$R;" +
                        "$P常常可以看到他，换换街灯的灯泡、$R;" +
                        "跟老人在一起、$R;" +
                        "在公园看着孩子们玩耍的情形。$R;" +
                        "$P对了。$R;" +
                        "$R在进行清洁计划$R;" +
                        "请一定要去看看。$R;");
                    break;
                case 8:
                    Navigate(pc, 72, 161);
                    Say(pc, 131, "商店街在南边哦。$R;" +
                        "$R用箭头指示，$R带您到商店街入口吧。$R;" +
                        "$P有裁缝店$R;" +
                        "武器店$R;" +
                        "古董商$R;" +
                        "酒馆等，居民们使用的店$R;" +
                        "$P虽然有点远$R;" +
                        "$R附近还有商店和宝石商喔$R;");
                    break;
                case 9:
                    break;
            }
        }
    }
}