using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaDB.Item;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript.M50014000
{
    public class S11001221 : Event
    {
        public S11001221()
        {
            this.EventID = 11001221;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Neko_05> Neko_05_amask = pc.AMask["Neko_05"];
            BitMask<Neko_05> Neko_05_cmask = pc.CMask["Neko_05"];
            if (Neko_05_amask.Test(Neko_05.茜子任务开始) &&
                Neko_05_cmask.Test(Neko_05.向瑪莎詢問飛空庭引擎的相關情報) &&
                !Neko_05_cmask.Test(Neko_05.了解玛莎和埃米尔的关系))
            {
                Neko_05_cmask.SetValue(Neko_05.了解玛莎和埃米尔的关系, true);
                Say(pc, 11001221, 131, "埃米爾冰，你有飛空庭嗎?$R;");
                Say(pc, 11001227, 131, "現在沒有！$R;" +
                    "$R雖然以前可能有$R;");
                Say(pc, 11001221, 131, "???$R;");
                Say(pc, 11001227, 131, "其實是…我…記不起以前的事了$R;" +
                    "$R從我受到重傷的時候開始，$R我的記憶就喪失了…$R;" +
                    "$R在我復原之前，一直都是瑪莎照顧著我的…$R;");
                Say(pc, 11001221, 131, "這樣啊，我想一定很累吧！$R;");
                Say(pc, 11001227, 131, "啊！但是最近慢慢……$R;" +
                    "$P一直保護著我的…溫柔的…白色翅膀$R;" +
                    "$R閃耀的金色長髮…$R;" +
                    "$R慈祥但帶點憂鬱的眼睛…$R;" +
                    "$P那孩子到底是誰呢…$R;" +
                    "$R總是看著我，流露出一絲絲微笑…$R;");
                Say(pc, 11001226, 131, "……$R;" +
                    "$P別急著…想起以前的事情喔！$R;");
                Say(pc, 11001227, 131, "為什麼?$R;");
                Say(pc, 11001226, 131, "因為！！$R;");
                if (CountItem(pc, 10017900) >= 1 && CountItem(pc, 10017903) >= 1 && CountItem(pc, 10017905) >= 1)
                {
                    Say(pc, 0, 131, "……$R;" +
                        "$R是三角關係嗎?$R;", "凱堤（桃）");
                    对话1(pc);
                    return;
                }
                if (CountItem(pc, 10017900) >= 1 && CountItem(pc, 10017903) >= 1)
                {
                    Say(pc, 0, 131, "…$R;" +
                        "$R是三角關係嗎?$R;", "凱堤（桃）");
                    Say(pc, 0, 131, "埃米爾記憶中的女性一定是塔妮亞！$R這是命運中註定的愛情！$R;" +
                        "$R哇喔！太浪漫了！！$R;" +
                        "$P如果埃米爾找回記憶會選擇哪一邊呢?$R;", "凱堤(雜梅)");
                    Say(pc, 0, 131, "會不會…是瑪莎啊?$R;" +
                        "$R她一直陪伴在埃米爾身邊$R;", "凱堤（桃）");
                    if (CountItem(pc, 10017906) == 0)
                    {
                        return;
                    }
                    Say(pc, 0, 131, "我不這麼想！$R因為這是神安排的愛情考驗！$R;" +
                        "$R埃米爾會根據記憶選擇塔妮亞女生的$R;" +
                        "$P菫姐姐，你也這麼想嗎?$R;", "凱堤(雜梅)");
                    Say(pc, 0, 131, "好了…大家都不要說別人了$R;", "凱堤(菫)");
                    Say(pc, 0, 131, "哦……$R;", "凱堤（桃）");
                    对话2(pc);
                    return;
                }
                if (CountItem(pc, 10017900) >= 1 && CountItem(pc, 10017905) >= 1)
                {
                    Say(pc, 0, 131, "……$R;" +
                        "$R好像是三角關係吧?$R;" +
                        "$R埃米爾記得的女生好像是塔妮亞啊?$R;", "凱堤（桃）");
                    Say(pc, 0, 131, "$P如果埃米爾找到記憶$R會選擇哪一邊呢?$R;", "凱堤(山吹)");
                    Say(pc, 0, 131, "會不會…是瑪莎啊?$R;" +
                        "$R她一直陪伴在埃米爾身邊$R;", "凱堤（桃）");
                    Say(pc, 0, 131, "我也這麼想，應該是瑪莎吧！$R;" +
                        "$R胸也夠大啊$R;", "凱堤(山吹)");
                    if (CountItem(pc, 10017906) == 0)
                    {
                        Say(pc, 0, 131, "真的嗎！！?山吹…！$R;" +
                            "$R胸大就可以了嘛！！$R;", "凱堤（桃）");
                        对话2(pc);
                        return;
                    }
                    Say(pc, 0, 131, "真是的！！$R才不會…因為…這個…做選擇(臉紅)$R;" +
                        "$R絕對不會因為胸大才受喜愛的！！！$R;", "凱堤(菫)");
                    Say(pc, 0, 131, "呵…$R;" +
                        "$R菫姐姐…為什麼突然…那麼激動啊?$R;", "凱堤(山吹)");
                    Say(pc, 0, 131, "啊…那個…哈哈$R;" +
                        "$R來來！不要做無謂的討論了！$R;", "凱堤(菫)");
                    Say(pc, 0, 131, "哦……$R;", "凱堤（桃）(山吹)");
                    对话2(pc);
                    return;
                }
                if (CountItem(pc, 10017903) >= 1 && CountItem(pc, 10017905) >= 1)
                {
                    Say(pc, 0, 131, "……$R;" +
                        "$R是三角關係嗎?$R;", "凱堤(山吹)");
                    对话1(pc);
                    return;
                }
                if (CountItem(pc, 10017900) >= 1)
                {
                    Say(pc, 0, 131, "……$R;" +
                        "$R這裡好像有三角關係！$R茜也這麼想吧?$R;", "凱堤（桃）");
                    Say(pc, 0, 131, "跟我沒關係！$R;", "凱堤(茜)");
                    Say(pc, 0, 131, "那倒是，但是…$R;", "凱堤（桃）");
                    对话2(pc);
                    return;
                }
                if (CountItem(pc, 10017903) >= 1)
                {
                    Say(pc, 0, 131, "……$R;" +
                        "埃米爾記憶中的女性一定是塔妮亞！$R這是命運中註定的愛情！$R;" +
                        "$R哇喔！太浪漫了！！$R;", "凱堤(雜梅)");
                    Say(pc, 0, 131, "雜梅姐姐一點都沒變喔$R還是有這麼豐富的想像力…哈哈…$R;", "凱堤(茜)");
                    对话2(pc);
                    return;
                }
                if (CountItem(pc, 10017905) >= 1)
                {
                    Say(pc, 0, 131, "……$R;" +
                        "$R是三角關係嗎?$R;", "凱堤(山吹)");
                    Say(pc, 0, 131, "跟我沒關係！$R;", "凱堤(茜)");
                    Say(pc, 0, 131, "那倒是！$R三角關係又不能掙錢$R;", "凱堤(山吹)");
                    对话2(pc);
                    return;
                }
                if (CountItem(pc, 10017906) >= 1)
                {
                    Say(pc, 0, 131, "……$R;" +
                        "$R(難道是三角關係?)$R;", "凱堤(菫)");
                    Say(pc, 0, 131, "……$R;" +
                        "$R(三角關係??)$R;", "凱堤(茜)");
                    return;
                }
                if (CountItem(pc, 10017902) >= 1)
                {
                    Say(pc, 0, 131, "……$R;" +
                        "$R三角關係…$R;", "凱堤(緑)");
                    Say(pc, 0, 131, "我不可能跟哈爾列爾利有關係的！$R;", "凱堤(茜)");
                    Say(pc, 0, 131, "跟主人也…不會有關係的！$R;" +
                        "$R只有我…什麼都不是…唉$R;", "凱堤(緑)");
                    return;
                }
                return;
            }
            Say(pc, 11001221, 131, "這個就是瑪莎的…冰之飛空庭！$R;" +
                "$R真的是很漂亮的飛空庭啊♪$R;");
            Say(pc, 11001226, 131, "冰是……$R;");
            Say(pc, 0, 131, "……$R;" +
                "$P給叫成「客人」不是好很多嗎……$R;");
        }

        void 对话1(ActorPC pc)
        {
            Say(pc, 0, 131, "埃米爾記憶中的女性一定是塔妮亞！$R這是命運中註定的愛情！$R;" +
                "$R哇喔！太浪漫了！！$R;" +
                "$P如果埃米爾找回記憶會選擇哪一邊呢?$R;", "凱堤(雜梅)");
            Say(pc, 0, 131, "我覺得會選擇這個女孩！$R;", "凱堤(山吹)");
            Say(pc, 0, 131, "聽我說！$R這是神安排的愛情考驗！$R;" +
                "$R埃米爾會根據記憶選擇塔妮亞女生的$R;", "凱堤(雜梅)");
            if (CountItem(pc, 10017906) == 0)
            {
                Say(pc, 0, 131, "不是啊！$R;" +
                    "$R因為這女生，胸又大，錢又多喔！$R;", "凱堤(山吹)");
                if (CountItem(pc, 10017900) >= 1)
                {
                    Say(pc, 0, 131, "真的嗎！！?山吹…！$R;" +
                        "$R胸大就可以了嘛！！$R;", "凱堤（桃）");
                }
                对话2(pc);
                return;
            }
            Say(pc, 0, 131, "不是這樣的！$R;" +
                "$R這女生的不是很富有嗎！$R不是嗎?雜梅姐姐?$R;", "凱堤(山吹)");
            Say(pc, 0, 131, "當然！經濟條件確實也很重要…$R;", "凱堤(菫)");
            Say(pc, 0, 131, "對吧?所以我想會選擇這邊的！$R;" +
                "$R而且胸也夠大吧！$R;", "凱堤(山吹)");
            Say(pc, 0, 131, "真是的！！$R才不會…因為…這個…做選擇(臉紅)$R;" +
                "$R絕對不會因為胸大才受喜愛的！！！$R;", "凱堤(菫)");
            Say(pc, 0, 131, "呵…$R;" +
                "$R菫姐姐…為什麼突然…那麼激動啊?$R;", "凱堤(山吹)");
            if (CountItem(pc, 10017902) >= 1)
            {
                Say(pc, 0, 131, "……$R;", "凱堤(緑)");
                Say(pc, 0, 131, "緑姐姐怎麼什麼都不說?$R;" +
                    "$R難道緑姐姐也覺得…$R埃米爾會選擇這個人?$R;", "凱堤(山吹)");
                Say(pc, 0, 131, "真是的！！$R埃米爾一定會選擇塔妮亞女生！$R;" +
                    "$R緑姐姐，你也這麼想的吧?$R;", "凱堤(雜梅)");
                Say(pc, 0, 131, "……$R;" +
                    "$P是啊…真的要選擇的話…還是兩位都?$R;", "凱堤(緑)");
                Say(pc, 0, 131, "……$R;", "凱堤(除了緑以外，全都)");
                if (CountItem(pc, 10017900) == 0)
                {
                    return;
                }
                Say(pc, 0, 131, "嗯……$R;" +
                    "$R好了好了！到此為止吧！$R;" +
                    "$R嗯…?蘋果是怎麼了?$R;", "凱堤(菫)");
                Say(pc, 0, 131, "姐姐…我…肚子疼…$R;", "凱堤（桃）");
                return;
            }
            Say(pc, 0, 131, "啊…那個…哈哈$R;" +
                "$R來來！不要做無謂的討論了！$R;", "凱堤(菫)"); 
        }

        void 对话2(ActorPC pc)
        {
            if (CountItem(pc, 10017902) >= 1)
            {
                if (CountItem(pc, 10017905) >= 1)
                {
                    Say(pc, 0, 131, "埃米爾他…找到記憶後會選擇誰啊?$R;" +
                        "$R緑姐姐，你也那麼想的吧?$R;", "凱堤(山吹)");
                }
                else if (CountItem(pc, 10017903) >= 1)
                {
                    Say(pc, 0, 131, "姐姐…緑姐姐！$R;" +
                        "$R埃米爾他…找到記憶後會選擇誰啊?$R;", "凱堤(雜梅)");
                }
                else if (CountItem(pc, 10017900) >= 1)
                {
                    Say(pc, 0, 131, "埃米爾他…找到記憶後會去哪邊呢…$R;" +
                        "$R緑姐姐，你怎麼想啊?$R;", "凱堤（桃）");
                }
                Say(pc, 0, 131, "……$R;" +
                    "$P是啊…選擇的話…會不會兩個都?$R;", "凱堤(緑)");
                Say(pc, 0, 131, "……$R;", "凱堤(緑以外，全都)");
                return;
            } 
        }
    }
}