
using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaDB.Item;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
using WeeklyExploration;
using System.Globalization;
namespace SagaScript.M30210000
{
    public class S80000613 : Event
    {
        public S80000613()
        {
            this.EventID = 80000613;
        }
        void 接受斥候转职(ActorPC pc)
        {
            Say(pc, 141, "太好了！我就知道你会答应的！$R毕竟，只要是冒险者，看到这样的谜题摆在面前，都会忍不住心潮澎湃吧！", "灯里");
            Say(pc, 0, "啊……脚滑了", "灯里");
            Say(pc, 0, "要想突破幻术的封锁，最需要的就是观察力与随机应变的能力。$R你的身体与思考都必须要运转得足够快，$R能够时刻判断局势，做出最合适的选择。$R不仅仅是在探索中——在战斗中，这也是非常重要的技巧。", "灯里");
            Say(pc, 0, "看起来你似乎一脸茫然呢。$R不过没关系，我也没有指望你能成为一个速成的战斗力。$R反应力与观察力都是需要锻炼的，只靠嘴上说说并没有什么用处。", "灯里");
            Say(pc, 0, "尝试着将“随机应变”与“细致入微”两个词语刻入你的所有行动中，$R让你的头脑与身体记住这样的感觉，这是一切的第一步。$R只要迈出了这一步，后面对你来说就不再是难事了。", "灯里");
            if(pc.Job == PC_JOB.GLADIATOR)
            {
                Say(pc, 0, "要想训练你的临场应变能力，也许最简单直接的方式还是通过实际的战斗吧$R比如说，$R你也许很擅长使剑进行近身战斗，$R但是当面对敏捷灵活，距离很远的敌人时就会感到力不从心。", "灯里");
            }
            if (pc.Job == PC_JOB.CARDINAL || pc.Job == PC_JOB.ASTRALIST)
            {
                Say(pc, 0, "要想训练你的临场应变能力，也许最简单直接的方式还是通过实际的战斗吧$R比如说，$R你也许很擅长使用魔法来对付灵活的、距离你很远的敌人。$R但是一旦被敌人切入近距离战斗的话，却会由于魔法容易误伤自己，$R而且吟唱也很容易被打断而陷入被动。", "灯里");
            }
            Say(pc, 0, "这种时候，普通人也许会想，我们要如何避免陷入这种状况呢？$R可是换个角度思考一下，$R为什么我们不能这么考虑——如果陷入了这种状况，我应该怎么办呢？", "灯里");
            Say(pc, 0, "！！", pc.Name);
            Say(pc, 0, "在远距离战斗时使用魔法，而用剑术应对贴身的战斗，扬长避短。$R这样是不是也是一种思路呢？", "灯里");
            Say(pc, 0, "尝试着用这样的思路去战斗，也许你会看到一扇完全不一样的大门为你敞开$R当你能够熟练地将这种技巧融会贯通以后，也许我们就能有办法突破迷雾的封锁了。", "灯里");
            Say(pc, 0, "唔……我好像……脑海中…浮现出什么……", pc.Name);
            pc.CInt["斥候转职任务"] = 2;
            if (Select(pc, "要转职为斥候吗？", "", "是的", "暂时不转职") == 1)
            {
                斥候转职(pc);
            }
            return;
        }
        void 斥候转职(ActorPC pc)
        {
            ChangePlayerJob(pc, PC_JOB.HAWKEYE);
            PlaySound(pc, 3087, false, 100, 50);
            ShowEffect(pc, 4131);
            Wait(pc, 1000);
            Say(pc, 0, "哦？！，看来你领悟到什么了呢，恭喜你。", "灯里");
            PlaySound(pc, 4012, false, 100, 50);
            pc.CInt["斥候转职任务"] = 3;
            pc.CInt["斥候转职完成"] = 1;
            return;
        }
        public override void OnEvent(ActorPC pc)
        {
            ChangeMessageBox(pc);
            switch (pc.CInt["斥候转职任务"])
            {
                case 0:
                    Say(pc, 0, "……", "灯里");
                    Say(pc, 0, "呜呜呜…", "灯里");
                    Say(pc, 0, "可恶，又失败了吗…", "灯里");
                    Say(pc, 0, "请问…你在这里做什么呢？", pc.Name);
                    Say(pc, 0, "咦，你是…", "灯里");
                    Say(pc, 0, "是东之国的居民吗？$R不……不对，东之国怎么会有居民……也就是说，你是冒险者吗？", "灯里");
                    Say(pc, 0, "冒险者会出现在这里，也就是说，你和我一样，$R也是因为想要知道东之国南方的谜团才来到这里的吗？$R嗯嗯，原来如此，一定是这样的，$R看来对那未知的区域充满了好奇的不止我一个人啊。", "灯里");
                    Say(pc, 0, "你在说什么啊？？", pc.Name);
                    Say(pc, 0, "…猜错了吗…嘛算了。$R我的名字是灯里，是从中央大陆来到东之国冒险者。", "灯里");
                    Say(pc, 0, "虽然最初我的目的只是为了探查当年导致东之国成为死城的事件的真相，$R但是在调查过程中，我却意外发现了更加令人感兴趣的事情。", "灯里");
                    Say(pc, 0, "令人感兴趣的事情？是什么？", pc.Name);
                    Say(pc, 0, "难道你没有注意到吗？$R明明东之国看起来有通往南方的道路，$R但是当你尝试接近时却会被无形的墙壁挡住，无法前进。$R很神奇吧？", "灯里");
                    Say(pc, 0, "那么，在东之国的南方，究竟有些什么呢？难道你不好奇吗？", "灯里");
                    Say(pc, 0, "我尝试了各种方法，但是都无法突破那道透明的墙壁。$R看起来好像可以通行的地方其实却是死路，这真是不可思议呢。", "灯里");
                    Say(pc, 0, "既然正路不通，那从侧面寻找突破口就是唯一的办法了。$R牛牛草原在东之国的西侧，从这里的海滩上游泳过去，$R也许就可以成功抵达东之国南侧的未知区域。", "灯里");
                    Say(pc, 0, "那么…你……成功了吗？", pc.Name);
                    Say(pc, 0, "（灯里摇了摇头）");
                    Say(pc, 0, "并没有，所以我现在才会像一具尸体一样趴在这片海滩上啊。", "灯里");
                    Say(pc, 0, "似乎有什么奇怪的力量在阻止我接近那片区域。$R每当我感觉我已经接近岸边的时候，就会发现我迷失了方向。$R在水中前进了2个小时以后，我最终因为力尽而放弃，被海浪带回了这片海滩", "灯里");
                    Say(pc, 0, "……", pc.Name);
                    Say(pc, 0, "一定有什么方法可以突破这无形的阻碍的……$R作为一个冒险者，我可不会这么轻易地放弃眼前的谜题的！", "灯里");
                    Say(pc, 0, "这种阻碍毫无疑问是某种幻术…$R要想破解幻术的话，就必须要有办法能够区分幻觉与现实。$R但是究竟要怎样才能……", "灯里");
                    Say(pc, 0, "（灯里打量着你）");
                    Say(pc, 0, "对了！你有没有兴趣，帮助我？", "灯里");
                    Say(pc, 0, "根据我的判断，$R东之国的神秘区域一定是受到了幻术的影响，$R以我一个人的力量恐怕是没有办法突破幻术的。$R可是如果有人能够帮助我的话，结果就不一样了。", "灯里");
                    Say(pc, 0, "幻术只能同时蒙蔽1个人。$R因为它会展现出观察者内心的期望，从而迷惑观察者，$R但是，当多个人从不同角度观察它时，$R由于每个人内心的期望并不相同，它也就很容易露出破绽。", "灯里");
                    Say(pc, 0, "既然你来到这里了，说明你也对南方的秘密充满好奇，是这样吧！$R既然如此，要不要来和我一起破解这道谜题呢？", "灯里");
                    pc.CInt["斥候转职任务"] = 1;
                    if (Select(pc, "回答是……", "", "好呀好呀", "不，所以说了我不是") == 1)
                    {
                        接受斥候转职(pc);
                        return;
                    }
                    else
                        Say(pc, 0, "你真的真的没有一点兴趣吗？！", "灯里");
                        Say(pc, 0, "（灯里好像很失落的样子）");
                    break;
                case 1:
                    Say(pc, 0, "怎么样，果然你还是想要跟我一起去探索了吗？", "灯里");
                    if (Select(pc, "回答是……", "", "嗯", "果然还是算了…") == 1) 
                    {
                        接受斥候转职(pc);
                        return;
                    }
                    else
                        Say(pc, 0, "真的不再考虑下嘛？！", "灯里");
                    break;
                case 2:
                    Say(pc, 0, "咦？你刚刚怎么突然就跑开了？", "灯里");
                    Say(pc, 0, "呃……啊，因为突然想起有事情。", pc.Name);
                    if (Select(pc, "要转职为斥候吗？", "", "是的", "暂时不转职") == 1)
                    {
                        斥候转职(pc);
                        return;
                    }
                    break;
                case 3:
                    Say(pc, 0, "呃呃呃呃，又失败了……", "灯里");
                    Say(pc, 0, "等到你能熟练地掌握“应变”的技巧后，再来找我吧。$R在这之前，我也需要一些时间好好思考一下要如何才能突破那道无形的屏障", "灯里");
                    break;
            }
        }
    }
}