using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript
{
    public class P10000500 : RandomPortal
    {
        public P10000500()
        {
            Init(10000500, 10042000, 79, 134, 82, 135);
        }
    }
    //原始地圖:無限回廊B1F(20070000)
    //目標地圖:步伐沙漠(10042000)
    //目標坐標:(79,134) ~ (82,135)

    public class P10000501 : 無限回廊傳送點
    {
        public P10000501()
        {
            Init(10000501, 10010000, 20070001, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B1F(20070000)
    //目標地圖:無限回廊B2F(20070001)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000502 : 無限回廊出口
    {
        public P10000502()
        {
            this.EventID = 10000502;
        }
    }
    //原始地圖:無限回廊B2F(20070001)
    //目標地圖:無限回廊B1F(20070000)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000503 : 無限回廊傳送點
    {
        public P10000503()
        {
            Init(10000503, 10010001, 20070002, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B2F(20070001)
    //目標地圖:無限回廊B3F(20070002)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000504 : 無限回廊出口
    {
        public P10000504()
        {
            this.EventID = 10000504;
        }
    }
    //原始地圖:無限回廊B3F(20070002)
    //目標地圖:無限回廊B2F(20070001)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000505 : 無限回廊傳送點
    {
        public P10000505()
        {
            Init(10000505, 10010002, 20070003, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B3F(20070002)
    //目標地圖:無限回廊B4F(20070003)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000506 : 無限回廊出口
    {
        public P10000506()
        {
            this.EventID = 10000506;
        }
    }
    //原始地圖:無限回廊B4F(20070003)
    //目標地圖:無限回廊B3F(20070002)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000507 : 無限回廊傳送點
    {
        public P10000507()
        {
            Init(10000507, 10010003, 20070004, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B4F(20070003)
    //目標地圖:無限回廊B5F(20070004)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000508 : 無限回廊出口
    {
        public P10000508()
        {
            this.EventID = 10000508;
        }
    }
    //原始地圖:無限回廊B5F(20070004)
    //目標地圖:無限回廊B4F(20070003)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000509 : 無限回廊傳送點
    {
        public P10000509()
        {
            Init(10000509, 10010004, 20070005, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B5F(20070004)
    //目標地圖:無限回廊B6F(20070005)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000510 : 無限回廊出口
    {
        public P10000510()
        {
            this.EventID = 10000510;
        }
    }
    //原始地圖:無限回廊B6F(20070005)
    //目標地圖:無限回廊B5F(20070004)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000511 : 無限回廊傳送點
    {
        public P10000511()
        {
            Init(10000511, 10010005, 20070006, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B6F(20070005)
    //目標地圖:無限回廊B7F(20070006)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000512 : 無限回廊出口
    {
        public P10000512()
        {
            this.EventID = 10000512;
        }
    }
    //原始地圖:無限回廊B7F(20070006)
    //目標地圖:無限回廊B6F(20070005)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000513 : 無限回廊傳送點
    {
        public P10000513()
        {
            Init(10000513, 10010006, 20070007, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B7F(20070006)
    //目標地圖:無限回廊B8F(20070007)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000514 : 無限回廊出口
    {
        public P10000514()
        {
            this.EventID = 10000514;
        }
    }
    //原始地圖:無限回廊B8F(20070007)
    //目標地圖:無限回廊B7F(20070006)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000515 : 無限回廊傳送點
    {
        public P10000515()
        {
            Init(10000515, 10010007, 20070008, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B8F(20070007)
    //目標地圖:無限回廊B9F(20070008)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000516 : 無限回廊出口
    {
        public P10000516()
        {
            this.EventID = 10000516;
        }
    }
    //原始地圖:無限回廊B9F(20070008)
    //目標地圖:無限回廊B8F(20070007)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000517 : 無限回廊傳送點
    {
        public P10000517()
        {
            Init(10000517, 10010008, 20071009, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B9F(20070008)
    //目標地圖:無限回廊B10F(20071009)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000518 : 無限回廊出口
    {
        public P10000518()
        {
            this.EventID = 10000518;
        }
    }
    //原始地圖:無限回廊B10F(20071009)
    //目標地圖:無限回廊B9F(20070008)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000519 : 無限回廊傳送點
    {
        public P10000519()
        {
            Init(10000519, 10010009, 20070010, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B10F(20071009)
    //目標地圖:無限回廊B11F(20070010)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000520 : 無限回廊出口
    {
        public P10000520()
        {
            this.EventID = 10000520;
        }
    }
    //原始地圖:無限回廊B11F(20070010)
    //目標地圖:無限回廊B10F(20071009)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000521 : 無限回廊傳送點
    {
        public P10000521()
        {
            Init(10000521, 10010010, 20070011, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B11F(20070010)
    //目標地圖:無限回廊B12F(20070011)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000522 : 無限回廊出口
    {
        public P10000522()
        {
            this.EventID = 10000522;
        }
    }
    //原始地圖:無限回廊B12F(20070011)
    //目標地圖:無限回廊B11F(20070010)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000523 : 無限回廊傳送點
    {
        public P10000523()
        {
            Init(10000523, 10010011, 20070012, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B12F(20070011)
    //目標地圖:無限回廊B13F(20070012)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000524 : 無限回廊出口
    {
        public P10000524()
        {
            this.EventID = 10000524;
        }
    }
    //原始地圖:無限回廊B13F(20070012)
    //目標地圖:無限回廊B12F(20070011)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000525 : 無限回廊傳送點
    {
        public P10000525()
        {
            Init(10000525, 10010012, 20070013, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B13F(20070012)
    //目標地圖:無限回廊B14F(20070013)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000526 : 無限回廊出口
    {
        public P10000526()
        {
            this.EventID = 10000526;
        }
    }
    //原始地圖:無限回廊B14F(20070013)
    //目標地圖:無限回廊B13F(20070012)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000527 : 無限回廊傳送點
    {
        public P10000527()
        {
            Init(10000527, 10010013, 20070014, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B14F(20070013)
    //目標地圖:無限回廊B15F(20070014)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000528 : 無限回廊出口
    {
        public P10000528()
        {
            this.EventID = 10000528;
        }
    }
    //原始地圖:無限回廊B15F(20070014)
    //目標地圖:無限回廊B14F(20070013)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000529 : 無限回廊傳送點
    {
        public P10000529()
        {
            Init(10000529, 10010014, 20070015, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B15F(20070014)
    //目標地圖:無限回廊B16F(20070015)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000530 : 無限回廊出口
    {
        public P10000530()
        {
            this.EventID = 10000530;
        }
    }
    //原始地圖:無限回廊B16F(20070015)
    //目標地圖:無限回廊B15F(20070014)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000531 : 無限回廊傳送點
    {
        public P10000531()
        {
            Init(10000531, 10010015, 20070016, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B16F(20070015)
    //目標地圖:無限回廊B17F(20070016)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000532 : 無限回廊出口
    {
        public P10000532()
        {
            this.EventID = 10000532;
        }
    }
    //原始地圖:無限回廊B17F(20070016)
    //目標地圖:無限回廊B16F(20070015)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000533 : 無限回廊傳送點
    {
        public P10000533()
        {
            Init(10000533, 10010016, 20070017, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B17F(20070016)
    //目標地圖:無限回廊B18F(20070017)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000534 : 無限回廊出口
    {
        public P10000534()
        {
            this.EventID = 10000534;
        }
    }
    //原始地圖:無限回廊B18F(20070017)
    //目標地圖:無限回廊B17F(20070016)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000535 : 無限回廊傳送點
    {
        public P10000535()
        {
            Init(10000535, 10010017, 20070018, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B18F(20070017)
    //目標地圖:無限回廊B19F(20070018)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000536 : 無限回廊出口
    {
        public P10000536()
        {
            this.EventID = 10000536;
        }
    }
    //原始地圖:無限回廊B19F(20070018)
    //目標地圖:無限回廊B18F(20070017)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000537 : 無限回廊傳送點
    {
        public P10000537()
        {
            Init(10000537, 10010018, 20071019, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B19F(20070018)
    //目標地圖:無限回廊B20F(20071019)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000538 : 無限回廊出口
    {
        public P10000538()
        {
            this.EventID = 10000538;
        }
    }
    //原始地圖:無限回廊B20F(20071019)
    //目標地圖:無限回廊B19F(20070018)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000539 : 無限回廊傳送點
    {
        public P10000539()
        {
            Init(10000539, 10010019, 20070020, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B20F(20071019)
    //目標地圖:無限回廊B21F(20070020)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000540 : 無限回廊出口
    {
        public P10000540()
        {
            this.EventID = 10000540;
        }
    }
    //原始地圖:無限回廊B21F(20070020)
    //目標地圖:無限回廊B20F(20071019)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000541 : 無限回廊傳送點
    {
        public P10000541()
        {
            Init(10000541, 10010020, 20070021, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B21F(20070020)
    //目標地圖:無限回廊B22F(20070021)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000542 : 無限回廊出口
    {
        public P10000542()
        {
            this.EventID = 10000542;
        }
    }
    //原始地圖:無限回廊B22F(20070021)
    //目標地圖:無限回廊B21F(20070020)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000543 : 無限回廊傳送點
    {
        public P10000543()
        {
            Init(10000543, 10010021, 20070022, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B22F(20070021)
    //目標地圖:無限回廊B23F(20070022)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000544 : 無限回廊出口
    {
        public P10000544()
        {
            this.EventID = 10000544;
        }
    }
    //原始地圖:無限回廊B23F(20070022)
    //目標地圖:無限回廊B22F(20070021)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000545 : 無限回廊傳送點
    {
        public P10000545()
        {
            Init(10000545, 10010022, 20070023, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B23F(20070022)
    //目標地圖:無限回廊B24F(20070023)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000546 : 無限回廊出口
    {
        public P10000546()
        {
            this.EventID = 10000546;
        }
    }
    //原始地圖:無限回廊B24F(20070023)
    //目標地圖:無限回廊B23F(20070022)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000547 : 無限回廊傳送點
    {
        public P10000547()
        {
            Init(10000547, 10010023, 20070024, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B24F(20070023)
    //目標地圖:無限回廊B25F(20070024)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000548 : 無限回廊出口
    {
        public P10000548()
        {
            this.EventID = 10000548;
        }
    }
    //原始地圖:無限回廊B25F(20070024)
    //目標地圖:無限回廊B24F(20070023)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000549 : 無限回廊傳送點
    {
        public P10000549()
        {
            Init(10000549, 10010024, 20070025, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B25F(20070024)
    //目標地圖:無限回廊B26F(20070025)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000550 : 無限回廊出口
    {
        public P10000550()
        {
            this.EventID = 10000550;
        }
    }
    //原始地圖:無限回廊B26F(20070025)
    //目標地圖:無限回廊B25F(20070024)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000551 : 無限回廊傳送點
    {
        public P10000551()
        {
            Init(10000551, 10010025, 20070026, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B26F(20070025)
    //目標地圖:無限回廊B27F(20070026)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000552 : 無限回廊出口
    {
        public P10000552()
        {
            this.EventID = 10000552;
        }
    }
    //原始地圖:無限回廊B27F(20070026)
    //目標地圖:無限回廊B26F(20070025)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000553 : 無限回廊傳送點
    {
        public P10000553()
        {
            Init(10000553, 10010026, 20070027, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B27F(20070026)
    //目標地圖:無限回廊B28F(20070027)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000554 : 無限回廊出口
    {
        public P10000554()
        {
            this.EventID = 10000554;
        }
    }
    //原始地圖:無限回廊B28F(20070027)
    //目標地圖:無限回廊B27F(20070026)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000555 : 無限回廊傳送點
    {
        public P10000555()
        {
            Init(10000555, 10010027, 20070028, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B28F(20070027)
    //目標地圖:無限回廊B29F(20070028)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000556 : 無限回廊出口
    {
        public P10000556()
        {
            this.EventID = 10000556;
        }
    }
    //原始地圖:無限回廊B29F(20070028)
    //目標地圖:無限回廊B28F(20070027)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000557 : 無限回廊傳送點
    {
        public P10000557()
        {
            Init(10000557, 10010028, 20071029, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B29F(20070028)
    //目標地圖:無限回廊B30F(20071029)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000558 : 無限回廊出口
    {
        public P10000558()
        {
            this.EventID = 10000558;
        }
    }
    //原始地圖:無限回廊B30F(20071029)
    //目標地圖:無限回廊B29F(20070028)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000559 : 無限回廊傳送點
    {
        public P10000559()
        {
            Init(10000559, 10010029, 20070030, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B30F(20071029)
    //目標地圖:無限回廊B31F(20070030)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000560 : 無限回廊出口
    {
        public P10000560()
        {
            this.EventID = 10000560;
        }
    }
    //原始地圖:無限回廊B31F(20070030)
    //目標地圖:無限回廊B30F(20071029)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000561 : 無限回廊傳送點
    {
        public P10000561()
        {
            Init(10000561, 10010030, 20070031, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B31F(20070030)
    //目標地圖:無限回廊B32F(20070031)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000562 : 無限回廊出口
    {
        public P10000562()
        {
            this.EventID = 10000562;
        }
    }
    //原始地圖:無限回廊B32F(20070031)
    //目標地圖:無限回廊B31F(20070030)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000563 : 無限回廊傳送點
    {
        public P10000563()
        {
            Init(10000563, 10010031, 20070032, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B32F(20070031)
    //目標地圖:無限回廊B33F(20070032)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000564 : 無限回廊出口
    {
        public P10000564()
        {
            this.EventID = 10000564;
        }
    }
    //原始地圖:無限回廊B33F(20070032)
    //目標地圖:無限回廊B32F(20070031)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000565 : 無限回廊傳送點
    {
        public P10000565()
        {
            Init(10000565, 10010032, 20070033, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B33F(20070032)
    //目標地圖:無限回廊B34F(20070033)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000566 : 無限回廊出口
    {
        public P10000566()
        {
            this.EventID = 10000566;
        }
    }
    //原始地圖:無限回廊B34F(20070033)
    //目標地圖:無限回廊B33F(20070032)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000567 : 無限回廊傳送點
    {
        public P10000567()
        {
            Init(10000567, 10010033, 20070034, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B34F(20070033)
    //目標地圖:無限回廊B35F(20070034)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000568 : 無限回廊出口
    {
        public P10000568()
        {
            this.EventID = 10000568;
        }
    }
    //原始地圖:無限回廊B35F(20070034)
    //目標地圖:無限回廊B34F(20070033)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000569 : 無限回廊傳送點
    {
        public P10000569()
        {
            Init(10000569, 10010034, 20070035, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B35F(20070034)
    //目標地圖:無限回廊B36F(20070035)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000570 : 無限回廊出口
    {
        public P10000570()
        {
            this.EventID = 10000570;
        }
    }
    //原始地圖:無限回廊B36F(20070035)
    //目標地圖:無限回廊B35F(20070034)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000571 : 無限回廊傳送點
    {
        public P10000571()
        {
            Init(10000571, 10010035, 20070036, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B36F(20070035)
    //目標地圖:無限回廊B37F(20070036)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000572 : 無限回廊出口
    {
        public P10000572()
        {
            this.EventID = 10000572;
        }
    }
    //原始地圖:無限回廊B37F(20070036)
    //目標地圖:無限回廊B36F(20070035)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000573 : 無限回廊傳送點
    {
        public P10000573()
        {
            Init(10000573, 10010036, 20070037, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B37F(20070036)
    //目標地圖:無限回廊B38F(20070037)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000574 : 無限回廊出口
    {
        public P10000574()
        {
            this.EventID = 10000574;
        }
    }
    //原始地圖:無限回廊B38F(20070037)
    //目標地圖:無限回廊B37F(20070036)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000575 : 無限回廊傳送點
    {
        public P10000575()
        {
            Init(10000575, 10010037, 20070038, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B38F(20070037)
    //目標地圖:無限回廊B39F(20070038)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000576 : 無限回廊出口
    {
        public P10000576()
        {
            this.EventID = 10000576;
        }
    }
    //原始地圖:無限回廊B39F(20070038)
    //目標地圖:無限回廊B38F(20070037)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000577 : 無限回廊傳送點
    {
        public P10000577()
        {
            Init(10000577, 10010038, 20071039, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B39F(20070038)
    //目標地圖:無限回廊B40F(20071039)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000578 : 無限回廊出口
    {
        public P10000578()
        {
            this.EventID = 10000578;
        }
    }
    //原始地圖:無限回廊B40F(20071039)
    //目標地圖:無限回廊B39F(20070038)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000579 : RandomPortal
    {
        public P10000579()
        {
            Init(10000579, 20070040, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B40F(20071039)
    //目標地圖:無限回廊B41F(20070040)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000580 : 無限回廊出口
    {
        public P10000580()
        {
            this.EventID = 10000580;
        }
    }
    //原始地圖:無限回廊B41F(20070040)
    //目標地圖:無限回廊B40F(20071039)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000581 : RandomPortal
    {
        public P10000581()
        {
            Init(10000581, 20070041, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B41F(20070040)
    //目標地圖:無限回廊B42F(20070041)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000582 : 無限回廊出口
    {
        public P10000582()
        {
            this.EventID = 10000582;
        }
    }
    //原始地圖:無限回廊B42F(20070041)
    //目標地圖:無限回廊B41F(20070040)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000583 : RandomPortal
    {
        public P10000583()
        {
            Init(10000583, 20070042, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B42F(20070041)
    //目標地圖:無限回廊B43F(20070042)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000584 : 無限回廊出口
    {
        public P10000584()
        {
            this.EventID = 10000584;
        }
    }
    //原始地圖:無限回廊B43F(20070042)
    //目標地圖:無限回廊B42F(20070041)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000585 : RandomPortal
    {
        public P10000585()
        {
            Init(10000585, 20070043, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B43F(20070042)
    //目標地圖:無限回廊B44F(20070043)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000586 : 無限回廊出口
    {
        public P10000586()
        {
            this.EventID = 10000586;
        }
    }
    //原始地圖:無限回廊B44F(20070043)
    //目標地圖:無限回廊B43F(20070042)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000587 : RandomPortal
    {
        public P10000587()
        {
            Init(10000587, 20070044, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B44F(20070043)
    //目標地圖:無限回廊B45F(20070044)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000588 : 無限回廊出口
    {
        public P10000588()
        {
            this.EventID = 10000588;
        }
    }
    //原始地圖:無限回廊B45F(20070044)
    //目標地圖:無限回廊B44F(20070043)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000589 : RandomPortal
    {
        public P10000589()
        {
            Init(10000589, 20070045, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B45F(20070044)
    //目標地圖:無限回廊B46F(20070045)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000590 : 無限回廊出口
    {
        public P10000590()
        {
            this.EventID = 10000590;
        }
    }
    //原始地圖:無限回廊B46F(20070045)
    //目標地圖:無限回廊B45F(20070044)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000591 : RandomPortal
    {
        public P10000591()
        {
            Init(10000591, 20070046, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B46F(20070045)
    //目標地圖:無限回廊B47F(20070046)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000592 : 無限回廊出口
    {
        public P10000592()
        {
            this.EventID = 10000592;
        }
    }
    //原始地圖:無限回廊B47F(20070046)
    //目標地圖:無限回廊B46F(20070045)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000593 : RandomPortal
    {
        public P10000593()
        {
            Init(10000593, 20070047, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B47F(20070046)
    //目標地圖:無限回廊B48F(20070047)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000594 : 無限回廊出口
    {
        public P10000594()
        {
            this.EventID = 10000594;
        }
    }
    //原始地圖:無限回廊B48F(20070047)
    //目標地圖:無限回廊B47F(20070046)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000595 : RandomPortal
    {
        public P10000595()
        {
            Init(10000595, 20070048, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B48F(20070047)
    //目標地圖:無限回廊B49F(20070048)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000596 : 無限回廊出口
    {
        public P10000596()
        {
            this.EventID = 10000596;
        }
    }
    //原始地圖:無限回廊B49F(20070048)
    //目標地圖:無限回廊B48F(20070047)
    //目標坐標:(22,10) ~ (25,12)

    public class P10000597 : RandomPortal
    {
        public P10000597()
        {
            Init(10000597, 20071049, 22, 83, 25, 85);
        }
    }
    //原始地圖:無限回廊B49F(20070048)
    //目標地圖:無限回廊B50F(20071049)
    //目標坐標:(22,83) ~ (25,85)

    public class P10000598 : 無限回廊出口
    {
        public P10000598()
        {
            this.EventID = 10000598;
        }
    }
    //原始地圖:無限回廊B50F(20071049)
    //目標地圖:無限回廊B49F(20070048)
    //目標坐標:(22,10) ~ (25,12)
}