using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;
//所在地圖:東方海角(10018001) NPC基本信息:冒險者前輩(11000934) X:64 Y:56
namespace SagaScript.M10018001
{
    public class S11000934 : Event
    {
        public S11000934()
        {
            this.EventID = 11000934;
        }

        public override void OnEvent(ActorPC pc)
        {
            int selection;

            Say(pc, 11000934, 0, "您好!$R;" +
                                 "$R刚开始冒险的人们，$R;" +
                                 "正在谈论关于队伍和军团系统喔!$R;" +
                                 "$R要一起听听吗?$R;", "冒险者前辈");

            selection = Select(pc, "听关于哪一方面的情报呢?", "", "关于「队伍」", "关于「军团」", "关于「聊天视窗」", "关于「朋友讯息视窗」", "关于「广告目录」", "没有必要");

            while (selection != 6)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11000934, 0, "队伍指的是$R;" +
                                             "一起战斗或完成任务的同伴。$R;" +
                                             "$P队伍中最多一共有8人。$R;" +
                                             "$R队员在同一个区域时，$R;" +
                                             "可以互相分享经验值喔!$R;" +
                                             "$P不过要注意等级的差异。$R;" +
                                             "$R等级低时，$R;" +
                                             "即使打败等级很高的魔物，$R;" +
                                             "也有可能得不到经验值!$R;" +
                                             "$P经验值的分配，$R;" +
                                             "会根据本身等级的高低而有所不同喔!$R;" +
                                             "最好找等级相近的同伴，$R;" +
                                             "或打适合的魔物，才练得快!$R;" +
                                             "$P至于组队的方法。$R;" +
                                             "$P请点击右键，选择想邀请的对象后，$R;" +
                                             "按下「邀请加入队伍」的选项即可。$R;" +
                                             "$P突然邀请对方，会让对方困扰的，$R;" +
                                             "请先好好打招呼后，再邀请吧!$R;" +
                                             "想退出队伍时，$R;" +
                                             "点击右键选择「退出队伍」即可。$R;" +
                                             "$P组织队伍的人想解散队伍时，$R;" +
                                             "选择「解散队伍」即可。$R;", "冒险者前辈");
                        break;

                    case 2:
                        Say(pc, 11000934, 0, "把军团当作是半永久性的队伍也可以喔!$R;" +
                                             "$P军团最初可以登记的人数为16人。$R;" +
                                             "$R日后军团名声增加了，$R;" +
                                             "就可以增加人数的上限，$R;" +
                                             "所以可以放心继续的交朋友唷!$R;" +
                                             "$P军团的管理员在「阿克罗波利斯」，$R;" +
                                             "想组织军团时，找管理员就可以了。$R;" +
                                             "$P至于组织军团的方法，$R;" +
                                             "找军团管理者问问吧!$R;" +
                                             "$R现在告诉您，也说不清楚的。$R;", "冒险者前辈");
                        break;

                    case 3:
                        Say(pc, 11000934, 0, "聊天视窗指的是，输入对话的地方。$R;" +
                                             "$R旁边有长长的视窗吧?$R;" +
                                             "那个就是聊天视窗了。$R;" +
                                             "$P左边有「O」「P」「R」「W」键吧?$R;" +
                                             "$P没错!$R;" +
                                             "$R「O」键是公开聊天模式，$R;" +
                                             "「P」键是队伍聊天模式，$R;" +
                                             "「R」键是军团聊天模式，$R;" +
                                             "「W」键是悄悄话聊天模式。$R;" +
                                             "$P公开聊天是给周围所有人，$R;" +
                                             "队伍聊天只给队员…$R;" +
                                             "$P悄悄话是进行1对1聊天时使用的。$R;" +
                                             "$R只要点击「W」键，$R;" +
                                             "利用悄悄话视窗，$R;" +
                                             "就可以跟指定的人说话!$R;", "冒险者前辈");
                        break;

                    case 4:
                        Say(pc, 11000934, 0, "用主视窗的「朋友」键，$R;" +
                                             "打开朋友目录吧!$R;" +
                                             "$P…$R;" +
                                             "$P打开了吗?$R;" +
                                             "$P现在说明朋友目录里的，$R;" +
                                             "「朋友」、「军团」、「队伍」。$R;" +
                                             "$P「朋友」目录储存$R;" +
                                             "有关已登记的朋友的资料唷!$R;" +
                                             "$P如果是已登记的朋友，$R;" +
                                             "您可以知道是否在线。$R;" +
                                             "$R在线的话，$R;" +
                                             "也可以知道对方的位置呀!$R;" +
                                             "$P登记的方法很简单啊!$R;" +
                                             "$R想成为朋友，$R;" +
                                             "只要点击右键，$R;" +
                                             "选择「新增朋友目录」就可以了。$R;" +
                                             "$P您如果是军团的总管，$R;" +
                                             "也可以用类似的方法邀请$R;" +
                                             "其他人加入您的军团!$R;" +
                                             "$P在「军团」里，$R;" +
                                             "可以确认军团成员的讯息。$R;" +
                                             "$R在「队伍」里，$R ;" +
                                             "可以确认队伍成员的讯息。$R;" +
                                             "$P再一个小小的提示吧!$R;" +
                                             "$R在朋友目录选择名字后，点击右键…$R;" +
                                             "$R就可以使用悄悄话聊天喔!$R;", "冒险者前辈");
                        break;

                    case 5:
                        Say(pc, 11000934, 0, "至於广告目录呢!$R;" +
                                             "在组成队伍，$R;" +
                                             "或跟其他的玩家打招呼，$R;" +
                                             "或交换情报时使用，$R;" +
                                             "是个非常方便的功能!$R;" +
                                             "$P对自己点击滑鼠右键。$R;" +
                                             "$R看到「招募广告登陆」$R;" +
                                             "「招募广告目录」了吧?$R;" +
                                             "$R先选目录吧!$R;" +
                                             "$P选择「招募广告目录」后。$R;" +
                                             "$P可以详细显示现在招募的人喔!$R;" +
                                             "$R还可以看到那些人现在在哪里?$R;" +
                                             "$P招募的人的名字右边有，$R;" +
                                             "「P」和「W」键，看见了吗?$R;" +
                                             "$P按「P」键，$R;" +
                                             "可以申请参加这个人的队伍。$R;" +
                                             "$R按「W」键，$R;" +
                                             "就会显示悄悄话视窗唷。$R;" +
                                             "$R但突然申请队伍，$R;" +
                                             "对方会不知所措的，$R;" +
                                             "先好好跟对方说悄悄话再邀请吧!$R;" +
                                             "$P如果自己想招募成员的话，$R;" +
                                             "右击自己，在显示的目录中$R;" +
                                             "选择「招募广告登陆」就可以了。$R;", "冒险者前辈");
                        break;
                }

                selection = Select(pc, "听关于哪一方面的情报呢?", "", "关于「队伍」", "关于「军团」", "关于「聊天视窗」", "关于「朋友讯息视窗」", "关于「广告目录」", "没有必要");
            }

            Say(pc, 11000934, 0, "现在关于队伍和军团的情报，$R;" +
                                 "都明白了吗?$R;" +
                                 "$P不太清楚的话，就问周围的人吧?$R;" +
                                 "$R询问也是交流的好方法!$R;" +
                                 "$P那么加油吧!!$R;", "冒险者前辈");
        }
    }
}
