using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;

namespace SagaScript
{
    public class P10001121 : RandomPortalForInstance
    {
        public P10001121()
        {
            Init(10001121, 20162000, 23, 40, 25, 42);
        }
    }
    //原始地圖:光之塔上層(20163000)
    //目標地圖:A-22F(20162000)
    //目標坐標:(23,40) ~ (25,42)

    public class P10001122 : RandomPortalForInstance
    {
        public P10001122()
        {
            Init(10001122, 20163000, 142, 98, 143, 100);
        }
    }
    //原始地圖:A-22F(20162000)
    //目標地圖:光之塔上層(20163000)
    //目標坐標:(142,98) ~ (143,100)

    public class P10001123 : RandomPortalForInstance
    {
        public P10001123()
        {
            Init(10001123, 20161000, 14, 6, 16, 8);
        }
    }
    //原始地圖:A-22F(20162000)
    //目標地圖:A-21F(20161000)
    //目標坐標:(14,6) ~ (16,8)

    public class P10001124 : RandomPortalForInstance
    {
        public P10001124()
        {
            Init(10001124, 20162000, 15, 6, 17, 8);
        }
    }
    //原始地圖:A-21F(20161000)
    //目標地圖:A-22F(20162000)
    //目標坐標:(15,6) ~ (17,8)

    public class P10001125 : RandomPortalForInstance
    {
        public P10001125()
        {
            Init(10001125, 20161000, 43, 6, 45, 8);
        }
    }
    //原始地圖:A-22F(20162000)
    //目標地圖:A-21F(20161000)
    //目標坐標:(43,6) ~ (45,8)

    public class P10001126 : RandomPortalForInstance
    {
        public P10001126()
        {
            Init(10001126, 20162000, 44, 6, 46, 8);
        }
    }
    //原始地圖:A-21F(20161000)
    //目標地圖:A-22F(20162000)
    //目標坐標:(44,6) ~ (46,8)

    public class P10001127 : RandomPortalForInstance
    {
        public P10001127()
        {
            Init(10001127, 20154002, 15, 42, 17, 44);
        }
    }
    //原始地圖:A-21F(20161000)
    //目標地圖:A-20F(20154002)
    //目標坐標:(15,42) ~ (17,44)

    public class P10001128 : RandomPortalForInstance
    {
        public P10001128()
        {
            Init(10001128, 20155002, 16, 46, 16, 46);
        }
    }
    //原始地圖:A-18F(20160000)
    //目標地圖:A-19F(20155002)
    //目標坐標:(16,46) ~ (16,46)

    public class P10001129 : RandomPortalForInstance
    {
        public P10001129()
        {
            Init(10001129, 20154002, 44, 42, 46, 44);
        }
    }
    //原始地圖:A-21F(20161000)
    //目標地圖:A-20F(20154002)
    //目標坐標:(44,42) ~ (46,44)

    public class P10001130 : RandomPortalForInstance
    {
        public P10001130()
        {
            Init(10001130, 20155002, 45, 44, 45, 44);
        }
    }
    //原始地圖:A-18F(20160000)
    //目標地圖:A-19F(20155002)
    //目標坐標:(45,44) ~ (45,44)

    public class P10001131 : RandomPortalForInstance
    {
        public P10001131()
        {
            Init(10001131, 20159000, 15, 8, 17, 10);
        }
    }
    //原始地圖:A-18F(20160000)
    //目標地圖:A-17F(20159000)
    //目標坐標:(15,8) ~ (17,10)

    public class P10001132 : RandomPortalForInstance
    {
        public P10001132()
        {
            Init(10001132, 20160000, 15, 6, 17, 8);
        }
    }
    //原始地圖:A-17F(20159000)
    //目標地圖:A-18F(20160000)
    //目標坐標:(15,6) ~ (17,8)

    public class P10001133 : RandomPortalForInstance
    {
        public P10001133()
        {
            Init(10001133, 20159000, 44, 8, 46, 10);
        }
    }
    //原始地圖:A-18F(20160000)
    //目標地圖:A-17F(20159000)
    //目標坐標:(44,8) ~ (46,10)

    public class P10001134 : RandomPortalForInstance
    {
        public P10001134()
        {
            Init(10001134, 20160000, 44, 6, 46, 8);
        }
    }
    //原始地圖:A-17F(20159000)
    //目標地圖:A-18F(20160000)
    //目標坐標:(44,6) ~ (46,8)

    public class P10001135 : RandomPortalForInstance
    {
        public P10001135()
        {
            Init(10001135, 20163000, 173, 92, 175, 93);
        }
    }
    //原始地圖:A-17F(20159000)
    //目標地圖:光之塔上層(20163000)
    //目標坐標:(173,92) ~ (175,93)

    public class P10001136 : RandomPortalForInstance
    {
        public P10001136()
        {
            Init(10001136, 20159000, 48, 35, 50, 36);
        }
    }
    //原始地圖:光之塔上層(20163000)
    //目標地圖:A-17F(20159000)
    //目標坐標:(48,35) ~ (50,36)

    public class P10001137 : RandomPortalForInstance
    {
        public P10001137()
        {
            Init(10001137, 20155001, 16, 6, 16, 6);
        }
    }
    //原始地圖:A-16F(20158000)
    //目標地圖:A-15F(20155001)
    //目標坐標:(16,6) ~ (16,6)

    public class P10001138 : RandomPortalForInstance
    {
        public P10001138()
        {
            Init(10001138, 20154001, 15, 6, 16, 6);
        }
    }
    //原始地圖:A-13F(20157000)
    //目標地圖:A-14F(20154001)
    //目標坐標:(15,6) ~ (16,6)

    public class P10001139 : RandomPortalForInstance
    {
        public P10001139()
        {
            Init(10001139, 20155001, 45, 6, 45, 6);
        }
    }
    //原始地圖:A-16F(20158000)
    //目標地圖:A-15F(20155001)
    //目標坐標:(45,6) ~ (45,6)

    public class P10001140 : RandomPortalForInstance
    {
        public P10001140()
        {
            Init(10001140, 20154001, 43, 4, 45, 6);
        }
    }
    //原始地圖:A-13F(20157000)
    //目標地圖:A-14F(20154001)
    //目標坐標:(43,4) ~ (45,6)

    public class P10001141 : RandomPortalForInstance
    {
        public P10001141()
        {
            Init(10001141, 20156000, 15, 42, 17, 44);
        }
    }
    //原始地圖:A-13F(20157000)
    //目標地圖:A-12F(20156000)
    //目標坐標:(15,42) ~ (17,44)

    public class P10001142 : RandomPortalForInstance
    {
        public P10001142()
        {
            Init(10001142, 20157000, 15, 44, 17, 46);
        }
    }
    //原始地圖:A-12F(20156000)
    //目標地圖:A-13F(20157000)
    //目標坐標:(15,44) ~ (17,46)

    public class P10001143 : RandomPortalForInstance
    {
        public P10001143()
        {
            Init(10001143, 20163000, 148, 106, 150, 107);
        }
    }
    //原始地圖:A-12F(20156000)
    //目標地圖:光之塔上層(20163000)
    //目標坐標:(148,106) ~ (150,107)

    public class P10001144 : RandomPortalForInstance
    {
        public P10001144()
        {
            Init(10001144, 20156000, 29, 47, 32, 49);
        }
    }
    //原始地圖:光之塔上層(20163000)
    //目標地圖:A-12F(20156000)
    //目標坐標:(29,47) ~ (32,49)

    public class P10001145 : RandomPortalForInstance
    {
        public P10001145()
        {
            Init(10001145, 20155000, 15, 8, 17, 10);
        }
    }
    //原始地圖:光之塔上層(20163000)
    //目標地圖:A-11F(20155000)
    //目標坐標:(15,8) ~ (17,10)

    public class P10001146 : RandomPortalForInstance
    {
        public P10001146()
        {
            Init(10001146, 20156000, 15, 6, 17, 8);
        }
    }
    //原始地圖:A-11F(20155000)
    //目標地圖:A-12F(20156000)
    //目標坐標:(15,6) ~ (17,8)

    public class P10001147 : RandomPortalForInstance
    {
        public P10001147()
        {
            Init(10001147, 20155000, 44, 8, 46, 10);
        }
    }
    //原始地圖:光之塔上層(20163000)
    //目標地圖:A-11F(20155000)
    //目標坐標:(44,8) ~ (46,10)

    public class P10001148 : RandomPortalForInstance
    {
        public P10001148()
        {
            Init(10001148, 20156000, 44, 6, 46, 8);
        }
    }
    //原始地圖:A-11F(20155000)
    //目標地圖:A-12F(20156000)
    //目標坐標:(44,6) ~ (46,8)

    public class P10001149 : RandomPortalForInstance
    {
        public P10001149()
        {
            Init(10001149, 20154000, 15, 42, 17, 44);
        }
    }
    //原始地圖:A-11F(20155000)
    //目標地圖:A-10F(20154000)
    //目標坐標:(15,42) ~ (17,44)

    public class P10001150 : RandomPortalForInstance
    {
        public P10001150()
        {
            Init(10001150, 20155000, 15, 44, 17, 46);
        }
    }
    //原始地圖:A-10F(20154000)
    //目標地圖:A-11F(20155000)
    //目標坐標:(15,44) ~ (17,46)

    public class P10001151 : RandomPortalForInstance
    {
        public P10001151()
        {
            Init(10001151, 20154000, 44, 42, 46, 44);
        }
    }
    //原始地圖:A-11F(20155000)
    //目標地圖:A-10F(20154000)
    //目標坐標:(44,42) ~ (46,44)

    public class P10001152 : RandomPortalForInstance
    {
        public P10001152()
        {
            Init(10001152, 20155000, 44, 44, 46, 46);
        }
    }
    //原始地圖:A-10F(20154000)
    //目標地圖:A-11F(20155000)
    //目標坐標:(44,44) ~ (46,46)

    public class P10001153 : RandomPortalForInstance
    {
        public P10001153()
        {
            Init(10001153, 20153000, 15, 8, 17, 10);
        }
    }
    //原始地圖:A-10F(20154000)
    //目標地圖:A-9F(20153000)
    //目標坐標:(15,8) ~ (17,10)

    public class P10001154 : RandomPortalForInstance
    {
        public P10001154()
        {
            Init(10001154, 20154000, 15, 6, 17, 8);
        }
    }
    //原始地圖:A-9F(20153000)
    //目標地圖:A-10F(20154000)
    //目標坐標:(15,6) ~ (17,8)

    public class P10001155 : RandomPortalForInstance
    {
        public P10001155()
        {
            Init(10001155, 20153000, 44, 8, 46, 10);
        }
    }
    //原始地圖:A-10F(20154000)
    //目標地圖:A-9F(20153000)
    //目標坐標:(44,8) ~ (46,10)

    public class P10001156 : RandomPortalForInstance
    {
        public P10001156()
        {
            Init(10001156, 20154000, 44, 6, 46, 8);
        }
    }
    //原始地圖:A-9F(20153000)
    //目標地圖:A-10F(20154000)
    //目標坐標:(44,6) ~ (46,8)

    public class P10001157 : RandomPortalForInstance
    {
        public P10001157()
        {
            Init(10001157, 20151000, 15, 42, 17, 44);
        }
    }
    //原始地圖:A-9F(20153000)
    //目標地圖:A-8F(20151000)
    //目標坐標:(15,42) ~ (17,44)

    public class P10001158 : RandomPortalForInstance
    {
        public P10001158()
        {
            Init(10001158, 20153000, 15, 44, 17, 46);
        }
    }
    //原始地圖:A-8F(20151000)
    //目標地圖:A-9F(20153000)
    //目標坐標:(15,44) ~ (17,46)

    public class P10001159 : RandomPortalForInstance
    {
        public P10001159()
        {
            Init(10001159, 20151000, 44, 42, 46, 44);
        }
    }
    //原始地圖:A-9F(20153000)
    //目標地圖:A-8F(20151000)
    //目標坐標:(44,42) ~ (46,44)

    public class P10001160 : RandomPortalForInstance
    {
        public P10001160()
        {
            Init(10001160, 20153000, 44, 44, 46, 46);
        }
    }
    //原始地圖:A-8F(20151000)
    //目標地圖:A-9F(20153000)
    //目標坐標:(44,44) ~ (46,46)

    public class P10001161 : RandomPortalForInstance
    {
        public P10001161()
        {
            Init(10001161, 20149000, 15, 8, 17, 10);
        }
    }
    //原始地圖:A-8F(20151000)
    //目標地圖:A-7F(20149000)
    //目標坐標:(15,8) ~ (17,10)

    public class P10001162 : RandomPortalForInstance
    {
        public P10001162()
        {
            Init(10001162, 20151000, 15, 6, 17, 8);
        }
    }
    //原始地圖:A-7F(20149000)
    //目標地圖:A-8F(20151000)
    //目標坐標:(15,6) ~ (17,8)

    public class P10001163 : RandomPortalForInstance
    {
        public P10001163()
        {
            Init(10001163, 20149000, 44, 8, 46, 10);
        }
    }
    //原始地圖:A-8F(20151000)
    //目標地圖:A-7F(20149000)
    //目標坐標:(44,8) ~ (46,10)

    public class P10001164 : RandomPortalForInstance
    {
        public P10001164()
        {
            Init(10001164, 20151000, 44, 6, 46, 8);
        }
    }
    //原始地圖:A-7F(20149000)
    //目標地圖:A-8F(20151000)
    //目標坐標:(44,6) ~ (46,8)

    public class P10001165 : RandomPortalForInstance
    {
        public P10001165()
        {
            Init(10001165, 20146000, 116, 130, 118, 132);
        }
    }
    //原始地圖:B-8F(20152000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(116,130) ~ (118,132)

    public class P10001166 : RandomPortalForInstance
    {
        public P10001166()
        {
            Init(10001166, 20152000, 15, 8, 17, 10);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:B-8F(20152000)
    //目標坐標:(15,8) ~ (17,10)

    public class P10001167 : RandomPortalForInstance
    {
        public P10001167()
        {
            Init(10001167, 20146000, 129, 156, 131, 158);
        }
    }
    //原始地圖:B-8F(20152000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(129,156) ~ (131,158)

    public class P10001168 : RandomPortalForInstance
    {
        public P10001168()
        {
            Init(10001168, 20152000, 44, 8, 46, 10);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:B-8F(20152000)
    //目標坐標:(44,8) ~ (46,10)

    public class P10001169 : RandomPortalForInstance
    {
        public P10001169()
        {
            Init(10001169, 20150000, 15, 42, 17, 44);
        }
    }
    //原始地圖:B-8F(20152000)
    //目標地圖:B-7F(20150000)
    //目標坐標:(15,42) ~ (17,44)

    public class P10001170 : RandomPortalForInstance
    {
        public P10001170()
        {
            Init(10001170, 20152000, 15, 44, 17, 46);
        }
    }
    //原始地圖:B-7F(20150000)
    //目標地圖:B-8F(20152000)
    //目標坐標:(15,44) ~ (17,46)

    public class P10001171 : RandomPortalForInstance
    {
        public P10001171()
        {
            Init(10001171, 20150000, 44, 42, 46, 44);
        }
    }
    //原始地圖:B-8F(20152000)
    //目標地圖:B-7F(20150000)
    //目標坐標:(44,42) ~ (46,44)

    public class P10001172 : RandomPortalForInstance
    {
        public P10001172()
        {
            Init(10001172, 20152000, 44, 44, 46, 46);
        }
    }
    //原始地圖:B-7F(20150000)
    //目標地圖:B-8F(20152000)
    //目標坐標:(44,44) ~ (46,46)

    public class P10001173 : RandomPortalForInstance
    {
        public P10001173()
        {
            Init(10001173, 20146000, 148, 106, 150, 108);
        }
    }
    //原始地圖:A-8F(20151000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(148,106) ~ (150,108)

    public class P10001174 : RandomPortalForInstance
    {
        public P10001174()
        {
            Init(10001174, 20151000, 29, 46, 32, 48);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:A-8F(20151000)
    //目標坐標:(29,46) ~ (32,48)

    public class P10001175 : RandomPortalForInstance
    {
        public P10001175()
        {
            Init(10001175, 20146000, 129, 139, 131, 141);
        }
    }
    //原始地圖:B-8F(20152000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(129,139) ~ (131,141)

    public class P10001176 : RandomPortalForInstance
    {
        public P10001176()
        {
            Init(10001176, 20152000, 29, 4, 32, 6);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:B-8F(20152000)
    //目標坐標:(29,4) ~ (32,6)

    public class P10001177 : RandomPortalForInstance
    {
        public P10001177()
        {
            Init(10001177, 20147000, 15, 42, 17, 44);
        }
    }
    //原始地圖:A-7F(20149000)
    //目標地圖:A-6F(20147000)
    //目標坐標:(15,42) ~ (17,44)

    public class P10001178 : RandomPortalForInstance
    {
        public P10001178()
        {
            Init(10001178, 20149000, 15, 44, 17, 46);
        }
    }
    //原始地圖:A-6F(20147000)
    //目標地圖:A-7F(20149000)
    //目標坐標:(15,44) ~ (17,46)

    public class P10001179 : RandomPortalForInstance
    {
        public P10001179()
        {
            Init(10001179, 20147000, 44, 42, 46, 44);
        }
    }
    //原始地圖:A-7F(20149000)
    //目標地圖:A-6F(20147000)
    //目標坐標:(44,42) ~ (46,44)

    public class P10001180 : RandomPortalForInstance
    {
        public P10001180()
        {
            Init(10001180, 20149000, 44, 44, 46, 46);
        }
    }
    //原始地圖:A-6F(20147000)
    //目標地圖:A-7F(20149000)
    //目標坐標:(44,44) ~ (46,46)

    public class P10001181 : RandomPortalForInstance
    {
        public P10001181()
        {
            Init(10001181, 20148000, 15, 8, 17, 10);
        }
    }
    //原始地圖:B-7F(20150000)
    //目標地圖:B-6F(20148000)
    //目標坐標:(15,8) ~ (17,10)

    public class P10001182 : RandomPortalForInstance
    {
        public P10001182()
        {
            Init(10001182, 20150000, 15, 6, 17, 8);
        }
    }
    //原始地圖:B-6F(20148000)
    //目標地圖:B-7F(20150000)
    //目標坐標:(15,6) ~ (17,8)

    public class P10001183 : RandomPortalForInstance
    {
        public P10001183()
        {
            Init(10001183, 20148000, 44, 8, 46, 10);
        }
    }
    //原始地圖:B-7F(20150000)
    //目標地圖:B-6F(20148000)
    //目標坐標:(44,8) ~ (46,10)

    public class P10001184 : RandomPortalForInstance
    {
        public P10001184()
        {
            Init(10001184, 20150000, 44, 6, 46, 8);
        }
    }
    //原始地圖:B-6F(20148000)
    //目標地圖:B-7F(20150000)
    //目標坐標:(44,6) ~ (46,8)

    public class P10001185 : RandomPortalForInstance
    {
        public P10001185()
        {
            Init(10001185, 20144000, 15, 8, 17, 10);
        }
    }
    //原始地圖:A-6F(20147000)
    //目標地圖:A-5F(20144000)
    //目標坐標:(15,8) ~ (17,10)

    public class P10001186 : RandomPortalForInstance
    {
        public P10001186()
        {
            Init(10001186, 20147000, 15, 6, 17, 8);
        }
    }
    //原始地圖:A-5F(20144000)
    //目標地圖:A-6F(20147000)
    //目標坐標:(15,6) ~ (17,8)

    public class P10001187 : RandomPortalForInstance
    {
        public P10001187()
        {
            Init(10001187, 20144000, 44, 8, 46, 10);
        }
    }
    //原始地圖:A-6F(20147000)
    //目標地圖:A-5F(20144000)
    //目標坐標:(44,8) ~ (46,10)

    public class P10001188 : RandomPortalForInstance
    {
        public P10001188()
        {
            Init(10001188, 20147000, 44, 6, 46, 8);
        }
    }
    //原始地圖:A-5F(20144000)
    //目標地圖:A-6F(20147000)
    //目標坐標:(44,6) ~ (46,8)

    public class P10001189 : RandomPortalForInstance
    {
        public P10001189()
        {
            Init(10001189, 20145000, 15, 42, 17, 44);
        }
    }
    //原始地圖:B-6F(20148000)
    //目標地圖:B-5F(20145000)
    //目標坐標:(15,42) ~ (17,44)

    public class P10001190 : RandomPortalForInstance
    {
        public P10001190()
        {
            Init(10001190, 20148000, 15, 44, 17, 47);
        }
    }
    //原始地圖:B-5F(20145000)
    //目標地圖:B-6F(20148000)
    //目標坐標:(15,44) ~ (17,49)

    public class P10001191 : RandomPortalForInstance
    {
        public P10001191()
        {
            Init(10001191, 20145000, 45, 43, 46, 44);
        }
    }
    //原始地圖:B-6F(20148000)
    //目標地圖:B-5F(20145000)
    //目標坐標:(44,42) ~ (46,44)

    public class P10001192 : RandomPortalForInstance
    {
        public P10001192()
        {
            Init(10001192, 20148000, 44, 44, 46, 46);
        }
    }
    //原始地圖:B-5F(20145000)
    //目標地圖:B-6F(20148000)
    //目標坐標:(44,44) ~ (46,46)

    public class P10001193 : RandomPortalForInstance
    {
        public P10001193()
        {
            Init(10001193, 20143000, 59, 40, 61, 42);
        }
    }
    //原始地圖:A-5F(20144000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(59,40) ~ (61,42)

    public class P10001194 : RandomPortalForInstance
    {
        public P10001194()
        {
            Init(10001194, 20144000, 15, 44, 17, 46);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:A-5F(20144000)
    //目標坐標:(15,44) ~ (17,46)

    public class P10001195 : RandomPortalForInstance
    {
        public P10001195()
        {
            Init(10001195, 20143000, 88, 40, 90, 42);
        }
    }
    //原始地圖:A-5F(20144000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(88,40) ~ (90,42)

    public class P10001196 : RandomPortalForInstance
    {
        public P10001196()
        {
            Init(10001196, 20144000, 44, 44, 46, 46);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:A-5F(20144000)
    //目標坐標:(44,44) ~ (46,46)

    public class P10001197 : RandomPortalForInstance
    {
        public P10001197()
        {
            Init(10001197, 20143000, 38, 77, 40, 79);
        }
    }
    //原始地圖:B-5F(20145000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(38,77) ~ (40,79)

    public class P10001198 : RandomPortalForInstance
    {
        public P10001198()
        {
            Init(10001198, 20145000, 15, 6, 17, 8);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:B-5F(20145000)
    //目標坐標:(15,6) ~ (17,8)

    public class P10001199 : RandomPortalForInstance
    {
        public P10001199()
        {
            Init(10001199, 20143000, 53, 102, 55, 104);
        }
    }
    //原始地圖:B-5F(20145000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(53,102) ~ (55,104)

    public class P10001200 : RandomPortalForInstance
    {
        public P10001200()
        {
            Init(10001200, 20145000, 44, 6, 46, 8);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:B-5F(20145000)
    //目標坐標:(44,6) ~ (46,8)

    public class P10001201 : RandomPortalForInstance
    {
        public P10001201()
        {
            Init(10001201, 20146000, 181, 130, 183, 132);
        }

    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(181,130) ~ (183,132)

    public class P10001202 : RandomPortalForInstance
    {
        public P10001202()
        {
            Init(10001202, 20143000, 109, 77, 111, 79);
        }

    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(109,77) ~ (111,79)

    public class P10001203 : RandomPortalForInstance
    {
        public P10001203()
        {
            Init(10001203, 20146000, 173, 92, 175, 94);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(173,92) ~ (175,94)

    public class P10001204 : RandomPortalForInstance
    {
        public P10001204()
        {
            Init(10001204, 20143000, 91, 34, 93, 35);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(91,34) ~ (93,35)

    public class P10001205 : RandomPortalForInstance
    {
        public P10001205()
        {
            Init(10001205, 20146000, 173, 114, 175, 116);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(173,114) ~ (175,116)

    public class P10001206 : RandomPortalForInstance
    {
        public P10001206()
        {
            Init(10001206, 20143000, 91, 63, 93, 65);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(91,63) ~ (93,65)

    public class P10001207 : RandomPortalForInstance
    {
        public P10001207()
        {
            Init(10001207, 20146000, 191, 124, 194, 125);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(191,124) ~ (194,125)

    public class P10001208 : RandomPortalForInstance
    {
        public P10001208()
        {
            Init(10001208, 20143000, 116, 77, 120, 79);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(116,77) ~ (120,79)

    public class P10001209 : RandomPortalForInstance
    {
        public P10001209()
        {
            Init(10001209, 20146000, 167, 167, 169, 169);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(167,167) ~ (169,169)

    public class P10001210 : RandomPortalForInstance
    {
        public P10001210()
        {
            Init(10001210, 20143000, 99, 110, 101, 112);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(99,110) ~ (101,112)

    public class P10001211 : RandomPortalForInstance
    {
        public P10001211()
        {
            Init(10001211, 20146000, 148, 156, 150, 158);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(148,156) ~ (150,158)

    public class P10001212 : RandomPortalForInstance
    {
        public P10001212()
        {
            Init(10001212, 20143000, 73, 94, 76, 96);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(73,94) ~ (76,96)

    public class P10001213 : RandomPortalForInstance
    {
        public P10001213()
        {
            Init(10001213, 20146000, 129, 167, 131, 169);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(129,167) ~ (131,169)

    public class P10001214 : RandomPortalForInstance
    {
        public P10001214()
        {
            Init(10001214, 20143000, 48, 109, 50, 111);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(48,109) ~ (50,111)

    public class P10001215 : RandomPortalForInstance
    {
        public P10001215()
        {
            Init(10001215, 20146000, 105, 124, 107, 126);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(105,124) ~ (107,126)

    public class P10001216 : RandomPortalForInstance
    {
        public P10001216()
        {
            Init(10001216, 20143000, 30, 78, 32, 80);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(30,78) ~ (32,80)

    public class P10001217 : RandomPortalForInstance
    {
        public P10001217()
        {
            Init(10001217, 20146000, 124, 114, 126, 115);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(124,114) ~ (126,115)

    public class P10001218 : RandomPortalForInstance
    {
        public P10001218()
        {
            Init(10001218, 20143000, 56, 63, 58, 65);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(56,63) ~ (58,65)

    public class P10001219 : RandomPortalForInstance
    {
        public P10001219()
        {
            Init(10001219, 20146000, 124, 92, 126, 94);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:光之塔下層(20146000)
    //目標坐標:(124,92) ~ (126,94)

    public class P10001220 : RandomPortalForInstance
    {
        public P10001220()
        {
            Init(10001220, 20143000, 55, 33, 57, 35);
        }
    }
    //原始地圖:光之塔下層(20146000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(55,33) ~ (57,35)

    public class P10001221 : RandomPortalForInstance
    {
        public P10001221()
        {
            Init(10001221, 20142000, 63, 12, 66, 14);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:主場館3F(20142000)
    //目標坐標:(63,12) ~ (66,14)

    public class P10001222 : RandomPortalForInstance
    {
        public P10001222()
        {
            Init(10001222, 20143000, 62, 11, 64, 13);
        }
    }
    //原始地圖:主場館3F(20142000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(62,11) ~ (64,13)

    public class P10001223 : RandomPortalForInstance
    {
        public P10001223()
        {
            Init(10001223, 20142000, 83, 12, 86, 14);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:主場館3F(20142000)
    //目標坐標:(83,12) ~ (86,14)

    public class P10001224 : RandomPortalForInstance
    {
        public P10001224()
        {
            Init(10001224, 20143000, 85, 11, 87, 13);
        }
    }
    //原始地圖:主場館3F(20142000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(85,11) ~ (87,13)

    public class P10001225 : RandomPortalForInstance
    {
        public P10001225()
        {
            Init(10001225, 20142000, 132, 94, 134, 97);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:主場館3F(20142000)
    //目標坐標:(132,94) ~ (134,97)

    public class P10001226 : RandomPortalForInstance
    {
        public P10001226()
        {
            Init(10001226, 20143000, 133, 95, 135, 96);
        }
    }
    //原始地圖:主場館3F(20142000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(133,95) ~ (135,96)

    public class P10001227 : RandomPortalForInstance
    {
        public P10001227()
        {
            Init(10001227, 20142000, 122, 113, 124, 115);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:主場館3F(20142000)
    //目標坐標:(122,113) ~ (124,115)

    public class P10001228 : RandomPortalForInstance
    {
        public P10001228()
        {
            Init(10001228, 20143000, 122, 115, 124, 116);
        }
    }
    //原始地圖:主場館3F(20142000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(122,115) ~ (124,116)

    public class P10001229 : RandomPortalForInstance
    {
        public P10001229()
        {
            Init(10001229, 20142000, 25, 112, 26, 114);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:主場館3F(20142000)
    //目標坐標:(25,112) ~ (26,114)

    public class P10001230 : RandomPortalForInstance
    {
        public P10001230()
        {
            Init(10001230, 20143000, 25, 114, 27, 116);
        }
    }
    //原始地圖:主場館3F(20142000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(25,114) ~ (27,116)

    public class P10001231 : RandomPortalForInstance
    {
        public P10001231()
        {
            Init(10001231, 20142000, 15, 94, 17, 97);
        }
    }
    //原始地圖:主場館4F(20143000)
    //目標地圖:主場館3F(20142000)
    //目標坐標:(15,94) ~ (17,97)

    public class P10001232 : RandomPortalForInstance
    {
        public P10001232()
        {
            Init(10001232, 20143000, 14, 94, 16, 96);
        }
    }
    //原始地圖:主場館3F(20142000)
    //目標地圖:主場館4F(20143000)
    //目標坐標:(14,94) ~ (16,96)

    public class P10001233 : RandomPortalForInstance
    {
        public P10001233()
        {
            Init(10001233, 20141000, 57, 82, 59, 84);
        }
    }
    //原始地圖:主場館3F(20142000)
    //目標地圖:主場館2F(20141000)
    //目標坐標:(57,82) ~ (59,84)

    public class P10001234 : RandomPortalForInstance
    {
        public P10001234()
        {
            Init(10001234, 20142000, 65, 79, 67, 81);
        }
    }
    //原始地圖:主場館2F(20141000)
    //目標地圖:主場館3F(20142000)
    //目標坐標:(65,79) ~ (67,81)

    public class P10001235 : RandomPortalForInstance
    {
        public P10001235()
        {
            Init(10001235, 20141000, 90, 64, 92, 67);
        }
    }
    //原始地圖:主場館3F(20142000)
    //目標地圖:主場館2F(20141000)
    //目標坐標:(90,64) ~ (92,67)

    public class P10001236 : RandomPortalForInstance
    {
        public P10001236()
        {
            Init(10001236, 20142000, 82, 67, 84, 70);
        }
    }
    //原始地圖:主場館2F(20141000)
    //目標地圖:主場館3F(20142000)
    //目標坐標:(82,67) ~ (84,70)

    public class P10001237 : RandomPortalForInstance
    {
        public P10001237()
        {
            Init(10001237, 20140000, 70, 14, 72, 17);
        }
    }
    //原始地圖:主場館2F(20141000)
    //目標地圖:主場館1F(20140000)
    //目標坐標:(70,14) ~ (72,17)

    public class P10001238 : RandomPortalForInstance
    {
        public P10001238()
        {
            Init(10001238, 20141000, 69, 10, 71, 13);
        }
    }
    //原始地圖:主場館1F(20140000)
    //目標地圖:主場館2F(20141000)
    //目標坐標:(69,10) ~ (71,13)

    public class P10001239 : RandomPortalForInstance
    {
        public P10001239()
        {
            Init(10001239, 20140000, 77, 14, 79, 17);
        }
    }
    //原始地圖:主場館2F(20141000)
    //目標地圖:主場館1F(20140000)
    //目標坐標:(77,14) ~ (79,17)

    public class P10001240 : RandomPortalForInstance
    {
        public P10001240()
        {
            Init(10001240, 20141000, 78, 10, 80, 13);
        }
    }
    //原始地圖:主場館1F(20140000)
    //目標地圖:主場館2F(20141000)
    //目標坐標:(78,10) ~ (80,13)

    public class P10001241 : RandomPortalForInstance
    {
        public P10001241()
        {
            Init(10001241, 20140000, 127, 99, 129, 101);
        }
    }
    //原始地圖:主場館2F(20141000)
    //目標地圖:主場館1F(20140000)
    //目標坐標:(127,99) ~ (129,101)

    public class P10001242 : RandomPortalForInstance
    {
        public P10001242()
        {
            Init(10001242, 20141000, 129, 100, 131, 102);
        }
    }
    //原始地圖:主場館1F(20140000)
    //目標地圖:主場館2F(20141000)
    //目標坐標:(129,100) ~ (131,102)

    public class P10001243 : RandomPortalForInstance
    {
        public P10001243()
        {
            Init(10001243, 20140000, 123, 107, 125, 109);
        }
    }
    //原始地圖:主場館2F(20141000)
    //目標地圖:主場館1F(20140000)
    //目標坐標:(123,107) ~ (125,109)

    public class P10001244 : RandomPortalForInstance
    {
        public P10001244()
        {
            Init(10001244, 20141000, 124, 108, 126, 110);
        }
    }
    //原始地圖:主場館1F(20140000)
    //目標地圖:主場館2F(20141000)
    //目標坐標:(124,108) ~ (126,110)

    public class P10001245 : RandomPortalForInstance
    {
        public P10001245()
        {
            Init(10001245, 20140000, 25, 107, 27, 109);
        }
    }
    //原始地圖:主場館2F(20141000)
    //目標地圖:主場館1F(20140000)
    //目標坐標:(25,107) ~ (27,109)

    public class P10001246 : RandomPortalForInstance
    {
        public P10001246()
        {
            Init(10001246, 20141000, 23, 108, 25, 110);
        }
    }
    //原始地圖:主場館1F(20140000)
    //目標地圖:主場館2F(20141000)
    //目標坐標:(23,108) ~ (25,110)

    public class P10001247 : RandomPortalForInstance
    {
        public P10001247()
        {
            Init(10001247, 20140000, 20, 99, 22, 101);
        }
    }
    //原始地圖:主場館2F(20141000)
    //目標地圖:主場館1F(20140000)
    //目標坐標:(20,99) ~ (22,101)

    public class P10001248 : RandomPortalForInstance
    {
        public P10001248()
        {
            Init(10001248, 20141000, 18, 100, 20, 102);
        }
    }
    //原始地圖:主場館1F(20140000)
    //目標地圖:主場館2F(20141000)
    //目標坐標:(18,100) ~ (20,102)

    public class P10001249 : RandomPortalForInstance
    {
        public P10001249()
        {
            Init(10001249, 10070000, 199, 98, 201, 101);
        }
    }
    //原始地圖:主場館1F(20140000)
    //目標地圖:光之塔周邊(10070000)
    //目標坐標:(199,98) ~ (201,101)

    public class P10001250 : RandomPortalForInstance
    {
        public P10001250()
        {
            Init(10001250, 20140000, 110, 51, 112, 54);
        }
    }
    //原始地圖:光之塔周邊(10070000)
    //目標地圖:主場館1F(20140000)
    //目標坐標:(110,51) ~ (112,54)

    public class P10001251 : RandomPortalForInstance
    {
        public P10001251()
        {
            Init(10001251, 10070000, 146, 187, 151, 189);
        }
    }
    //原始地圖:主場館1F(20140000)
    //目標地圖:光之塔周邊(10070000)
    //目標坐標:(146,187) ~ (151,189)

    public class P10001252 : RandomPortalForInstance
    {
        public P10001252()
        {
            Init(10001252, 20140000, 72, 116, 77, 118);
        }
    }
    //原始地圖:光之塔周邊(10070000)
    //目標地圖:主場館1F(20140000)
    //目標坐標:(72,116) ~ (77,118)

    public class P10001253 : RandomPortalForInstance
    {
        public P10001253()
        {
            Init(10001253, 10070000, 97, 98, 99, 102);
        }
    }
    //原始地圖:主場館1F(20140000)
    //目標地圖:光之塔周邊(10070000)
    //目標坐標:(97,98) ~ (99,102)

    public class P10001254 : RandomPortalForInstance
    {
        public P10001254()
        {
            Init(10001254, 20140000, 37, 52, 39, 55);
        }
    }
    //原始地圖:光之塔周邊(10070000)
    //目標地圖:主場館1F(20140000)
    //目標坐標:(37,52) ~ (39,55)

    public class P10001257 : RandomPortalForInstance
    {
        public P10001257()
        {
            Init(10001257, 10062000, 186, 64, 187, 65);
        }
    }
    public class P10001413 : RandomPortalForInstance
    {
        public P10001413()
        {
            Init(10001413, 20154002, 15, 8, 17, 10);
        }
    }
    //原始地圖:A-19F(20155002)
    //目標地圖:A-20F(20154002)
    //目標坐標:(15,8) ~ (17,10)

    public class P10001414 : RandomPortalForInstance
    {
        public P10001414()
        {
            Init(10001414, 20154002, 44, 8, 46, 10);
        }
    }
    //原始地圖:A-19F(20155002)
    //目標地圖:A-20F(20154002)
    //目標坐標:(44,8) ~ (46,10)

    public class P10001421 : RandomPortalForInstance
    {
        public P10001421()
        {
            Init(10001421, 20155001, 15, 44, 17, 46);
        }
    }
    //原始地圖:A-14F(20154001)
    //目標地圖:A-15F(20155001)
    //目標坐標:(15,44) ~ (17,46)

    public class P10001422 : RandomPortalForInstance
    {
        public P10001422()
        {
            Init(10001422, 20155001, 44, 44, 46, 46);
        }
    }
    //原始地圖:A-14F(20154001)
    //目標地圖:A-15F(20155001)
    //目標坐標:(44,44) ~ (46,46)
    public class P10001419 : RandomPortalForInstance
    {
        public P10001419()
        {
            Init(10001419, 20154001, 15, 42, 17, 44);
        }
    }
    //原始地圖:A-15F(20155001)
    //目標地圖:A-14F(20154001)
    //目標坐標:(15,42) ~ (17,44)

    public class P10001420 : RandomPortalForInstance
    {
        public P10001420()
        {
            Init(10001420, 20154001, 44, 42, 46, 44);
        }
    }
    //原始地圖:A-15F(20155001)
    //目標地圖:A-14F(20154001)
    //目標坐標:(44,42) ~ (46,44)

    public class P10001409 : RandomPortalForInstance
    {
        public P10001409()
        {
            Init(10001409, 20161000, 14, 42, 16, 44);
        }
    }
    //原始地圖:A-20F(20154002)
    //目標地圖:A-21F(20161000)
    //目標坐標:(14,42) ~ (16,44)

    public class P10001410 : RandomPortalForInstance
    {
        public P10001410()
        {
            Init(10001410, 20161000, 43, 42, 45, 44);
        }
    }
    //原始地圖:A-20F(20154002)
    //目標地圖:A-21F(20161000)
    //目標坐標:(43,42) ~ (45,44)
    public class P10001417 : RandomPortalForInstance
    {
        public P10001417()
        {
            Init(10001417, 20158000, 14, 4, 16, 6);
        }
    }
    //原始地圖:A-15F(20155001)
    //目標地圖:A-16F(20158000)
    //目標坐標:(14,4) ~ (16,6)

    public class P10001418 : RandomPortalForInstance
    {
        public P10001418()
        {
            Init(10001418, 20158000, 43, 4, 45, 6);
        }
    }
    //原始地圖:A-15F(20155001)
    //目標地圖:A-16F(20158000)
    //目標坐標:(43,4) ~ (45,6)
}
public class P10001423 : RandomPortalForInstance
{
    public P10001423()
    {
        Init(10001423, 20157000, 15, 8, 17, 10);
    }
}
//原始地圖:A-14F(20154001)
//目標地圖:A-13F(20157000)
//目標坐標:(15,8) ~ (17,10)

public class P10001424 : RandomPortalForInstance
{
    public P10001424()
    {
        Init(10001424, 20157000, 44, 8, 46, 10);
    }
}
//原始地圖:A-14F(20154001)
//目標地圖:A-13F(20157000)
//目標坐標:(44,8) ~ (46,10)