using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

namespace SagaScript.Chinese.Enums
{
    public enum Neko_04
    {
        //凱堤(山吹)
        山吹任務開始 = 0x1,
        詢問有關無法前進的事情 = 0x2,
        向古董商店店員詢問有關結界的事情 = 0x4,
        水晶共振體製作完成 = 0x8,

        //TT的标示
        任務開始 = 0x100,//_Xb19
        任務結束 = 0x200,//_Xb20
        收到商人的傳達品 = 0x400,//_6A37
        交出商人的傳達品 = 0x800,//_6A36
        被告知襲擊 = 0x1000,//_6A38
        與嚮導對話 = 0x2000,//_6A39
        被詢問犯人的事 = 0x4000,//_6A40
        被告知去找機器人 = 0x8000,//_6A41
        被告知犯人是小孩 = 0x10000,//_6A42
        被告知未見過小孩 = 0x20000,//_6A43
        碰到看不見的墻 = 0x40000,//_6A44
        告知關卡的事情 = 0x80000,//_6A45
        製作共振體 = 0x100000,//_6A52
        與小孩對話 = 0x200000,//_6A46
        拿回不明部品 = 0x400000,//_6A47
        交回不明部品 = 0x800000,//_6A48
        返回彙報結果 = 0x1000000,//_6A50
        超重 = 0x2000000,//_6A51
    }
}
