using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M30157000
{
    public class S11001070 : Event
    {
        public S11001070()
        {
            this.EventID = 11001070;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 0, 131, "咇咇咇咇！咇咇咇~~~！$R;", "通信機");
            Say(pc, 255, "代表先生$R;" +
                "$R警備機器人來電話了。$R;");
            Say(pc, 11001052, 131, "接一下$R;");
            Say(pc, 0, 131, "咇咇咇咇！咇咇咇~~~！$R;" +
                "$P這裡是警備機器人$R;" +
                "發現行會評議會通緝的犯人$R;" +
                "$R我們要開始追擊了$R;", "通信機");
            Say(pc, 11001052, 131, "嗯$R;");
            Say(pc, 0, 131, "進入偏僻住宅街的民家了。$R;", "通信機");
            Say(pc, 11001052, 131, "家裡的情況怎麼樣？$R;");
            Say(pc, 0, 131, "我們需要小型偵察機器人呀。$R;" +
                "$P……$R;" +
                "$P啊，回來了$R;" +
                "嗯…不…不$R;", "通信機");
            Say(pc, 11001052, 131, "怎麼了，快點說$R;");
            Say(pc, 0, 131, "看樣子要把小狗$R廣場的小狗賣到國外去。$R;", "通信機");
            Say(pc, 11001052, 131, "什麼？$R;" +
                "馬上逮捕。$R;");
            Say(pc, 0, 131, "知道了$R;" +
                "$P轟！轟！轟！$R;" +
                "$P警備機器人，把手舉起來。$R;" +
                "$P什麼呀，這是？$R;" +
                "$R被發現了，沒辦法，$R;" +
                "全消滅掉$R;" +
                "$P轟！轟！$R;" +
                "$P啪！轟！$R;" +
                "$P啪！啪！啪！$R;" +
                "$R哇，太強大了$R;" +
                "投降！！投降！！$R;" +
                "$P代表，已經逮捕了犯人$R;" +
                "小狗安然無恙。$R;", "通信機");
            Say(pc, 11001052, 131, "哦，警備機器人$R;" +
                "做的太棒了$R;" +
                "大家鼓掌吧$R;");
            Say(pc, 255, "拍拍拍拍……$R;");
            Say(pc, 11001052, 131, "守住了唐卡市的和平$R;" +
                "但我們不可以鬆懈呀$R;" +
                "為了防止事件發生，$R;" +
                "為了唐卡市的和平，$R;" +
                "我們馬上恢復警備工作。$R;" +
                "燃燒起來吧，警備機器人。$R;");
            Say(pc, 0, 131, "知道了$R;", "通信機");
            Say(pc, 255, "以上，報告結束。$R;");
        }
    }
}