using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;
//所在地圖:東方海角(10018003) NPC基本信息:冒險者前輩(11001431) X:64 Y:56
namespace SagaScript.M10018003
{
    public class S11001431 : Event
    {
        public S11001431()
        {
            this.EventID = 11001431;
        }

        public override void OnEvent(ActorPC pc)
        {
            int selection;

            Say(pc, 11001431, 0, "您好!$R;" +
                                 "$R剛開始冒險的人們，$R;" +
                                 "正在談論關於隊伍和軍團系統喔!$R;" +
                                 "$R要一起聽聽嗎?$R;", "冒險者前輩");

            selection = Select(pc, "聽關於哪一方面的情報呢?", "", "關於「隊伍」", "關於「軍團」", "關於「聊天視窗」", "關於「朋友訊息視窗」", "關於「廣告目錄」", "沒有必要");

            while (selection != 6)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11001431, 0, "隊伍指的是$R;" +
                                             "一起戰鬥或完成任務的同伴。$R;" +
                                             "$P隊伍中最多一共有8人。$R;" +
                                             "$R隊員在同一個區域時，$R;" +
                                             "可以互相分享經驗值喔!$R;" +
                                             "$P不過要注意等級的差異。$R;" +
                                             "$R等級低時，$R;" +
                                             "即使打敗等級很高的魔物，$R;" +
                                             "也有可能得不到經驗值唷!$R;" +
                                             "$P經驗值的分配，$R;" +
                                             "會根據本身等級的高低而有所不同喔!$R;" +
                                             "最好找等級相近的同伴，$R;" +
                                             "或打適合的魔物，才練得快唷!$R;" +
                                             "$P至於組隊的方法。$R;" +
                                             "$P請點擊右鍵，選擇想邀請的對象後，$R;" +
                                             "按下「邀請加入隊伍」的選項即可。$R;" +
                                             "$P突然邀請對方，會讓對方困擾的，$R;" +
                                             "請先好好打招呼後，再邀請吧!$R;" +
                                             "想退出隊伍時，$R;" +
                                             "點擊右鍵選擇「退出隊伍」即可。$R;" +
                                             "$P組織隊伍的人想解散隊伍時，$R;" +
                                             "選擇「解散隊伍」即可。$R;", "冒險者前輩");
                        break;

                    case 2:
                        Say(pc, 11001431, 0, "把軍團當作是半永久性的隊伍也可以喔!$R;" +
                                             "$P軍團最初可以登記的人數為16人。$R;" +
                                             "$R日後軍團名聲增加了，$R;" +
                                             "就可以增加人數的上限，$R;" +
                                             "所以可以放心繼續的交朋友唷!$R;" +
                                             "$P軍團的管理員在「阿高普路斯市」，$R;" +
                                             "想組織軍團時，找管理員就可以了。$R;" +
                                             "$P至於組織軍團的方法，$R;" +
                                             "找軍團管理者問問吧!$R;" +
                                             "$R現在告訴您，也說不清楚的。$R;", "冒險者前輩");
                        break;

                    case 3:
                        Say(pc, 11001431, 0, "聊天視窗指的是，輸入對話的地方。$R;" +
                                             "$R旁邊有長長的視窗吧?$R;" +
                                             "那個就是聊天視窗了。$R;" +
                                             "$P左邊有「O」「P」「R」「W」鍵吧?$R;" +
                                             "$P沒錯!$R;" +
                                             "$R「O」鍵是公開聊天模式，$R;" +
                                             "「P」鍵是隊伍聊天模式，$R;" +
                                             "「R」鍵是軍團聊天模式，$R;" +
                                             "「W」鍵是悄悄話聊天模式。$R;" +
                                             "$P公開聊天是給周圍所有人，$R;" +
                                             "隊伍聊天只給隊員…$R;" +
                                             "$P悄悄話是進行1對1聊天時使用的。$R;" +
                                             "$R只要點擊「W」鍵，$R;" +
                                             "利用悄悄話視窗，$R;" +
                                             "就可以跟指定的人說話唷!$R;", "冒險者前輩");
                        break;

                    case 4:
                        Say(pc, 11001431, 0, "用主視窗的「朋友」鍵，$R;" +
                                             "打開朋友目錄吧!$R;" +
                                             "$P…$R;" +
                                             "$P打開了嗎?$R;" +
                                             "$P現在說明朋友目錄裡的，$R;" +
                                             "「朋友」、「軍團」、「隊伍」。$R;" +
                                             "$P「朋友」目錄儲存$R;" +
                                             "有關已登記的朋友的資料唷!$R;" +
                                             "$P如果是已登記的朋友，$R;" +
                                             "您可以知道是否在線。$R;" +
                                             "$R在線的話，$R;" +
                                             "也可以知道對方的位置呀!$R;" +
                                             "$P登記的方法很簡單啊!$R;" +
                                             "$R想成為朋友，$R;" +
                                             "只要點擊右鍵，$R;" +
                                             "選擇「新增朋友目錄」就可以了。$R;" +
                                             "$P您如果是軍團的總管，$R;" +
                                             "也可以用類似的方法邀請$R;" +
                                             "其他人加入您的軍團唷!$R;" +
                                             "$P在「軍團」裡，$R;" +
                                             "可以確認軍團成員的訊息。$R;" +
                                             "$R在「隊伍」裡，$R ;" +
                                             "可以確認隊伍成員的訊息。$R;" +
                                             "$P再一個小小的提示吧!$R;" +
                                             "$R在朋友目錄選擇名字後，點擊右鍵…$R;" +
                                             "$R就可以使用悄悄話聊天喔!$R;", "冒險者前輩");
                        break;

                    case 5:
                        Say(pc, 11001431, 0, "至於廣告目錄呢!$R;" +
                                             "在組成隊伍，$R;" +
                                             "或跟同伺服的玩家打招呼，$R;" +
                                             "或交換情報時使用，$R;" +
                                             "是個非常方便的功能唷!$R;" +
                                             "$P對自己點擊滑鼠右鍵。$R;" +
                                             "$R看到「招募廣告登陸」$R;" +
                                             "「招募廣告目錄」了吧?$R;" +
                                             "$R先選目錄吧!$R;" +
                                             "$P選擇「招募廣告目錄」後。$R;" +
                                             "$P可以詳細顯示現在招募的人喔!$R;" +
                                             "$R還可以看到那些人現在在哪裡?$R;" +
                                             "$P招募的人的名字右邊有，$R;" +
                                             "「P」和「W」鍵，看見了嗎?$R;" +
                                             "$P按「P」鍵，$R;" +
                                             "可以申請參加這個人的隊伍。$R;" +
                                             "$R按「W」鍵，$R;" +
                                             "就會顯示悄悄話視窗唷。$R;" +
                                             "$R但突然申請隊伍，$R;" +
                                             "對方會不知所措的，$R;" +
                                             "先好好跟對方說悄悄話再邀請吧!$R;" +
                                             "$P如果自己想招募成員的話，$R;" +
                                             "右擊自己，在顯示的目錄中$R;" +
                                             "選擇「招募廣告登陸」就可以了。$R;", "冒險者前輩");
                        break;
                }

                selection = Select(pc, "聽關於哪一方面的情報呢?", "", "關於「隊伍」", "關於「軍團」", "關於「聊天視窗」", "關於「朋友訊息視窗」", "關於「廣告目錄」", "沒有必要");
            }

            Say(pc, 11001431, 0, "現在關於隊伍和軍團的情報，$R;" +
                                 "都明白了嗎?$R;" +
                                 "$P不太清楚的話，就問周圍的人吧?$R;" +
                                 "$R詢問也是交流的好方法唷!$R;" +
                                 "$P那麼加油吧!!$R;", "冒險者前輩");
        }
    }
}
