using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

namespace SagaScript.Chinese.Enums
{
    public enum Tinyis_Land_01
    {
        //泰迪島

        //泰迪
        已經與泰迪進行第一次對話 = 0x1,
        //湖邊的泰迪
        已經與湖邊的泰迪進行第一次對話 = 0x2,
        //湖畔的微微
        已經與湖畔的微微進行第一次對話 = 0x4,
        //行會商人
        已經與行會商人進行第一次對話 = 0x8,
        //咖啡館店員
        已經與咖啡館店員進行第一次對話 = 0x10,
        //工作的泰迪
        去過ECO城 = 0x20,
        //5A40 
        跟泰迪的伙伴们打完招呼 = 0x40,
        //5A31
        跟活動木偶愛伊斯打完招呼 = 0x80,
        //5A32
        跟活動木偶瑪歐斯打完招呼 = 0x100,
        //5A33
        跟活動木偶綠礦石精靈打完招呼 = 0x200,
        //5A34
        跟活動木偶塞爾曼德打完招呼 = 0x400,
        //5A35
        跟活動木偶曼陀蘿打完招呼 = 0x600,
        //5A36
        跟活動木偶虎姆拉打完招呼 = 0x800,
        //5A37
        跟活動木偶塔依打完招呼 = 0x1000,
        //5A38
        跟活動木偶皮諾打完招呼 = 0x2000,
        //5A45 10014052指导地图
        指导地图的泰迪标示去过泰迪岛 = 0x4000,

    }
}
