using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaScript.Chinese.Enums;
namespace SagaScript.M12021000
{
    public class S11001673 : Event
    {
        public S11001673()
        {
            this.EventID = 11001673;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 132, "你有聽說過軍艦島$R;" +
            "晚上會有精靈出現嗎？$R;", "レジスタンス");

            Say(pc, 11001674, 65535, "我曾經看過呢……。$R;" +
            "$R那個妖精把虜走$R;" +
            "在人們離開的一瞬間……。$R;", "レジスタンス");

            Say(pc, 131, "哈...哈哈...。$R;", "レジスタンス");

            Say(pc, 11001674, 65535, "不，不是在胡扯唷！$R;" +
            "請相信我！$R;", "レジスタンス");

            Say(pc, 131, "根據我打聽到的$R;" +
            "就是有點黑暗的力量$R;" +
            "會和某一些人說話什麼的。$R;", "レジスタンス");

            Say(pc, 11001674, 65535, "住、住手！$R;" +
            "我不想聽到這樣的說話！$R;", "レジスタンス");

            Say(pc, 131, "原來如此……。$R;" +
            "原來對我$R;" +
            "有異常大的興趣呢……。$R;", "レジスタンス");

            Say(pc, 11001674, 131, "你...可以再早一點....？$R;", "レジスタンス");
           }

           }
                        
                }
/*Say(pc, 132, "軍艦島に夜になると現れると言う$R;" +
            "妖精の話をご存知ですか？$R;", "レジスタンス");

            Say(pc, 11001674, 65535, "オレ見ちまったんだよ……。$R;" +
            "$Rその妖精が人をさらって$R;" +
            "行く瞬間をよ……。$R;", "レジスタンス");

            Say(pc, 131, "ほほぉ……。$R;", "レジスタンス");

            Say(pc, 11001674, 65535, "う、嘘じゃないんだ！$R;" +
            "信じてくれよ！$R;", "レジスタンス");

            Say(pc, 131, "僕が聞いた話によると$R;" +
            "闇の力がどうたらこうたらと$R;" +
            "語りかけてくるようですよ。$R;", "レジスタンス");

            Say(pc, 11001674, 65535, "や、やめてくれよ！$R;" +
            "そんな話は聞きたくない！$R;", "レジスタンス");

            Say(pc, 131, "そうですか……。$R;" +
            "僕としては非常に興味が$R;" +
            "あるのですが……。$R;", "レジスタンス");

            Say(pc, 11001674, 131, "お前……早まるなよ……？$R;", "レジスタンス"*/
            
            
        
     
    

