using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaScript.Chinese.Enums;
namespace SagaScript.M12021000
{
    public class S11001674 : Event
    {
        public S11001674()
        {
            this.EventID = 11001674;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 112, "我曾經看見過。$R;", "レジスタンス");

            Say(pc, 11001673, 131, "什麼？$R;", "レジスタンス");

            Say(pc, 65535, "那隻妖精在人們離開的瞬間$R;" +
            "把人們虜走……。$R;", "レジスタンス");

            Say(pc, 11001673, 131, "什麼？！你在說笑吧！$R;" +
            "請你不要再說了。$R;", "レジスタンス");

            Say(pc, 65535, "這不是在胡扯！$R;" +
            "相信我！$R;", "レジスタンス");

            Say(pc, 11001673, 132, "的、的而且確近日有收到$R;" +
            "有不明來歷的人出現的報告，但$R;" +
            "……這又有什麼關係。$R;", "レジスタンス");

            Say(pc, 65535, "不知道，我不清楚。雖然如此，$R;" +
            "但是我又被那樣危險的東西$R;" +
            "吸引到了……。$R;", "レジスタンス");

            Say(pc, 11001673, 132, "沒有人詛咒過意外看到的神吧～$R;", "レジスタンス");
           }

           }
                        
                }
/*{
            Say(pc, 112, "オレ見ちまったんだよ……。$R;", "レジスタンス");

            Say(pc, 11001673, 131, "何をですか？$R;", "レジスタンス");

            Say(pc, 65535, "軍艦島に居る妖精が人をさらって$R;" +
            "行く瞬間をよ……。$R;", "レジスタンス");

            Say(pc, 11001673, 131, "え？！そんな、冗談$R;" +
            "言わないでくださいよ。$R;", "レジスタンス");

            Say(pc, 65535, "う、嘘じゃないんだ！$R;" +
            "信じてくれよ！$R;", "レジスタンス");

            Say(pc, 11001673, 132, "た、確かに最近、行方不明者が$R;" +
            "出ているとの報告は受けていますが$R;" +
            "……何か関係が。$R;", "レジスタンス");

            Say(pc, 65535, "わからねぇ、わからねぇけど$R;" +
            "あいつは危険だと言うことは$R;" +
            "オレにはわかる……。$R;", "レジスタンス");

            Say(pc, 11001673, 132, "触らぬ神に祟り無し……ですね。$R;", "レジスタンス");
           }*/
            
            
        
     
    
