using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
//所在地圖:下城(10024000) NPC基本信息:街上的男孩(11000049) X:128 Y:156
namespace SagaScript.M10024000
{
    public class S11000049 : Event
    {
        public S11000049()
        {
            this.EventID = 11000049;
        }

        public override void OnEvent(ActorPC pc)
        {

            if (CountItem(pc, 10001080) > 0)
            {
                萬聖節(pc);
            }

            蒐集魔法書的碎片(pc);
        }

        void 蒐集魔法書的碎片(ActorPC pc)
        {
            BitMask<Badge_01> Badge_01_mask = new BitMask<Badge_01>(pc.CMask["Badge_01"]);                                                                              //任務：蒐集魔法書的碎片

            if (!Badge_01_mask.Test(Badge_01.已經與街上的男孩進行第一次對話))
            {
                初次與街上的男孩進行對話(pc);
                return;
            }

            if (CountItem(pc, 10019900) >= 10)
            {
                if (CheckInventory(pc, 10009500, 1))
                {
                    if (pc.Gender == PC_GENDER.MALE)
                    {
                        Say(pc, 11000049, 131, "大哥哥，真的很谢谢你!$R;" +
                                               "$R用10张『撕破的魔法书』$R;" +
                                               "完成了魔法书一页。$R;" +
                                               "$P作为答谢，这个送给你吧!$R;" +
                                               "$R很像闪耀的星星吧!!$R;" +
                                               "$P我还有很多的，$R;" +
                                               "所以这个送给大哥哥吧。$R;", "街上的男孩");

                        TakeItem(pc, 10019900, 10);
                        GiveItem(pc, 10009500, 1);
                        Say(pc, 0, 0, "得到『铜徽章』!$R;", " ");
                    }
                    else
                    {
                        Say(pc, 11000049, 131, "大姐姐，真的很谢谢你!$R;" +
                                               "$R用10张『撕破的魔法书』$R;" +
                                               "完成了魔法书一页。$R;" +
                                               "$P作为答谢，这个送给你吧!$R;" +
                                               "$R很像闪耀的星星吧!!$R;" +
                                               "$P我还有很多的，$R;" +
                                               "所以这个送给大姐姐吧。$R;", "街上的男孩");

                        TakeItem(pc, 10019900, 10);
                        GiveItem(pc, 10009500, 1);
                        Say(pc, 0, 0, "得到『铜徽章』!$R;", " ");
                    }
                }
                else
                {
                    Say(pc, 11000049, 131, "哇，竟然是『撕破的魔法书』!$R;" +
                                           "$R唔哇哇，是真的啊!$R;" +
                                           "$P我会好好答谢您的，$R;" +
                                           "请把行李减轻以后再来吧!$R;", "街上的男孩");
                }
            }
            else
            {
                Say(pc, 11000049, 131, "10张『撕破的魔法书』$R;" +
                                       "等于魔法书1页的分量。$R;" +
                                       "$R…嘿嘿，$R;" +
                                       "如果能一次收集10张拿来给我的话，$R;" +
                                       "就太好了…$R;", "街上的男孩");
            }
        }

        void 初次與街上的男孩進行對話(ActorPC pc)
        {
            BitMask<Badge_01> Badge_01_mask = new BitMask<Badge_01>(pc.CMask["Badge_01"]);                                                                              //任務：蒐集魔法書的碎片

            if (pc.Gender == PC_GENDER.MALE)
            {
                Say(pc, 11000049, 131, "大哥哥，你好!$R;" +
                                       "$P大哥哥是专门讨伐魔物的冒险家吧?$R;" +
                                       "$P我有一个小小的困扰，$R;" +
                                       "$R请大哥哥帮帮我吧!!$R;", "街上的男孩");

                switch (Select(pc, "拜托，帮忙我一下啦!!", "", "好的好的…知道了", "我讨厌小孩子"))
                {
                    case 1:
                        Badge_01_mask.SetValue(Badge_01.已經與街上的男孩進行第一次對話, true);

                        Say(pc, 11000049, 131, "大哥哥，谢谢你!$R;" +
                                               "$P那个，我不小心弄丢了东西。$R;" +
                                               "$R是本好几千页的『魔法书』，$R;" +
                                               "是老师交给我的重要东西。$R;" +
                                               "$P到这个世界的时候，$R;" +
                                               "因为发生了一些特别状况，$R;" +
                                               "所以都散掉了…$R;" +
                                               "$R被老师知道的话，$R;" +
                                               "肯定会狠狠的惩罚我的。$R;" +
                                               "$P大哥哥，拜托你了!$R;" +
                                               "$R帮我找一下『撕破的魔法书』吧!$R;", "街上的男孩");
                        break;

                    case 2:
                        Say(pc, 11000049, 131, "…呜咽。$R;", "街上的男孩");
                        break;
                }
            }
            else
            {
                Say(pc, 11000049, 131, "大姐姐，你好!$R;" +
                                       "$P大姐姐是专门讨伐魔物的冒险家吧?$R;" +
                                       "$P我有一个小小的困扰，$R;" +
                                       "$R请大姐姐帮帮我吧!!$R;", "街上的男孩");

                switch (Select(pc, "拜托，帮忙我一下啦!!", "", "好的好的…知道了", "我讨厌小孩子"))
                {
                    case 1:
                        Badge_01_mask.SetValue(Badge_01.已經與街上的男孩進行第一次對話, true);

                        Say(pc, 11000049, 131, "大姐姐，谢谢你!$R;" +
                                               "$P那个，我不小心弄丢了东西。$R;" +
                                               "$R是本好几千页的『魔法书』，$R;" +
                                               "是老师交给我的重要东西。$R;" +
                                               "$P到这个世界的时候，$R;" +
                                               "因为发生了一些特别状况，$R;" +
                                               "所以都散掉了…$R;" +
                                               "$R被老师知道的话，$R;" +
                                               "肯定会狠狠的惩罚我的。$R;" +
                                               "$P大姐姐，拜托你了!$R;" +
                                               "$R帮我找一下『撕破的魔法书』吧!$R;", "街上的男孩");
                        break;

                    case 2:
                        Say(pc, 11000049, 131, "…呜咽。$R;", "街上的男孩");
                        break;
                }
            }
        }

        void 萬聖節(ActorPC pc)
        {
            Say(pc, 131, "お化けなんていないもん！$R;" +
            "いないったら、いないんだもん！$R;", "街の男の子");
            switch (Select(pc, "何をする？", "", "普通に話しかける", "『秘密のキャンディ』を渡す"))
            {
                case 1:
                    蒐集魔法書的碎片(pc);
                    break;
                case 2:
                    Say(pc, 131, "これ、僕に？$R;" +
                    "わーい、ありがとう！$R;" +
                    "$Rお化けから身を守る$R;" +
                    "不思議なキャンディ嬉しいな！$R;", "街の男の子");
                    TakeItem(pc, 10001080, 1);
                    Say(pc, 131, "お礼にいいものあげる！$R;", "街の男の子");
                    switch (Select(pc, "想要哪一样礼物呢?", "", "南瓜头", "南瓜纹中统袜♀", "南瓜花圃"))
                    {
                        case 1:
                            GiveItem(pc, 50024357, 1);
                            Say(pc, 11000049, 131, "作为答谢送你我亲手做的『南瓜头』!$R;" +
                                                   "$R把这个戴在头上的话，$R;" +
                                                   "像鬼怪那样的魔物都不敢打扰你的!$R;" +
                                                   "$P…应该是吧…$R;", "街上的男孩");
                            break;
                        case 2:
                            GiveItem(pc, 50011250, 1);
                            Say(pc, 11000049, 131, "作为答谢送给你『南瓜纹中统袜♀』!$R;", "街上的男孩");
                            break;
                        case 3:
                            GiveItem(pc, 31160200, 1);
                            Say(pc, 11000049, 131, "作为答谢送给你『南瓜花圃』!$R;", "街上的男孩");
                            break;
                    }
                    break;
            }
        }
    }
}