using System;
using System.Collections.Generic;
using System.Text;

using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
//所在地圖:泰迪島(10071000) NPC基本信息:正在工作的泰迪(11000726) X:62 Y:210
namespace SagaScript.M10071000
{
    public class S11000726 : Event
    {
        public S11000726()
        {
            this.EventID = 11000726;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Tinyis_Land_01> mask = pc.CMask["Tinyis_Land_01"];

            if (pc.Account.GMLevel >= 100)
            {
                if (Select(pc, "去ECO城嗎？", "", "去", "不去") == 1)
                {
                    NPCMove(pc, 11000726, 62, 210, 0, 7, 111, 200);
                    ShowEffect(pc, 11000726, 5314);
                    NPCMove(pc, 11000717, 62, 210, 100, 7, 111, 65535);
                    NPCMove(pc, 11000718, 62, 210, 100, 7, 111, 65535);
                    NPCMove(pc, 11000738, 62, 210, 100, 7, 111, 65535);
                    Wait(pc, 990);
                    ShowEffect(pc, 4011);
                    ShowEffect(pc, 11000726, 5314); 
                    Wait(pc, 990);
                    Warp(pc, 11027000, 252, 7);
                    NPCShow(pc, 11001833);
                }
                return;
            }
            else
            //if (pc.Fame > 6) 名聲限制,暫時取消
            {
                if (!mask.Test(Tinyis_Land_01.去過ECO城))
                {
                    Say(pc, 0, 65535, "吶、知道嗎？$R;", "泰迪1號");
                    //Say(pc, 0, 65535, "ねえ、知ってる？$R;", "タイニー1号");
                    switch (Select(pc, "知道嗎？", "", "不知道", "甚麼？"))
                    //switch (Select(pc, "知ってる？", "", "知らない", "何を？"))
                    {
                        case 1:
                            Say(pc, 0, 65535, "彩虹呢、實際是一道路。$R;", "泰迪2號");
                            Say(pc, 0, 65535, "延伸到附近的便利店的道路。$R;" +
                                "$R延伸到世界裏側的國度的道路。$R;" +
                                "$R向著你的未來延伸的道路。$R;", "泰迪3號");
                            Say(pc, 0, 65535, "如你所願$R;" +
                            "真的、哪裡都能去。$R;", "泰迪4號");
                            Say(pc, 0, 65535, "其實、在這天空中$R;" +
                            "有很多彩虹！$R;" +
                            "$R……雖然沒能看見。$R;", "泰迪1號");
                            Say(pc, 0, 65535, "咕囑咕囑囑！$R;" +
                            "$R那麼好吧！$R;" +
                            "知道彩虹的交差點嗎？$R;", "泰迪4號");
                            /*
                            Say(pc, 0, 65535, "レインボーはねぇ、実は道なんだ。$R;", "タイニー2号");
                            Say(pc, 0, 65535, "近所のコンビニに続く道。$R;" +
                            "$R世界の裏側の国に続く道。$R;" +
                            "$R君の未来へと続く道。$R;", "タイニー3号");
                            Say(pc, 0, 65535, "君が望めば$R;" +
                            "本当に、どこにでも行けるんだ。$R;", "タイニー4号");
                            Say(pc, 0, 65535, "実は、この空には$R;" +
                            "レインボーがい～っぱい！$R;" +
                            "$R……みえないけどね。$R;", "タイニー1号");
                            Say(pc, 0, 65535, "クスクスッ！$R;" +
                            "$Rじゃあさ！$R;" +
                            "レインボーの交差点って知ってる？$R;", "タイニー2号");
                            */
                            break;
                        case 2:
                            Say(pc, 0, 65535, "彩虹呢、實際是一道路。$R;", "泰迪2號");
                            Say(pc, 0, 65535, "延伸到附近的便利店的道路。$R;" +
                                "$R延伸到世界裏側的國度的道路。$R;" +
                                "$R向著你的未來延伸的道路。$R;", "泰迪3號");
                            Say(pc, 0, 65535, "如你所願$R;" +
                            "真的、哪裡都能去。$R;", "泰迪4號");
                            Say(pc, 0, 65535, "其實、在這天空中$R;" +
                            "有很多彩虹！$R;" +
                            "$R……雖然沒能看見。$R;", "泰迪1號");
                            Say(pc, 0, 65535, "咕囑咕囑囑！$R;" +
                            "$R那麼好吧！$R;" +
                            "知道彩虹的交差點嗎？$R;", "泰迪4號");
                            break;
                    }

                    switch (Select(pc, "知道嗎？", "", "不知道", "知道"))
                    //switch (Select(pc, "知ってる？", "", "知らない", "知ってる"))
                    {
                        case 1:

                            Say(pc, 0, 65535, "彩虹交差之處。$R;" +
                             "非此處、非彼處。$R;", "泰迪3號");
                            Say(pc, 0, 65535, "像中轉站的樣子？$R;", "泰迪4號");
                            Say(pc, 0, 65535, "誒ー、不是吧！？$R;", "泰迪1號");
                            Say(pc, 0, 65535, "呼呼呼續！$R;" +
                            "吶、要走走看嗎？$R;" +
                            "到彩虹交差之處！$R;", "泰迪2號");
                            Say(pc, 0, 65535, "當然了！$R;" +
                            "吶！？$R;", "泰迪3號");
                            /*
                            Say(pc, 0, 65535, "レインボーが交差する場所。$R;" +
                             "ここではない、どこでもない場所。$R;", "タイニー3号");
                            Say(pc, 0, 65535, "中継地点みたいなもんかな？$R;", "タイニー4号");
                            Say(pc, 0, 65535, "えー、違うでしょ！？$R;", "タイニー1号");
                            Say(pc, 0, 65535, "フフフッ！$R;" +
                            "ねえ、行ってみたい？$R;" +
                            "レインボーが交差するあの場所へ！$R;", "タイニー2号");
                            Say(pc, 0, 65535, "あったりまえだよ！$R;" +
                            "ねえ！？$R;", "タイニー3号");
                            */
                            break;
                        case 2:
                            Say(pc, 0, 65535, "呼呼呼續！$R;" +
                            "吶、要走走看嗎？$R;" +
                            "到彩虹交差之處！$R;", "泰迪2號");
                            Say(pc, 0, 65535, "當然了！$R;" +
                            "吶！？$R;", "泰迪3號");
                            break;
                    }
                }
                else
                {
                    Say(pc, 0, 65535, "呼呼呼續！$R;" +
                    "吶、要走走看嗎？$R;" +
                    "到彩虹交差之處！$R;", "泰迪2號");
                    Say(pc, 0, 65535, "當然了！$R;" +
                    "吶！？$R;", "泰迪3號");
                }

                switch (Select(pc, "甚麼辦？", "", "不前往", "當然了、想去看看！"))
                //switch (Select(pc, "どうする？", "", "行かない", "もちろん、いってみたい！"))
                {
                    case 1:
                        Say(pc, 0, 65535, "啊哩ー？$R;", "泰迪4號");
                        break;
                    case 2:
                        mask.SetValue(Tinyis_Land_01.去過ECO城, true);
                        Say(pc, 0, 65535, "好了！$R;" +
                        "那麼、大家、去吧！！$R;", "泰迪1號");
                        /*Say(pc, 0, 65535, "よーしっ！$R;" +
                        "じゃあ、みんな、いくぜ～っ！！$R;", "タイニー1号");*/
                        Wait(pc, 660);

                        Say(pc, 0, 65535, "將 ー 心 ー 聚 ー 集$R;" +
                        "力 ー 量 ー 合 ー 一 ！$R;" +
                        "$R轉動啊轉動啊轉動啊轉動啊轉動啊～～～！$R;"+
                        "(吐糟:不就是齊心合力啊$R;", "泰迪1號");
                        /*
                        Say(pc, 0, 65535, "こーこーろーをーあーわーせーてー$R;" +
                        "ちーかーらーをーひーとーつーにー！$R;" +
                        "$Rまわせまわせまわせまわせ～～～！$R;", "タイニー1号");
                        */
                        NPCMove(pc, 11000726, 62, 210, 0, 7, 111, 200);
                        ShowEffect(pc, 11000726, 5314);
                        NPCMove(pc, 11000717, 62, 210, 100, 7, 111, 65535);
                        NPCMove(pc, 11000718, 62, 210, 100, 7, 111, 65535);
                        NPCMove(pc, 11000738, 62, 210, 100, 7, 111, 65535);
                        Wait(pc, 990);
                        ShowEffect(pc, 4011);
                        ShowEffect(pc, 11000726, 5314);
                        Wait(pc, 990);
                        Warp(pc, 11027000, 252, 7);
                        NPCShow(pc, 11001833);
                        break;
                }
                
            }
            Say(pc, 0, 0, "哼唷……哼唷……$R;" +
                          "$R哼唷……哼唷……$R;", "正在工作的泰迪");
        }
    }
}




