using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaScript.Chinese.Enums;
namespace SagaScript.M30060000
{
    public class S11000171 : Event
    {
        public S11000171()
        {
            this.EventID = 11000171;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<DFHJFlags> mask = new BitMask<DFHJFlags>(pc.CMask["DFHJ"]);

            int selection;
            Say(pc, 131, "我不帅吗??$R;" +
                "$R不管什么随便问吧!$R;");
            if (mask.Test(DFHJFlags.给过青菜))
            {
                switch (Select(pc, "问什么呢?", "", "关于武器", "关于帽子", "关于T恤", "关于裤子", "关于皮鞋", "关于你", "关于历卡", "没什么可问的"))
                {
                    case 1:
                        Say(pc, 131, "啊!这个啊?$R;" +
                            "你看特别的地方啊$R;" +
                            "$R这是『风吕敷』妈妈亲自做给我的$R;" +
                            "$P虽然是把2张布叠成做成的$R;" +
                            "$R比想像中用的还多$R;" +
                            "$P为了缝制布需要『针』和『线』$R;" +
                            "$R虽然是理所当然的事情$R;");
                        break;
                    case 2:
                        Say(pc, 131, "啊!这个啊?$R;" +
                            "你看特别的地方啊$R;" +
                            "$R这是『布头巾』$R;" +
                            "像是商人的象征一样的东西$R;" +
                            "$P是把『布』卷起来的$R;" +
                            "$R看这个『玻璃珠』$R;" +
                            "用『胶水』贴上去的$R;" +
                            "不会轻易掉下来$R;" +
                            "$R问玻璃珠是从哪里弄得的?$R;" +
                            "$R是啊?是从爸爸那里收到的所以…$R;" +
                            "不过『玻璃材料』是原材料$R;" +
                            "这一点是没有错的…$R;");
                        break;
                    case 3:
                        Say(pc, 131, "这件『工地夹克』是$R;" +
                            "附加光属性的特殊夹克$R;" +
                            "只要能得到在阿克罗尼亚海岸中$R;" +
                            "的『光明召唤石』$R;" +
                            "裁缝阿姨会帮你做的$R;" +
                            "$P光明召唤可以的话$R;" +
                            "『黑暗召唤石』是不是也可以呢$R;" +
                            "$R当作实验想做一下看看$R;" +
                            "但是我害怕去『不死之岛』$R;" +
                            "你要不要代替我去?$R;");
                        break;
                    case 4:
                        Say(pc, 131, "啊!这个啊?$R;" +
                            "你看特别的地方啊，这是『长裤』$R;" +
                            "$R因为是爸爸穿完不穿给我的$R;" +
                            "所以比较松$R;" +
                            "$P爸爸是摩戈的出身$R;" +
                            "$R所以应该是在西边买的$R;");
                        break;
                    case 5:
                        Say(pc, 131, "啊!这个啊?$R;" +
                            "你看特别的地方啊$R;" +
                            "$R这是『真皮凉鞋』$R;" +
                            "在旁边的大叔正在卖$R;" +
                            "如果喜欢的话买一个吧$R;");
                        break;
                    case 6:
                        Say(pc, 131, "我叫利基$R;" +
                            "一边跟爸爸做生意一边旅行$R;" +
                            "$R有什么喜欢的东西就买一个吧?$R;");
                        Say(pc, 131, "什么?!$R;" +
                            "对客人那是什么话啊?$R;");
                        break;
                    case 7:
                        mask.SetValue(DFHJFlags.给过青菜, false);
                        selection = Global.Random.Next(1, 4);
                        switch (selection)
                        {
                            case 1:
                                Say(pc, 131, "历卡是我养的『搬运用爬爬虫』$R;" +
                                    "的名字啊$R;" +
                                    "$R我从小就养了!$R;");
                                break;
                            case 2:
                                Say(pc, 131, "替我把『青菜』给了历卡$R;" +
                                    "真的谢谢$R;" +
                                    "$R这是我今天的零食$R;" +
                                    "给你…快收下吧$R;");
                                GiveItem(pc, 10009000, 1);
                                break;
                            case 3:
                                Say(pc, 131, "历卡特别喜欢青菜$R;" +
                                    "像『莴苣』看都不看!$R;");
                                break;
                            case 4:
                                Say(pc, 131, "历卡有兄弟的$R;" +
                                    "但现在不知道都去哪里了$R;");
                                break;
                        }
                        break;
                }
                return;
            }
            switch (Select(pc, "问什么呢?", "", "关于武器", "关于盾牌", "关于头发装饰", "关于衣服", "关于皮鞋", "关于你", "没什么可问的"))
            {
                case 1:
                    Say(pc, 131, "啊!这个啊?$R;" +
                        "你看特别的地方啊$R;" +
                        "$R这是『风吕敷』妈妈亲自做给我的$R;" +
                        "$P虽然是把2张布叠成做成的$R;" +
                        "$R比想像中用的还多$R;" +
                        "$P为了缝制布需要『针』和『线』$R;" +
                        "$R虽然是理所当然的事情$R;");
                    break;
                case 2:
                    Say(pc, 131, "啊!这个啊?$R;" +
                        "你看特别的地方啊$R;" +
                        "$R这是『布头巾』$R;" +
                        "像是商人的象征一样的东西$R;" +
                        "$P是把『布』卷起来的$R;" +
                        "$R看这个『玻璃珠』$R;" +
                        "用『胶水』贴上去的$R;" +
                        "不会轻易掉下来$R;" +
                        "$R问玻璃珠是从哪里弄得?$R;" +
                        "$R是啊?是从爸爸那里收到的所以…$R;" +
                        "不过『玻璃材料』是原材料$R;" +
                        "这一点是没有错的…$R;");
                    break;
                case 3:
                    Say(pc, 131, "这件『工地夹克』是$R;" +
                        "附加光属性的特殊夹克$R;" +
                        "只要能得到在阿克罗尼亚海岸中$R;" +
                        "的『光明召唤石』$R;" +
                        "裁缝阿姨会帮你做的$R;" +
                        "$P光明召唤可以的话$R;" +
                        "『黑暗召唤石』是不是也可以呢$R;" +
                        "$R当作实验想做一下看看$R;" +
                        "但是我害怕去『不死之岛』$R;" +
                        "你要不要代替我去?$R;");
                    break;
                case 4:
                    Say(pc, 131, "啊!这个啊?$R;" +
                        "你看特别的地方啊，这是『长裤』$R;" +
                        "$R因为是爸爸穿完不穿给我的$R;" +
                        "所以比较松$R;" +
                        "$P爸爸是摩戈的出身$R;" +
                        "$R所以应该是在西边买的$R;");
                    break;
                case 5:
                    Say(pc, 131, "啊!这个啊?$R;" +
                        "你看特别的地方啊$R;" +
                        "$R这是『真皮凉鞋』$R;" +
                        "在旁边的大叔正在卖$R;" +
                        "如果喜欢的话买一个吧$R;");
                    break;
                case 6:
                    Say(pc, 131, "我叫利基$R;" +
                        "一边跟爸爸做生意一边旅行$R;" +
                        "$R有什么喜欢的东西就买一个吧?$R;");
                    Say(pc, 131, "什么?!$R;" +
                        "对客人那是什么话啊?$R;");
                    break;
                case 7:
                    break;
            }
        }
    }
}