using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;
//所在地圖:上城(10023000) NPC基本信息:傢俱匠人(11000794) X:106 Y:122
namespace SagaScript.M10023000
{
    public class S11000794 : Event
    {
        public S11000794()
        {
            this.EventID = 11000794;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 11000794, 131, "要购买家具材料或摩根炭吗?$R;", "家具工匠");

            switch (Select(pc, "想做什么?", "", "购买材料","购买家具", "购买配置用方块", "购买摩根炭", "改建房子", "什么也不做"))
            {
                case 1:
                    OpenShopBuy(pc, 1000);
                    break;
                case 2:
                    OpenShopBuy(pc, 243);
                    break;
                case 3:
                    OpenShopBuy(pc, 244);
                    break;

                case 4:
                    OpenShopBuy(pc, 220);
                    break;

                case 5:
                    改建房子(pc);
                    break;

                case 6:
                    break;
            }
        }

        void 改建房子(ActorPC pc)
        {
            switch (Select(pc, "想要怎样的风格呢?", "", "阿克罗波利斯风格", "法伊斯特风格", "摩根风格", "艾恩萨乌斯风格", "诺森风格", "什么也不做"))
            {
                case 1:
                    Say(pc, 11000794, 131, "阿高普路斯风格，顾名思义，$R;" +
                                           "代表「阿克罗波利斯」的$R;" +
                                           "新都市建筑样式哦!$R;" +
                                           "$P这种风格得到$R;" +
                                           "「阿克罗波利斯评议会」赞助。$R;" +
                                           "$R所以比别的建筑简单一些。$R;" +
                                           "$P需要的道具有$R;" +
                                           "$R『ECO券』15张和『小屋』1间。$R;" +
                                           "$P只要参加「阿克罗波利斯评议会」$R;" +
                                           "特别实施的『清洁计划』，$R;" +
                                           "就可以得到『ECO券』喔!$R;" +
                                           "$P怎么样? $R;" +
                                           "要改建成这个风格，试试看吗?$R;", "家具工匠");

                    switch (Select(pc, "想怎么做?", "", "再想想", "改建成阿克罗波利斯风格"))
                    {
                        case 1:
                            Say(pc, 0, 0, "目前尚未实装$R;", " ");
                            break;

                        case 2:
                            Say(pc, 11000794, 131, "对不起，您好像没有资格做呢$R;", "家具工匠");
                            break;
                    }
                    break;

                case 2:
                    Say(pc, 11000794, 131, "法伊斯特风格，顾名思义，$R;" +
                                           "代表「法伊斯特地域」的$R;" +
                                           "游牧建筑样式哦!$R;" +
                                           "$P法伊斯特拥有这个风格的改建权。$R;" +
                                           "$R所以只有属于$R;" +
                                           "『混成骑士团东军』的人，才能改建。$R;" +
                                           "$P如果得到改建许可，$R;" +
                                           "东军会发放资金，改建比较容易。$R;" +
                                           "$P需要的道具有$R;" +
                                           "$R『ECO券』30张和『小屋』1间。$R;" +
                                           "$P只要参加「阿克罗波利斯评议会」$R;" +
                                           "特别实施的『清洁计划』，$R;" +
                                           "就可以得到『ECO券』喔!$R;" +
                                           "$P怎么样? $R;" +
                                           "要改建成这个风格，试试看吗?$R;", "家具工匠");

                    switch (Select(pc, "想怎么做?", "", "再想想", "改建成法伊斯特风格"))
                    {
                        case 1:
                            Say(pc, 0, 0, "目前尚未实装$R;", " ");
                            break;

                        case 2:
                            Say(pc, 11000794, 131, "对不起，您好像没有资格做呢$R;", "家具工匠");
                            break;
                    }
                    break;

                case 3:
                    Say(pc, 11000794, 131, "摩根风格，顾名思义，$R;" +
                                           "是代表「摩根地域」的$R;" +
                                           "实用性木制建筑样式哦!$R;" +
                                           "$P摩根拥有这个风格的改建权。$R;" +
                                           "$R所以只有属于$R;" +
                                           "『混城骑士团西军』的人，才能改建。$R;" +
                                           "$P如果得到改建许可，$R;" +
                                           "西军会发放资金，改建比较容易。$R;" +
                                           "$P需要的道具有$R;" +
                                           "$R『ECO券』30张和『小屋』1间。$R;" +
                                           "$P只要参加「阿克罗波利斯评议会」$R;" +
                                           "特别实施的『清洁计划』，$R;" +
                                           "就可以得到『ECO券』喔!$R;" +
                                           "$P怎么样? $R;" +
                                           "要改建成这个风格，试试看吗?$R;", "傢俱工匠");

                    switch (Select(pc, "想怎么做?", "", "再想想", "改建成摩根风格"))
                    {
                        case 1:
                            Say(pc, 0, 0, "目前尚未实装$R;", " ");
                            break;

                        case 2:
                            Say(pc, 11000794, 131, "对不起，您好像没有资格做呢$R;", "家具工匠");
                            break;
                    }
                    break;

                case 4:
                    Say(pc, 11000794, 131, "艾恩萨乌斯风格，顾名思义，$R;" +
                                           "是代表「艾恩萨乌斯地域」$R;" +
                                           "结实的铁制建筑样式哦!$R;" +
                                           "$P阿伊恩萨乌斯拥有这个风格的改建权。$R;" +
                                           "$R所以只有属于$R;" +
                                           "『混成骑士团南军』的人，才能改建。$R;" +
                                           "$P如果得到改建许可，$R;" +
                                           "南军会发放资金，改建比较容易。$R;" +
                                           "$P需要的道具有$R;" +
                                           "$R『ECO券』30张和『小屋』1间。$R;" +
                                           "$P只要参加「阿克罗波利斯议会」$R;" +
                                           "特别实施的『清洁计划』，$R;" +
                                           "就可以得到『ECO券』喔!$R;" +
                                           "$P怎么样? $R;" +
                                           "要改建成这个风格，试试看吗?$R;", "家具工匠");

                    switch (Select(pc, "想怎么做?", "", "再想想", "改建成艾恩萨乌斯风格"))
                    {
                        case 1:
                            Say(pc, 0, 0, "目前尚未实装$R;", " ");
                            break;

                        case 2:
                            Say(pc, 11000794, 131, "对不起，您好像没有资格做呢$R;", "家具工匠");
                            break;
                    }
                    break;

                case 5:
                    Say(pc, 11000794, 131, "诺森风格，顾名思义，$R;" +
                                           "是代表「诺森地域」的$R;" +
                                           "华丽建筑样式唷!$R;" +
                                           "$P诺森拥有这个风格的改建权。$R;" +
                                           "$R所以只有属於$R;" +
                                           "『混城骑士团北军』的人，才能改建。$R;" +
                                           "$P如果得到改建许可，$R;" +
                                           "北军会发放资金，改建比较容易。$R;" +
                                           "$P需要的道具有$R;" +
                                           "$R『ECO券』30张和『小屋』1间。$R;" +
                                           "$P只要参加「阿克罗波利斯评议会」$R;" +
                                           "特别实施的『清洁计划』，$R;" +
                                           "就可以得到『ECO券』喔!$R;" +
                                           "$P怎么样? $R;" +
                                           "要改建成这个风格，试试看吗?$R;", "家具工匠");

                    switch (Select(pc, "想怎么做?", "", "再想想", "改建成诺森风格"))
                    {
                        case 1:
                            Say(pc, 0, 0, "目前尚未实装$R;", " ");
                            break;

                        case 2:
                            Say(pc, 11000794, 131, "对不起，您好像没有资格做呢$R;", "家具工匠");
                            break;
                    }
                    break;

                case 6:
                    break;
            }
        }
    }
}



