using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
//所在地圖:上城(10023000) NPC基本信息:埃琳娜(11000155) X:106 Y:122
namespace SagaScript.M10023000
{
    public class S11000155 : Event
    {
        public S11000155()
        {
            this.EventID = 11000155;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Puppetry> Puppetry_mask = pc.AMask["Puppetry"];

            if (pc.Level < 8)
            {
                Say(pc, 131, "我的名字是埃琳娜$R;" +
                    "$R因为对埃米尔世界有兴趣$R;" +
                    "所以来周围看看$R;" +
                    "$P如果再强些的话$R;" +
                    "会告诉你一些好东西的$R;" +
                    "$R就这样说好了!$R;");
                return;
            }

            if (Puppetry_mask.Test(Puppetry.與埃琳娜第一次對話))
            {
                Say(pc, 131, "有什么可以帮助的…?$R;");
                普通對話(pc);
                return;
            }

            NPCChangeView(pc, 11000155, 11000139);
            ShowEffect(pc, 11000155, 8015);
            Say(pc, 131, "啊啊~!!好了!!$R;" +
                "不要突然跟我说话啊!$R;");
            Wait(pc, 3000);
            Say(pc, 131, "……$R;" +
                "$R眼睛睁这么大，瞧什么啊?!$R;");
            Select(pc, "为什么瞧著啊?", "", "呵…因为…那个…那…", "看起来像美人鱼", "你太美了");

            Say(pc, 131, "啊!不会是我现在…?$R;" +
                "变身成鱼人了！?$R;");
            NPCChangeView(pc, 11000155, 11000181);
            ShowEffect(pc, 11000155, 8015);
            Wait(pc, 2000);
            Say(pc, 131, "真不好意思，把你吓一跳$R;" +
                "$R一时错手变身成『活动木偶』$R;" +
                "$R告诉你几个情报当作谢罪吧$R;");
            Puppetry_mask.SetValue(Puppetry.與埃琳娜第一次對話, true);
            普通對話(pc);

        }

        void 普通對話(ActorPC pc)
        {
            BitMask<Puppetry> Puppetry_mask = pc.AMask["Puppetry"];

            switch (Select(pc, "想要问什么?", "", "关于凭依", "关于活动木偶", "关于拿到活动木偶得方法", "没什么特别要问的"))
            {
                case 1:
                    Say(pc, 131, "『凭依』就是附身在别人身上$R;" +
                        "简单吧?$R;" +
                        "$R但是凭依的话$R;" +
                        "$R『力量』和『魔力』会变得很强$R;");
                    Say(pc, 131, "怎样做呢？$R;" +
                        "把嘴张开后大把吸气~!!$R;" +
                        "$R再使劲地吐气~!$R;" +
                        "$P那样的话，吐出来的气和魂$R;" +
                        "会从身上脱离出来的$R;" +
                        "$R然后附上想要进的对象身上就可以$R;" +
                        "$R灵魂移动比较难$R;" +
                        "所以凭依在附近的人身上比较好!$R;");
                    Say(pc, 131, "不知道什么是什么?$R;" +
                        "$P简单点说吧…$R;" +
                        "$P站到想凭依的对象旁边$R;" +
                        "对目标点击滑鼠右键!!$R;" +
                        "然后选择凭依!$R;" +
                        "再选凭依的道具就可以了!$R;" +
                        "$P再点击一次的话，凭依会自动解除$R;");
                    Say(pc, 131, "可以凭依的地方有盾牌或衣服等$R;" +
                        "重要装备$R;" +
                        "$R当然别人的装备，或是$R;" +
                        "自己的装备也可以$R;" +
                        "$P此外还有几个条件$R;" +
                        "就是符合相配性才可以$R;" +
                        "$R但是就算凭依失败也不会死的$R;" +
                        "$P一个个试试看吧!$R;");
                    break;
                case 2:
                    Say(pc, 131, "活动木偶是可以变身的神秘道具$R;" +
                        "跟凭依在别人身上不同$R;" +
                        "只要有道具就可以变身$R;" +
                        "$P使用活动木偶的话…$R;");
                    NPCChangeView(pc, 11000155, 11000357);
                    ShowEffect(pc, 11000155, 8015);
                    Wait(pc, 2000);
                    Say(pc, 113, "这样可以变身成各种模样$R;" +
                        "$R很有意思吧?$R;");
                    Say(pc, 133, "活动木偶不仅有意思$R;" +
                        "还可以使用各种力量$R;" +
                        "$P比如『鱼人』!$R;");
                    NPCChangeView(pc, 11000155, 11000139);
                    ShowEffect(pc, 11000155, 8015);
                    Wait(pc, 2000);
                    Say(pc, 137, "像这样的话，在水中也可以呼吸喔！$R;" +
                        "$P此外还有『烈焰蜥蜴』!$R;");
                    NPCChangeView(pc, 11000155, 11000260);
                    ShowEffect(pc, 11000155, 8015);
                    Wait(pc, 2000);
                    Say(pc, 364, "这样的话，可以提升火之力$R;" +
                        "所以可以使用技能『火焰鞭』$R;");
                    Say(pc, 131, "是什么样的技能$R;" +
                        "你亲自用过就知道了$R;" +
                        "$P但是能变身的时间只有『3分钟』!$R;" +
                        "$R还原后的一定时间内$R;" +
                        "是无法变身的，要注意喔！$R;");
                    NPCChangeView(pc, 11000155, 11000181);
                    ShowEffect(pc, 11000155, 8015);
                    Wait(pc, 2000);
                    if (!Puppetry_mask.Test(Puppetry.已經獲得木偶))
                    {
                        索取木偶(pc);
                        return;
                    }
                    普通對話(pc);
                    break;
                case 3:
                    Say(pc, 131, "要得到活动木偶，其实有不同的方法$R;" +
                        "$P不同的活动木偶，方法也不一样$R;" +
                        "$R我可以把我知道的$R;" +
                        "获得活动木偶的方法都告诉你$R;");
                    獲取木偶的方法(pc);
                    break;
                case 4:
                    break;
            }
        }

        void 獲取木偶的方法(ActorPC pc)
        {
            switch (Select(pc, "想知道什么?", "", "不用了?", "得到活动木偶烈焰蜥蜴的方法", "得到活动木偶鱼人的方法", "得到活动木偶曼陀罗的方法", "得到活动木偶电路机械的方法"))
            {
                case 1:
                    break;
                case 2:
                    Say(pc, 131, "把『毒蜥蜴尾巴』、『金制部件』$R;" +
                        "和『誓爱的结晶』合成的话$R;" +
                        "可以制作『烈焰蜥蜴的项链』的道具$R;" +
                        "$P如果把那个给火焰精灵看的话$R;" +
                        "就可以跟烈焰蜥蜴作协议$R;" +
                        "$P但是火焰精灵最讨厌鱼人$R;" +
                        "如果你是把变成干鱼的鱼人$R;" +
                        "变回原貌的人$R;" +
                        "他们不会跟你做协议的$R;");
                    獲取木偶的方法(pc);
                    break;
                case 3:
                    Say(pc, 131, "知道关于『干鱼』的消息吗？$R;" +
                        "我偶尔会看到奇怪的干鱼，$R;" +
                        "您有见过吗?$R;" +
                        "$R其实是那鱼人干了的样子，很瘦喔…$R;" +
                        "该不会是不知道吃东西吧?$R;" +
                        "$R不管怎么样，如果把它由干鱼$R;" +
                        "恢复原样的话，他会一直跟着您的$R;" +
                        "$R想要给恢复原样的话到$R就要到大六洞窟$R;" +
                        "大六洞窟的深处$R有个叫『鱼人的故乡』的地方$R;" +
                        "不去不行啊$R;" +
                        "$P去的方法，得到『行会宫殿5楼』$R;" +
                        "问问『鱼人』$R;" +
                        "$R如果有干鱼的话，他会告诉你的$R;");
                    獲取木偶的方法(pc);
                    break;
                case 4:
                    Say(pc, 131, "知道被诅咒的『树种子』的传说吗?$R;" +
                        "$R把那诅咒的『树种子』栽培的话$R;" +
                        "听说会变成『莫库草』$R;" +
                        "$P但是把莫库草击退后$R;" +
                        "把诅咒解开的话$R;" +
                        "会成为曼陀罗，它会报答您的$R;" +
                        "$P唔…曼陀罗的话，有点变化无常$R;" +
                        "所以难保他会报答$R;");
                    獲取木偶的方法(pc);
                    break;
                case 5:
                    Say(pc, 131, "电路机械的存在挺烦啊$R;" +
                        "$R集齐所有构成电路机械的$R;" +
                        "零部件后就可以组装$R;" +
                        "但是零部件太多了…$R;" +
                        "$P像我这样对机器不太懂的人$R;" +
                        "根本就自己无法组装$R;" +
                        "$R但是世界上什么样的人都有$R;" +
                        "也有喜欢这个的人$R;" +
                        "…说的是古董商店$R;" +
                        "$P拿材料到古董商店的话$R;" +
                        "古董商会很亲切的给你说明$R;" +
                        "$R真不知道有什么可开心的$R你都不知道有多吵…$R;");
                    獲取木偶的方法(pc);
                    break;
            }
        }

        void 索取木偶(ActorPC pc)
        {
            BitMask<Puppetry> Puppetry_mask = pc.AMask["Puppetry"];

            Say(pc, 131, "啊，看您远道而来，$R;" +
                "送您一个活动木偶吧！$R;" +
                "$R喜欢哪一个?$R;");
            switch (Select(pc, "想要怎么样的活动木偶?", "", "想一想", "活动木偶烈焰蜥蜴", "活动木偶鱼人", "活动木偶曼陀罗", "活动木偶电路机械"))
            {
                case 1:
                    Say(pc, 131, "烈焰蜥蜴是火焰精灵$R;" +
                        "鱼人是水灵精灵$R;" +
                        "曼陀罗是大地精灵$R;" +
                        "电路机械是神风精灵$R;" +
                        "$P各有各的长处$R;" +
                        "因此根据情况，强弱也不一样$R;" +
                        "$R跟活动木偶结缘$R;" +
                        "也不是在这里就结束的$R;" +
                        "$P开始冒险以后$R;" +
                        "一定会得到别的活动木偶的$R;" +
                        "$R到时候好好选就可以了$R;");
                    索取木偶(pc);
                    break;
                case 2:
                    if (CheckInventory(pc, 10013850, 1))
                    {
                        GiveItem(pc, 10013850, 1);
                        Say(pc, 131, "烈焰蜥蜴作为火焰精灵的化身$R;" +
                            "是比水属强而比风属弱的活动木偶$R;" +
                            "$R因为活动木偶是道具$R;" +
                            "所以总有一天会不能用的$R;" +
                            "$R所以请您珍惜地使用吧!$R;");
                        Puppetry_mask.SetValue(Puppetry.已經獲得木偶, true);
                        //_1A36 = true;
                        //_Xa03 = true;
                        普通對話(pc);
                        return;
                    }
                    Say(pc, 131, "好像因为太重没法拿啊$R;");
                    break;
                case 3:
                    if (CheckInventory(pc, 10019400, 1))
                    {
                        GiveItem(pc, 10019400, 1);
                        Say(pc, 131, "鱼人作为水灵精灵的化身$R;" +
                            "是比大地强但比火属弱的活动木偶$R;" +
                            "$R因为活动木偶是道具$R;" +
                            "所以总有一天会不能用的$R;" +
                            "$R所以请您珍惜地使用吧!$R;");
                        Puppetry_mask.SetValue(Puppetry.已經獲得木偶, true);
                        //_1A36 = true;
                        //_Xa03 = true;
                        普通對話(pc);
                        return;
                    }
                    Say(pc, 131, "好像因为太重没法拿啊$R;");
                    break;
                case 4:
                    if (CheckInventory(pc, 10019200, 1))
                    {
                        GiveItem(pc, 10019200, 1);
                        Say(pc, 131, "曼陀罗作为大地精灵的化身$R;" +
                            "是比风属强但比水属弱的活动木偶$R;" +
                            "$R因为活动木偶是道具$R;" +
                            "所以总有一天会不能用的$R;" +
                            "$R所以请您珍惜地使用吧!$R;");
                        Puppetry_mask.SetValue(Puppetry.已經獲得木偶, true);
                        //_1A36 = true;
                        //_Xa03 = true;
                        普通對話(pc);
                        return;
                    }
                    Say(pc, 131, "好像因为太重没法拿啊$R;");
                    break;
                case 5:
                    if (CheckInventory(pc, 10030001, 1))
                    {
                        GiveItem(pc, 10030001, 1);
                        Say(pc, 131, "电路机械作为神风精灵的化身$R;" +
                            "是比火属强但比大地弱的活动木偶$R;" +
                            "$R因为活动木偶是道具$R;" +
                            "所以总有一天会不能用的$R;" +
                            "$R所以请您珍惜地使用吧!$R;");
                        Puppetry_mask.SetValue(Puppetry.已經獲得木偶, true);
                        //_1A36 = true;
                        //_Xa03 = true;
                        普通對話(pc);
                        return;
                    }
                    Say(pc, 131, "好像因为太重没法拿啊$R;");
                    break;
            }
        }
    }
}