using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;

using SagaDB.Ring;
//所在地圖:上城(10023000) NPC基本信息:軍團管理員(11000250) X:73 Y:170
namespace SagaScript.M10023000
{
    public class S11000250 : Event
    {
        public S11000250()
        {
            this.EventID = 11000250;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Acropolisut_01> Acropolisut_01_mask = pc.CMask["Acropolisut_01"];                                                                                   //一般：阿高普路斯市

            if (!Acropolisut_01_mask.Test(Acropolisut_01.已經與軍團管理員進行第一次對話))
            {
                初次與軍團管理員進行對話(pc);
            }

            if (pc.Ring == null)
            {
                switch (Select(pc, "欢迎来到军团登记处，请问您想做什么?", "", "创建军团 (1万金币)", "军团登记处的使用方法", "什么也不做"))
                {
                    case 1:
                        創立新的軍團(pc);
                        return;

                    case 2:
                        軍團相關說明(pc);
                        return;

                    case 3:
                        return;
                }
            }
            /*
            if (pc.CharID == pc.Ring.Leader.CharID)
            {
                軍團總管模式(pc);
            }
            */
            if (pc.CharID == pc.Ring.Leader.CharID)
            {
                軍團總管模式(pc);
            }
            else
            {
                軍團團員模式(pc);
            }
        }

        void 軍團總管模式(ActorPC pc)
        {
            Say(pc, 11000250, 111, "军团团长欢迎呀!!$R;" +
                                   "$P我正等著您呢!$R;", "军团管理员");

            switch (Select(pc, "欢迎来到军团登记处，请问您想做什么?", "", "解散军团", "变更军团团长", "军团登记处使用方法", "什么也不做"))
            {
                case 1:
                    switch (Select(pc, "真的要解散军团吗?", "", "是的，我确定要解散军团", "放弃"))
                    {
                        case 1:
                            Say(pc, 0, 65535, "目前尚未实装$R;", " ");

                            ////解散军团


                            ////例外判断

                            ////伺服器中断
                            //Say(pc, 0, 65535, "军团管理跟服务器的通信中断了喔!$R;" +
                            //                  "$R请稍后再重试吧!!$R;", " ");

                            ////进行投票中
                            //Say(pc, 0, 65535, "现在正在进行军团团长选举，$R;" +
                            //                  "不能进行解散军团唷。$R;", " ");

                            ////预备中
                            //Say(pc, 0, 65535, "现在不能进行解散军团唷$R;" +
                            //                  "$R请稍后再来吧!$R;", " ");
                            break;

                        case 2:
                            break;
                    }
                    break;

                case 2:
                    Say(pc, 0, 65535, "目前尚未实装$R;", " ");

                    ////变更军团团长


                    ////例外判断

                    ////伺服器中断
                    //Say(pc, 0, 65535, "军团管理跟服务器的通信中断了喔!$R;" +
                    //                  "$R请稍后再重试吧!!$R;", " ");

                    ////周りにリングメンバーがいない,
                    //Say(pc, 0, 65535, "如果要变更团长的话，$R;" +
                    //                  "请在下一次军团团长选举时，$R;" +
                    //                  "一起来过来吧!$R;", " ");

                    ////伺服器中断
                    //Say(pc, 0, 65535, "军团管理跟伺服器的通信中断了喔!$R;" +
                    //                  "$R请稍后再重试吧!!$R;", " ");

                    ////相手が忙しいのでダメ,
                    //Say(pc, 0, 65535, "现在对方不能进行变更唷!!$R;" +
                    //                  "$R稍后再来吧!$R;", " ");
                    break;

                case 3:
                    軍團相關說明(pc);
                    break;

                case 4:
                    break;
            }        
        }

        void 軍團團員模式(ActorPC pc)
        {
            switch (Select(pc, "欢迎来到军团登记处，请问您想做什么?", "", "变更军团团长", "军团登记处的使用方法", "什么也不做"))
            {
                case 1:
                    //申請變更軍團總管(pc);
                    軍團總管變更投票(pc);
                    break;

                case 2:
                    軍團相關說明(pc);
                    break;

                case 3:
                    break;
            }
        }

        void 初次與軍團管理員進行對話(ActorPC pc)
        {
            BitMask<Acropolisut_01> Acropolisut_01_mask = pc.CMask["Acropolisut_01"];                                                                                   //一般：阿高普路斯市

            Acropolisut_01_mask.SetValue(Acropolisut_01.已經與軍團管理員進行第一次對話, true);

            Say(pc, 11000250, 111, "欢迎来到军团登记处呀!$R;" +
                                   "$R请问您了解『军团』吗?$R;" +
                                   "$P『军团』就像是半永久性的队伍一样，$R;" +
                                   "一开始最多可以登记16个人。$R;" +
                                   "$P在不久的将来，$R;" +
                                   "军团之间也可以结盟，$R;" +
                                   "日后可能会形成庞大的团体呢，$R;" +
                                   "真是期待呀!$R;" +
                                   "$P对了!$R;" +
                                   "$R相同军团的成员，$R;" +
                                   "还可以透过军团的聊天系统，$R;" +
                                   "一起聊天唷!$R;" +
                                   "$P您随时可以跟军团成员进行对话的，$R;" +
                                   "所以一定要试试看啊!!$R;", "军团管理员");
        }

        void 創立新的軍團(ActorPC pc)
        {
            string Ring_Name;

            if (pc.Gold >= 10000)
            {
                Ring_Name = InputBox(pc, "请输入军团名称", InputType.PetRename);

                if (Ring_Name != "")
                {
                    if (Ring_Name.Length > 24)
                    {
                        Say(pc, 11000250, 131, "不能使用这个名字呀!$R;" +
                                               "$R请确认字数以后，再来申请吧!$R;" +
                                               "（最多中文12个字/英文24个字）$R;", "军团管理员");

                        創立新的軍團(pc);
                    }

                    if (CreateRing(pc, Ring_Name))
                    {
                        PlaySound(pc, 4006, false, 100, 50);
                        pc.Gold -= 10000;

                        Say(pc, 11000250, 111, "成功创立新的军团了!!$R;" +
                                               "$P从现在开始，$R;" +
                                               "您就是这个军团的『军团团长』哦!$R;" +
                                               "$R一定要成为出色的军团喔，$R;" +
                                               "加油吧!!$R;", "军团管理员");
                    }
                    else
                    {
                        Say(pc, 11000250, 131, "抱歉，已经有同名的军团了。$R;", "军团管理员");

                        創立新的軍團(pc);
                    }
                }
            }
            else
            {
                Say(pc, 11000250, 131, "想要组成军团的话，需要1万金币!$R;", "军团管理员");
            }
        }

        void 軍團相關說明(ActorPC pc)
        {
            int selection;

            Say(pc, 11000250, 111, "在我这裡可以组织军团，$R;" +
                                   "或者是变更军团团长的相关手续!$R;" +
                                   "$P另外，$R;" +
                                   "您可以随时设定朋友清单里的军团目录，$R;" +
                                   "有空就参考一下吧!$R;", "军团管理员");

            selection = Select(pc, "想要询问有关什么的情报呢?", "", "创建军团 (收费)", "解散军团", "变更军团团长", "设定军团标志", "什么也不做");

            while (selection != 5)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11000250, 111, "只要是军团以外的人，$R;" +
                                               "不论是谁都不能设定军团的。$R;" +
                                               "$R组成军团的人，$R;" +
                                               "会立即成为军团的领袖。$R;" +
                                               "$P领袖又被称为『军团团长』!!$R;" +
                                               "$R享有各种管理以及设定军团的权利。$R;" +
                                               "$P还有一件事情要特别注意，$R;" +
                                               "组成军团时必须要收取一定的手续费，$R;" +
                                               "一共需要1万金币的手续费!!$R;", "军团管理员");
                        break;

                    case 2:
                        Say(pc, 11000250, 111, "顾名思义就是解散军团啊!$R;" +
                                               "$R不过这是军团团长的权利，$R;" +
                                               "其他成员是无法进行的啦!$R;", "军团管理员");
                        break;

                    case 3:
                        Say(pc, 11000250, 111, "如果想要进行团长的变更，$R;" +
                                               "所需手续则会根据团长本人的设定而改变。$R;" +
                                               "$R要是由别的成员来申请变更，$R;" +
                                               "申请的步骤将会不一样喔。$R;" +
                                               "$P现任团长本人申请的话，$R;" +
                                               "只要跟新团长人选一起来到这里，$R;" +
                                               "进行职位的转让就可以了。$R;" +
                                               "$P如果不是团长，$R;" +
                                               "而是其他成员申请变更的话，$R;" +
                                               "会先成为团长的选举候选人，$R;" +
                                               "再由全体成员投赞成或反对票，$R;" +
                                               "只要赞成票过半数的话，$R;" +
                                               "候选人就当选为新一任团长哦!!$R;", "军团管理员");
                        break;

                    case 4:
                        Say(pc, 11000250, 111, "有一定声望的军团，$R;" +
                                               "可以设定象征军团的标志。$R;" +
                                               "$P只有作为军团团长的您，$R;" +
                                               "才可以设定标志呢!!$R;" +
                                               "$R想要设定军团标志，$R;" +
                                               "军团的声望必须达300以上，$R;:" +
                                               "就可以设定ECO游戏跟目录下的$R;" +
                                               "data/sprite/emblem 资料夹内设定。$R;" +
                                               "使用空白图像，$R;" +
                                               "做一个独特的军团标志，$R;" +
                                               "然后直接登记就可以了。$R;" +
                                               "$P那么就来做一个漂亮的标志，$R;" +
                                               "试试看吧!!$R;", "军团管理员");
                        break;
                }

                selection = Select(pc, "想打听什么呢?", "", "创建军团 (收费)", "解散军团", "变更军团团长", "设定军团标志", "什么也不做");
            }
        }

        void 軍團總管變更投票(ActorPC pc)
        {
            Say(pc, 11000250, 111, "一般成员申请变更军团团长时，$R;" +
                                   "必须要有成员参加团长选举喔!!$R;" +
                                   "$R您要参加团长选举吗?$R;", "军团管理员");

            switch (Select(pc, "想要参加团长选举吗?", "", "参加选举", "放弃"))
            {
                case 1:
                    Say(pc, 0, 65535, "目前尚未实装$R;", " ");

                    //Say(pc, 11000250, 111, "想要成功当选为军团团长，$R;" +
                    //                       "就必须得到大多数军团成员的同意才行喔!!$R;" +
                    //                       "$R那么现在就準备开始进行，$R;" +
                    //                       "为期3天的投票吧!!$R;", "军团管理员");

                    ////选举开始


                    ////例外判断

                    ////服务器中断
                    //Say(pc, 0, 65535, "军团管理跟服务器的通信中断了喔!$R;" +
                    //                "$R请稍后再重试吧!!$R;", " ");

                    ////进行投票中
                    //Say(pc, 0, 65535, "您已经成为军团团长了。$R;", " ");

                    ////进行投票中
                    //Say(pc, 0, 65535, "现在正在进行军团团长选举，$R;" +
                    //                "不能进行解散军团呢。$R;", " ");
                    break;

                case 2:
                    break;
            }
        }
    }
}
