using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
//所在地圖:東方海角(10018101) NPC基本信息:埃米爾(11000920) X:195 Y:64
namespace SagaScript.M10018101
{
    public class S11000920 : Event
    {
        public S11000920()
        {
            this.EventID = 11000920;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            int selection;

            if (!Beginner_01_mask.Test(Beginner_01.已經與埃米爾進行第一次對話))
            {
                初次與埃米爾進行對話(pc);
            }
            else
            {
                Say(pc, 11000920, 131, "什么，再说明一下?$R;", "埃米尔");
            }

            selection = Select(pc, "想问关于哪方面的操作呢?", "", "说话/攻击", "移动方法", "结束游戏方法", "移动地图的方法", "其他");

            while (selection != 5)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11000920, 131, "想跟村里的人打招呼，$R;" +
                                               "或攻击敌人的时候，$R;" +
                                               "对目标点击滑鼠左键就可以啰。$R;" +
                                               "$P…看您跟我打招呼了，$R;" +
                                               "应该已经知道了吧?$R;" +
                                               "$P如果对方跟其他人重叠时，$R;" +
                                               "就请点击滑鼠右键吧。$R;" +
                                               "$R将会出现重叠人名的视窗，$R;" +
                                               "在里面可以选择跟谁打招呼!$R;", "埃米尔");
                        break;

                    case 2:
                        Say(pc, 11000920, 131, "移动时，在移动目标上点击左键即可。$R;" +
                                               "$R如果长时间持续点击，$R;" +
                                               "就会自动跟着滑鼠移动方向移动。$R;" +
                                               "$P人太多的时候操作困难。$R;" +
                                               "$R这时用键盘的方向键移动，$R;" +
                                               "会比较方便哦!$R;", "埃米尔");
                        break;

                    case 3:
                        Say(pc, 11000920, 131, "要结束游戏的话，$R;" +
                                               "请按键盘左上角ESC键…$R;" +
                                               "$P如果按这键…$R;" +
                                               "喂! 别现在点击!$R;" +
                                               "$P然后…$R;" +
                                               "$R「返回游戏」或「登出」$R;" +
                                               "$R两个选项中做出选择即可。$R;" +
                                               "$P注意一点，$R;" +
                                               "对话时结束游戏，$R;" +
                                               "会听不到后面的对话!$R;" +
                                               "$P登出需要5秒钟的时间，$R;" +
                                               "$R这时移动或被魔物攻击的话，$R;" +
                                               "会自动取消登出喔!$R;" +
                                               "$P在寒冷、炎热或是在水里等$R;" +
                                               "体质HP值渐渐减少的地方，$R;" +
                                               "是没办法登出的喔!$R;", "埃米尔");
                        break;

                    case 4:
                        Say(pc, 11000920, 131, "想移动到下一幅地图时，$R;" +
                                               "看到蓝色光柱了吗?$R;" +
                                               "这是「传送点」，$R;" +
                                               "踩到它就会进入下一个地图!$R;" +
                                               "$P同样的，进入店里时踩传送点即可。$R;" +
                                               "$P如果没有光柱，$R;" +
                                               "传送点可能是隐藏的。$R;" +
                                               "$R如果觉得可能有的话，$R;" +
                                               "就踩一踩试试看，$R;" +
                                               "可能有新发现哦!$R;", "埃米尔");
                        break;
                }

                selection = Select(pc, "想问关于哪方面的操作呢?", "", "说话/攻击", "移动方法", "结束游戏方法", "移动地图的方法", "其他");
            }

            if (!Beginner_01_mask.Test(Beginner_01.埃米爾給予埃米爾徽章))
            {
                埃米爾給予埃米爾徽章(pc);
                return;
            }

            Say(pc, 11000920, 131, "那麼說明一下傳送點吧!$R;" +
                                   "$R只要點擊那個傳送點，$R;" +
                                   "就可以進入下一階段唷!$R;" +
                                   "$P跟著路走就是阿高普路斯市了!$R;" +
                                   "$R放心，$R;" +
                                   "只要參照小地圖來走，就不會迷路啦。$R;", "埃米爾");          
        }

        void 初次與埃米爾進行對話(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            byte x, y;

            Beginner_01_mask.SetValue(Beginner_01.已經與埃米爾進行第一次對話, true);

            Say(pc, 11000920, 131, "您好!$R;" +
                                   "是否第一次來到這裡呢?$R;" +
                                   "$R我叫埃米爾，$R;" +
                                   "是負責幫助來到$R;" +
                                   "ECO世界的初心者們。$R;" +
                                   "$P準備好了，就開始個人指導吧…$R;", "埃米爾");

            switch (Select(pc, "要進行指導嗎?", "", "進行指導", "直接返回遊戲"))
            {
                case 1:
                    Say(pc, 11000920, 131, "首先，歡迎來到ECO世界!$R;" +
                                           "$R現在，您的眼前即將展開魔幻新世界。$R;" +
                                           "$P那麼開始教您一些基本操作方法吧!$R;", "埃米爾");
                    break;

                case 2:
                    Say(pc, 11000920, 131, "真是的，以後再也聽不到說明喔!$R;", "埃米爾");

                    switch (Select(pc, "真的不聽說明嗎?", "", "聽完說明在走", "不聽也行!"))
                    {
                        case 1:
                            Say(pc, 11000920, 131, "那就開始吧!$R;", "埃米爾");

                            Say(pc, 11000920, 131, "首先，歡迎來到ECO世界!$R;" +
                                                   "$R現在，您的眼前即將展開魔幻新世界。$R;" +
                                                   "$P那麼開始教您一些基本操作方法吧!$R;", "埃米爾");
                            break;

                        case 2:
                            Beginner_01_mask.SetValue(Beginner_01.埃米爾給予埃米爾介紹書, true);

                            PlaySound(pc, 2040, false, 100, 50);
                            GiveItem(pc, 10043081, 1);
                            Say(pc, 0, 0, "得到『埃米爾介紹書』!$R;", " ");

                            Say(pc, 11000920, 131, "知道了，最後還有一點。$R;" +
                                                   "$P到達阿高普路斯市後，$R;" +
                                                   "最好去「咖啡館」或者「咖啡館分店」一趟。$R;" +
                                                   "$P「咖啡館」在「阿高普路斯市」的$R;" +
                                                   "「下城」東部喔!$R;" +
                                                   "$R「咖啡館分店」在「阿高普路斯市」的$R;" +
                                                   "東、南、西、北部平原的中央附近唷!$R;" +
                                                   "$P我有給您一份介紹書，$R;" +
                                                   "在道具視窗中確認一下吧?$R;" +
                                                   "$P「阿高普路斯市」是一個很大的城市喔!$R;" +
                                                   "迷了路可以利用「響導機械人」。$R;" +
                                                   "$R「響導機械人」是個有點奇怪的機器人，$R;" +
                                                   "「阿高普路斯市」裡到處都有，很容易找到的。$R;", "埃米爾");

                            Say(pc, 11000920, 131, "那麼送您到「阿高普路斯市」吧!$R;", "埃米爾");

                            x = (byte)Global.Random.Next(245, 250);
                            y = (byte)Global.Random.Next(126, 131);

                            Warp(pc, 10023100, x, y);
                            return;
                    }
                    break;
            }
        }

        void 埃米爾給予埃米爾徽章(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            Beginner_01_mask.SetValue(Beginner_01.埃米爾給予埃米爾徽章, true);

            Say(pc, 11000920, 131, "還有…$R;" +
                                   "$R通過前面的傳送點，$R;" +
                                   "就會進入下一張地圖，$R;" +
                                   "沿著路走，$R;" +
                                   "就會有「關卡」唷!$R;" +
                                   "$R我的同伴，是道米尼男孩。$R;" +
                                   "$P他會教您很多關於戰鬥的東西唷!$R;" +
                                   "$R那麼，祝您好運!$R;", "埃米爾");

            Say(pc, 11000920, 131, "這是歡送您的禮物!$R;", "埃米爾");

            PlaySound(pc, 2040, false, 100, 50);
            GiveItem(pc, 10009550, 1);
            Say(pc, 0, 0, "得到『埃米爾徽章』!$R;", " ");

            Say(pc, 11000920, 131, "把這個徽章放到叫「道具箱」的$R;" +
                                   "粉紅色機器就可以交換到$R;" +
                                   "各種有用的道具唷!$R;" +
                                   "$P試試將徽章$R;" +
                                   "放到我前面的「道具箱」吧!$R;", "埃米爾");

            Say(pc, 11000920, 131, "對了!$R;" +
                                   "$R走之前，先到村落裡走走吧!$;" +
                                   "會聽到很多情報唷!$R;", "埃米爾");
        }   
    }
}
