using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
//所在地圖:東方海角(10018101) NPC基本信息:路利耶(11000921) X:223 Y:82
namespace SagaScript.M10018101
{
    public class S11000921 : Event
    {
        public S11000921()
        {
            this.EventID = 11000921;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            int selection;

            if (!Beginner_01_mask.Test(Beginner_01.已經與埃米爾進行第一次對話))
            {
                尚未與埃米爾對話(pc);
                return;
            }

            Say(pc, 11000921, 131, "您好!$R;" +
                                   "$R我来教您几个关于方便玩ECO$R;" +
                                   "的几个程序喔!$R;", "路利耶");

            selection = Select(pc, "想听哪个说明呢?", "", "关于小地图", "关于视点", "关于截图", "关于环境设定", "不用了");

            while (selection != 5)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11000921, 131, "小地图是$R;" +
                                               "在您目前的位置地图上，$R;" +
                                               "显示您和传送点位置的小画面，$R;" +
                                               "是个非常方便的功能喔!$R;" +
                                               "$P点击主视窗的「地图」键。$R;" +
                                               "$R可以设定显示/不显示小地图。$R;" +
                                               "$P按小地图视窗的按键，$R;" +
                                               "还可以变更小地图的大小呢!$R;" +
                                               "$R有1/4区域或整个区域，$R;" +
                                               "「世界地图」可以在整个视窗显示。$R;" +
                                               "$P现在说明您在地图上看到的「点」。$R;" +
                                               "$R箭头表示自己的位置，$R;" +
                                               "「红点」是NPC的位置，$R;" +
                                               "「蓝点」表示传送点的位置。$R;" +
                                               "$P如果同一地区里有同队的队员，$R;" +
                                               "队员的位置也会显示出来哦。$R;", "路利耶");
                        break;

                    case 2:
                        Say(pc, 11000921, 131, "现在说明游戏里的视点…$R;" +
                                               "及照相机的操作方法吧!$R;" +
                                               "$P任意在画面上$R;" +
                                               "点击右键一边拖一边移动试试看吧!$R;" +
                                               "$P…$R;" +
                                               "$P视点变了吧?$R;" +
                                               "$R选择自己喜欢的视点进行游戏即可。$R;" +
                                               "$P补充一下，$R;" +
                                               "多教您一个方便的技巧哦!$R;" +
                                               "$P将目标放在地面双击滑鼠右键，$R;" +
                                               "画面就会朝向北边。$R;" +
                                               "$R适合用于，$R;" +
                                               "当您搞不清自己位置的方向时使用。$R;" +
                                               "$P在「环境设定」里，$R;" +
                                               "除了北边$R;" +
                                               "也可以把画面设定成别的方向喔!$R;" +
                                               "$R您可以按照喜好随意设定的。$R;", "路利耶");
                        break;

                    case 3:
                        Say(pc, 11000921, 131, "想把游戏画面拍下时，$R;" +
                                               "点击键盘上的「PrintScreen」键即可。$R;" +
                                               "$R点击这个就可以保存画面喔!$R;" +
                                               "$P「PrintScreen」画面储存的地方，$R;" +
                                               "根据每个人的电脑设定而不同。$R;" +
                                               "$R只要您看一下指定位置就清楚了!$R;", "路利耶");
                        break;

                    case 4:
                        Say(pc, 11000921, 131, "在「环境设定」视窗$R;" +
                                               "可以调整游戏的显示或声音。$R;" +
                                               "$P萤幕右上方有按键，$R;" +
                                               "点击从右数到左第三个键，$R;" +
                                               "会显示「系统」视窗。$R;" +
                                               "$P…能看到视窗吗?$R;" +
                                               "$P与我对话的时候也可以操作，$R;" +
                                               "现在也可以变更设定。$R;" +
                                               "$P用「系统」视窗右上方的$R;" +
                                               "「低」「普通」「高」，$R;" +
                                               "可以调整萤幕的一般设定。$R;" +
                                               "$R游戏中觉得画面处理速度过慢，$R;" +
                                               "就调整这里试试看吧!$R;" +
                                               "$P详细的设定方法，$R;" +
                                               "等您熟悉游戏后再跟您说吧!$R;", "路利耶");
                        break;
                }

                selection = Select(pc, "想听哪个说明呢?", "", "关于小地图", "关于视点", "关于截图", "关于环境设定", "不用了");                
            }
        }

        void 尚未與埃米爾對話(ActorPC pc)
        {
            Say(pc, 11000921, 131, "埃米尔的话都听过了吗?$R;" +
                                   "最好先听听埃米尔的情报!", "路利耶");
        }  
    }
}
