using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaDB.Item;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript.M50018000
{
    public class S11001220 : Event
    {
        public S11001220()
        {
            this.EventID = 11001220;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Neko_05> Neko_05_amask = pc.AMask["Neko_05"];
            BitMask<Neko_05> Neko_05_cmask = pc.CMask["Neko_05"];

            if (Neko_05_amask.Test(Neko_05.茜子任务开始) &&
                Neko_05_cmask.Test(Neko_05.去哈爾列爾利的飛空庭) &&
                !Neko_05_cmask.Test(Neko_05.尋找瑪莎的蹤跡))
            {
                Neko_05_cmask.SetValue(Neko_05.尋找瑪莎的蹤跡, true);
                Say(pc, 11001220, 131, "歡迎來到我的飛空庭！$R;");
                if (CountItem(pc, 10017900) >= 1)
                {
                    Say(pc, 0, 131, "哇啊啊！$R;" +
                        "$R我好想你啊！！茜♪$R;", "凱堤（桃）");
                }
                if (CountItem(pc, 10017906) >= 1)
                {
                    Say(pc, 0, 131, "茜…?茜啊！?$R;" +
                        "$R很健康吧……$R;", "凱堤(菫)");
                }
                Say(pc, 0, 131, "跑去做什麼了！！怎麼那麼晚啊！！$R;" +
                    "$R怎麼這麼慢吞吞勒！$R;" +
                    "$P讓這麼可愛的女孩子等！！$R是不禮貌的行為！$R;", "凱堤(茜)");
                Say(pc, 0, 131, "！！！！！！！$R;", "凱堤(除茜以外，全都)");
                Say(pc, 11001220, 131, "啊啊！！真對不起！$R;" +
                    "$R因為飛空庭引擎有點慢了…$R;");
                Say(pc, 0, 131, "不用辯解！$R;" +
                    "$R經常讓我自己孤單的待著…$R來客人了…??$R;" +
                    "$R你說！這樣都進來了……$R;", "凱堤(茜)");
                if (CountItem(pc, 10017900) >= 1)
                {
                    Say(pc, 0, 131, "哎！不！那個！就是說…$R茜……?$R;" +
                        "$R什麼!!?為什麼變了…?$R;", "凱堤（桃）");
                }
                if (CountItem(pc, 10017906) >= 1)
                {
                    Say(pc, 0, 131, "茜…真的是茜嗎……?$R;" +
                        "$R性格完全…不一樣啊!!$R;", "凱堤(菫)");
                }
                if (CountItem(pc, 10017905) >= 1)
                {
                    Say(pc, 0, 131, "…這孩子是茜…?$R;", "凱堤(山吹)");
                }
                Say(pc, 0, 131, "哎呀……是姐姐們!!?$R;" +
                    "$R好久不見阿！$R;", "凱堤(茜)");
                if (CountItem(pc, 10017900) >= 1 && CountItem(pc, 10017906) >= 1)
                {
                    Say(pc, 0, 131, "啊！啊啊啊！姐姐…怎麼辦！！？$R茜她！！好像變壞了！！！！！！$R;", "驚慌的 凱堤（桃）");
                    Say(pc, 0, 131, "哇！不管怎麼樣！先冷靜…蘋果！！$R;" +
                        "$R茜變成這樣…$R我們只能用姊妹的愛把茜復活過來……$R;", "驚慌的 凱堤(菫)");
                }
                else if (CountItem(pc, 10017900) >= 1)
                {
                    Say(pc, 0, 131, "啊！啊啊啊！姐姐…怎麼辦！！？$R茜她！！好像變壞了！！！！！！$R;", "驚慌的 凱堤（桃）");
                }
                else if (CountItem(pc, 10017906) >= 1)
                {
                    Say(pc, 0, 131, "先冷靜下來！！$R我們只能用姊妹的愛把茜復活過來……$R;", "驚慌的 凱堤(菫)");
                }
                else
                {
                    Say(pc, 0, 131, "$R喂！哈爾列爾利！！$R;" +
                        "$R把我姐姐放在那邊到底想幹什麼?$R;", "凱堤(茜)");
                }
                Say(pc, 0, 131, "什麼啊?你們什麼意思啊?$R;" +
                    "$R喂！哈爾列爾利！！$R;" +
                    "$R把我姐姐放在那邊到底想幹什麼?$R;", "驚慌的 凱堤(茜)");
                Say(pc, 11001220, 131, "啊啊！按照所學的在調整引擎阿！$R;" +
                    "$R這次成功的話…$R我的飛空庭就可以順利地在天空中翱翔$R;" +
                    "$R好了！！！我終於成功啦！！！！$R;" +
                    "$R嘿嘿！裝著膽子安裝了飛行用渦輪引擎♪$R;");
                PlaySound(pc, 2438, false, 100, 50);
                Wait(pc, 1333);
                PlaySound(pc, 2123, false, 100, 50);
                Wait(pc, 2000);
                Say(pc, 11001220, 131, "哎呀…?$R;");
                PlaySound(pc, 2122, false, 100, 50);
                ShowEffect(pc, 7, 5612);
                Wait(pc, 1000);
                Fade(pc, FadeType.Out, FadeEffect.Black);
                Wait(pc, 4000);
                Fade(pc, FadeType.In, FadeEffect.Black);
                Say(pc, 11001220, 131, "……$R;" +
                    "$P好像失敗了……$R;");
                Say(pc, 0, 131, "沒關係嗎…！?沒有受傷吧…?$R;" +
                    "$R有沒有不舒服?頭沒有撞傷吧?$R;" +
                    "$R要不要跟莉塔說啊?$R;", "凱堤(茜)");
                Say(pc, 11001220, 131, "不！我只是被嚇到了！$R;" +
                    "$R茜！不用那麼擔心！$R;");
                Say(pc, 0, 131, "太好了…$R;" +
                    "$P哎呀……！$R;" +
                    "$R這是問…姐姐們的！$R不是問哈爾列爾利的啦！$R;", "凱堤(茜)");
                Say(pc, 11001220, 131, "我沒關係$R「客人」還好吧？$R;" +
                    "$R嗯…渦輪引擎的設定很難啊$R;" +
                    "$P可能是把引擎弄得太緊了……$R;" +
                    "$R我只是想做一個在奧克魯尼亞$R最快的飛空庭而已啦！！$R;" +
                    "$P是啊！$R;" +
                    "$R也許看看飛空庭工匠寫的記錄$R說不定有什麼新發現！$R;" +
                    "$R或許寫了什麼重要的啊！！$R;" +
                    "$P奧克魯尼亞最快的飛空庭…$R是行會評議會會長的孫女擁有的…$R;" +
                    "$R對！就是！$R;");
                Say(pc, 0, 131, "啊啊！！$R;");
                Say(pc, 11001220, 131, "怎麼了?$R;" +
                    "$R難道……你認識那個人?$R;" +
                    "$R那樣的話，帶我去找他吧！$R;");
                Say(pc, 0, 131, "等一下！$R這次我也要跟著去！！$R;" +
                    "$R哈爾列爾利總是失手的$R怎麼也不能相信！$R;", "“凱堤(茜)”");
                Say(pc, 0, 131, "啊啊…真是！看得出來…$R;" +
                    "$R阿高普路斯市…太…遠了…吧$R;" +
                    "$R去下城問路藍，她可能會知道瑪莎在哪裡…$R;");
                Warp(pc, 10062000, 110, 88);
                //WARP 1285
                return;
            }
            Say(pc, 11001220, 131, "歡迎來到我的飛空庭！$R;");
        }
    }
}