using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript
{
    public class P10000676 : RandomPortal
    {
        public P10000676()
        {
            Init(10000676, 10063000, 161, 156, 163, 159);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩薩烏斯路(10063000)
    //目標坐標:(161,156) ~ (163,159)

    public class P10000681 : RandomPortal
    {
        public P10000681()
        {
            Init(10000681, 10066000, 111, 68, 112, 70);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(111,68) ~ (112,70)

    public class P10000682 : RandomPortal
    {
        public P10000682()
        {
            Init(10000682, 10063100, 111, 64, 112, 66);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(111,64) ~ (112,66)

    public class P10000683 : RandomPortal
    {
        public P10000683()
        {
            Init(10000683, 10066000, 113, 138, 114, 138);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(113,138) ~ (114,138)

    public class P10000684 : RandomPortal
    {
        public P10000684()
        {
            Init(10000684, 10063100, 113, 140, 114, 142);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(113,140) ~ (114,142)

    public class P10000685 : RandomPortal
    {
        public P10000685()
        {
            Init(10000685, 10066000, 51, 68, 52, 70);
        }
    }
    //原始地圖:阿伊恩市上層(10063100
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(51,68) ~ (52,70)

    public class P10000686 : RandomPortal
    {
        public P10000686()
        {
            Init(10000686, 10063100, 51, 64, 52, 66);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(51,64) ~ (52,66)

    public class P10000687 : RandomPortal
    {
        public P10000687()
        {
            Init(10000687, 10066000, 49, 137, 50, 139);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(49,137) ~ (50,139)

    public class P10000688 : RandomPortal
    {
        public P10000688()
        {
            Init(10000688, 10063100, 49, 141, 50, 143);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(49,141) ~ (50,143)

    public class P10000707 : RandomPortal
    {
        public P10000707()
        {
            Init(10000707, 30072000, 4, 7, 4, 7);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:富翁家(30072000)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000708 : RandomPortal
    {
        public P10000708()
        {
            Init(10000708, 10063100, 130, 132, 130, 132);
        }
    }
    //原始地圖:富翁家(30072000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(130,132) ~ (130,132)

    public class P10000709 : RandomPortal
    {
        public P10000709()
        {
            Init(10000709, 30073000, 4, 8, 4, 8);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:傭兵軍團之大廳(30073000)
    //目標坐標:(4,8) ~ (4,8)

    public class P10000710 : RandomPortal
    {
        public P10000710()
        {
            Init(10000710, 10063100, 47, 155, 47, 156);
        }
    }
    //原始地圖:傭兵軍團之大廳(30073000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(47,155) ~ (47,156)

    public class P10000711 : RandomPortal
    {
        public P10000711()
        {
            Init(10000711, 30075000, 5, 10, 5, 10);
        }
    }
    //原始地圖:傭兵軍團之大廳(30073000)
    //目標地圖:傭兵軍團長官室(30075000)
    //目標坐標:(5,10) ~ (5,10)

    public class P10000712 : RandomPortal
    {
        public P10000712()
        {
            Init(10000712, 30073000, 4, 1, 4, 1);
        }
    }
    //原始地圖:傭兵軍團長官室(30075000)
    //目標地圖:傭兵軍團之大廳(30073000)
    //目標坐標:(4,1) ~ (4,1)

    public class P10000713 : RandomPortal
    {
        public P10000713()
        {
            Init(10000713, 30074000, 4, 8, 4, 8);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:空軍之大廳(30074000)
    //目標坐標:(4,8) ~ (4,8)

    public class P10000714 : RandomPortal
    {
        public P10000714()
        {
            Init(10000714, 10063100, 43, 71, 43, 72);
        }
    }
    //原始地圖:空軍之大廳(30074000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(43,71) ~ (43,72)

    public class P10000715 : RandomPortal
    {
        public P10000715()
        {
            Init(10000715, 30076000, 5, 10, 5, 10);
        }
    }
    //原始地圖:空軍之大廳(30074000)
    //目標地圖:空軍長官室(30076000)
    //目標坐標:(5,10) ~ (5,10)

    public class P10000716 : RandomPortal
    {
        public P10000716()
        {
            Init(10000716, 30074000, 4, 1, 4, 1);
        }
    }
    //原始地圖:空軍長官室(30076000)
    //目標地圖:空軍之大廳(30074000)
    //目標坐標:(4,1) ~ (4,1)

    public class P10000717 : RandomPortal
    {
        public P10000717()
        {
            Init(10000717, 30078000, 9, 17, 11, 18);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:議會大廳(30078000)
    //目標坐標:(9,17) ~ (11,18)

    public class P10000718 : RandomPortal
    {
        public P10000718()
        {
            Init(10000718, 10063100, 50, 103, 50, 104);
        }
    }
    //原始地圖:議會大廳(30078000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(50,103) ~ (50,104)

    public class P10000719 : RandomPortal
    {
        public P10000719()
        {
            Init(10000719, 30079000, 9, 19, 10, 19);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:合同舍大廳(30079000)
    //目標坐標:(9,19) ~ (10,19)

    public class P10000720 : RandomPortal
    {
        public P10000720()
        {
            Init(10000720, 10063100, 125, 103, 125, 104);
        }
    }
    //原始地圖:合同舍大廳(30079000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(125,103) ~ (125,104)

    public class P10000721 : RandomPortal
    {
        public P10000721()
        {
            Init(10000721, 30020003, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市裁縫店(30020003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000722 : RandomPortal
    {
        public P10000722()
        {
            Init(10000722, 10063100, 137, 169, 137, 169);
        }
    }
    //原始地圖:阿伊恩市裁縫店(30020003)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(137,169) ~ (137,169)

    public class P10000723 : RandomPortal
    {
        public P10000723()
        {
            Init(10000723, 30021002, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市寶石商店(30021002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000724 : RandomPortal
    {
        public P10000724()
        {
            Init(10000724, 10063100, 137, 177, 137, 177);
        }
    }
    //原始地圖:阿伊恩市寶石商店(30021002)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(137,177) ~ (137,177)

    public class P10000725 : RandomPortal
    {
        public P10000725()
        {
            Init(10000725, 30060003, 4, 7, 4, 7);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市商店(30060003)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000726 : RandomPortal
    {
        public P10000726()
        {
            Init(10000726, 10063100, 125, 172, 125, 172);
        }
    }
    //原始地圖:阿伊恩市商店(30060003)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(125,172) ~ (125,172)

    public class P10000727 : RandomPortal
    {
        public P10000727()
        {
            Init(10000727, 30011003, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市鑑定所(30011003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000728 : RandomPortal
    {
        public P10000728()
        {
            Init(10000728, 10063100, 121, 170, 121, 170);
        }
    }
    //原始地圖:阿伊恩市鑑定所(30011003)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(121,170) ~ (121,170)

    public class P10000729 : RandomPortal
    {
        public P10000729()
        {
            Init(10000729, 30010003, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市上層(10063100)
    //目標地圖:阿伊恩市咖啡館(30010003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000730 : RandomPortal
    {
        public P10000730()
        {
            Init(10000730, 10063100, 119, 167, 119, 167);
        }
    }
    //原始地圖:阿伊恩市咖啡館(30010003)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(119,167) ~ (119,167)

    public class P10000731 : RandomPortal
    {
        public P10000731()
        {
            Init(10000731, 30071000, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市之民家(30071000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000732 : RandomPortal
    {
        public P10000732()
        {
            Init(10000732, 10066000, 85, 77, 85, 77);
        }
    }
    //原始地圖:阿伊恩市之民家(30071000)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(85,77) ~ (85,77)

    public class P10000733 : RandomPortal
    {
        public P10000733()
        {
            Init(10000733, 30081000, 10, 20, 11, 21);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:大工場大廳(30081000)
    //目標坐標:(10,20) ~ (11,21)

    public class P10000734 : RandomPortal
    {
        public P10000734()
        {
            Init(10000734, 30081000, 10, 20, 11, 21);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:大工場大廳(30081000)
    //目標坐標:(10,20) ~ (11,21)

    public class P10000735 : RandomPortal
    {
        public P10000735()
        {
            Init(10000735, 10066000, 154, 145, 157, 147);
        }
    }
    //原始地圖:大工場大廳(30081000)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(154,145) ~ (157,147)

    public class P10000736 : RandomPortal
    {
        public P10000736()
        {
            Init(10000736, 30082000, 10, 20, 11, 21);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:鋼鐵工廠大廳(30082000)
    //目標坐標:(10,20) ~ (11,21)

    public class P10000737 : RandomPortal
    {
        public P10000737()
        {
            Init(10000737, 30082000, 10, 20, 11, 21);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:鋼鐵工廠大廳(30082000)
    //目標坐標:(10,20) ~ (11,21)

    public class P10000738 : RandomPortal
    {
        public P10000738()
        {
            Init(10000738, 10066000, 154, 60, 157, 62);
        }
    }
    //原始地圖:鋼鐵工廠大廳(30082000)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(154,60) ~ (157,62)

    public class P10000739 : RandomPortal
    {
        public P10000739()
        {
            Init(10000739, 30012002, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市武器商店(30012002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000740 : RandomPortal
    {
        public P10000740()
        {
            Init(10000740, 10066000, 121, 52, 122, 52);
        }
    }
    //原始地圖:阿伊恩市武器商店(30012002)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(121,52) ~ (122,52)

    public class P10000741 : RandomPortal
    {
        public P10000741()
        {
            Init(10000741, 30013001, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市武器製造所(30013001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000742 : RandomPortal
    {
        public P10000742()
        {
            Init(10000742, 10066000, 135, 63, 136, 63);
        }
    }
    //原始地圖:阿伊恩市武器製造所(30013001)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(135,63) ~ (136,63)

    public class P10000743 : RandomPortal
    {
        public P10000743()
        {
            Init(10000743, 30014001, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市古董商店(30014001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000744 : RandomPortal
    {
        public P10000744()
        {
            Init(10000744, 10066000, 139, 63, 140, 63);
        }
    }
    //原始地圖:阿伊恩市古董商店(30014001)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(139,63) ~ (140,63)

    public class P10000745 : RandomPortal
    {
        public P10000745()
        {
            Init(10000745, 30060004, 4, 7, 4, 7);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市商店(30060004)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000746 : RandomPortal
    {
        public P10000746()
        {
            Init(10000746, 10066000, 121, 155, 122, 155);
        }
    }
    //原始地圖:阿伊恩市商店(30060004)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(121,155) ~ (122,155)

    public class P10000747 : RandomPortal
    {
        public P10000747()
        {
            Init(10000747, 30010004, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市咖啡館(30010004)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000748 : RandomPortal
    {
        public P10000748()
        {
            Init(10000748, 10066000, 135, 144, 136, 144);
        }
    }
    //原始地圖:阿伊恩市咖啡館(30010004)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(135,144) ~ (136,144)

    public class P10000749 : RandomPortal
    {
        public P10000749()
        {
            Init(10000749, 30011004, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:阿伊恩市鑑定所(30011004)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000750 : RandomPortal
    {
        public P10000750()
        {
            Init(10000750, 10066000, 139, 144, 140, 144);
        }
    }
    //原始地圖:阿伊恩市鑑定所(30011004)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(139,144) ~ (140,144)

    public class S10000769 : Event
    {
        public S10000769()
        {
            this.EventID = 10000769;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Job2X_12> Job2X_12_mask = pc.CMask["Job2X_12"];

            if (Job2X_12_mask.Test(Job2X_12.收集石油) && !Job2X_12_mask.Test(Job2X_12.給予石油))
            {
                Warp(pc, 30077001, 8, 12);
                return;
            }

            Warp(pc, 30077000, 8, 12);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:動力制御室(30077000)
    //目標坐標:(8,12) ~ (8,12)

    public class P10000770 : RandomPortal
    {
        public P10000770()
        {
            Init(10000770, 10066000, 175, 102, 177, 105);
        }
    }
    //原始地圖:動力制御室(30077000)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(175,102) ~ (177,105)
}