using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;

namespace SagaScript
{

    public class P10000183 : RandomPortal
    {
        public P10000183()
        {
            Init(10000183, 10002000, 49, 221, 50, 222);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:瑞路斯雪原(10002000)
    //目標坐標:(49,221) ~ (50,222)

    public class P10000184 : RandomPortal
    {
        public P10000184()
        {
            Init(10000184, 20010000, 43, 67, 44, 68);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(43,67) ~ (44,68)

    public class P10000185 : RandomPortal
    {
        public P10000185()
        {
            Init(10000185, 20010000, 57, 65, 58, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(57,65) ~ (58,66)

    public class P10000186 : RandomPortal
    {
        public P10000186()
        {
            Init(10000186, 20010000, 89, 65, 90, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(89,65) ~ (90,66)

    public class P10000187 : RandomPortal
    {
        public P10000187()
        {
            Init(10000187, 20010000, 69, 65, 70, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(69,65) ~ (70,66)

    public class P10000188 : RandomPortal
    {
        public P10000188()
        {
            Init(10000188, 20010000, 99, 112, 101, 115);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(99,112) ~ (101,115)

    public class P10000189 : RandomPortal
    {
        public P10000189()
        {
            Init(10000189, 20010000, 110, 111, 113, 113);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(110,111) ~ (113,113)

    public class P10000191 : RandomPortal
    {
        public P10000191()
        {
            Init(10000191, 20010000, 62, 75, 65, 77);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(62,75) ~ (65,77)

    public class P10000192 : RandomPortal
    {
        public P10000192()
        {
            Init(10000192, 20011000, 12, 108, 13, 111);
        }
    }
    //原始地圖:冰結的坑道B1F(20010000)
    //目標地圖:冰結的坑道B2F(20011000)
    //目標坐標:(12,108) ~ (13,111)

    public class P10000193 : RandomPortal
    {
        public P10000193()
        {
            Init(10000193, 20010000, 11, 108, 12, 111);
        }
    }
    //原始地圖:冰結的坑道B2F(20011000)
    //目標地圖:冰結的坑道B1F(20010000)
    //目標坐標:(11,108) ~ (12,111)

    public class P10000196 : RandomPortal
    {
        public P10000196()
        {
            Init(10000196, 20012000, 113, 64, 114, 67);
        }
    }
    //原始地圖:冰結的坑道B2F(20011000)
    //目標地圖:冰結的坑道B3F(20012000)
    //目標坐標:(113,64) ~ (114,67)

    public class P10000197 : RandomPortal
    {
        public P10000197()
        {
            Init(10000197, 20011000, 115, 64, 116, 67);
        }
    }
    //原始地圖:冰結的坑道B3F(20012000)
    //目標地圖:冰結的坑道B2F(20011000)
    //目標坐標:(115,64) ~ (116,67)

    public class P10000198 : RandomPortal
    {
        public P10000198()
        {
            Init(10000198, 20012000, 57, 64, 59, 67);
        }
    }
    //原始地圖:冰結的坑道B3F(20012000)
    //目標地圖:冰結的坑道B3F(20012000)
    //目標坐標:(57,64) ~ (59,67)

    public class P10000199 : RandomPortal
    {
        public P10000199()
        {
            Init(10000199, 20012000, 77, 65, 78, 66);
        }
    }
    //原始地圖:冰結的坑道B3F(20012000)
    //目標地圖:冰結的坑道B3F(20012000)
    //目標坐標:(77,65) ~ (78,66)
    public class P10000248 : RandomPortal
    {
        public P10000248()
        {
            Init(10000248, 10003000, 2, 31, 3, 34);
        }
    }
    //原始地圖:瑞路斯雪原(10002000)
    //目標地圖:瑞路斯山道(10003000)
    //目標坐標:(2,31) ~ (3,34)

    public class P10000249 : RandomPortal
    {
        public P10000249()
        {
            Init(10000249, 10002000, 252, 30, 253, 33);
        }
    }
    //原始地圖:瑞路斯山道(10003000)
    //目標地圖:瑞路斯雪原(10002000)
    //目標坐標:(252,30) ~ (253,33)

    public class P10000250 : RandomPortal
    {
        public P10000250()
        {
            Init(10000250, 10003000, 77, 252, 80, 254);
        }
    }
    //原始地圖:奧克魯尼亞北部平原(10014000)
    //目標地圖:瑞路斯山道(10003000)
    //目標坐標:(77,252) ~ (80,254)

    public class P10000251 : RandomPortal
    {
        public P10000251()
        {
            Init(10000251, 10014000, 78, 1, 81, 3);
        }
    }
    //原始地圖:瑞路斯山道(10003000)
    //目標地圖:奧克魯尼亞北部平原(10014000)
    //目標坐標:(78,1) ~ (81,3)

    public class P10000252 : RandomPortal
    {
        public P10000252()
        {
            Init(10000252, 10004000, 2, 209, 3, 212);
        }
    }
    //原始地圖:瑞路斯山道(10003000)
    //目標地圖:瑞路斯分岔路(10004000)
    //目標坐標:(2,209) ~ (3,212)

    public class P10000253 : RandomPortal
    {
        public P10000253()
        {
            Init(10000253, 10003000, 252, 209, 253, 212);
        }
    }
    //原始地圖:瑞路斯分岔路(10004000)
    //目標地圖:瑞路斯山道(10003000)
    //目標坐標:(252,209) ~ (253,212)

    public class P10000254 : RandomPortal
    {
        public P10000254()
        {
            Init(10000254, 10001000, 194, 252, 197, 253);
        }
    }
    //原始地圖:瑞路斯分岔路(10004000)
    //目標地圖:北方海角(10001000)
    //目標坐標:(194,252) ~ (197,253)

    public class P10000255 : RandomPortal
    {
        public P10000255()
        {
            Init(10000255, 10004000, 193, 2, 196, 3);
        }
    }
    //原始地圖:北方海角(10001000)
    //目標地圖:瑞路斯分岔路(10004000)
    //目標坐標:(193,2) ~ (196,3)

    public class P10000276 : RandomPortal
    {
        public P10000276()
        {
            Init(10000276, 10004000, 2, 57, 3, 60);
        }
    }
    //原始地圖:瑞路斯山道(10003000)
    //目標地圖:瑞路斯分岔路(10004000)
    //目標坐標:(2,57) ~ (3,60)

    public class P10000277 : RandomPortal
    {
        public P10000277()
        {
            Init(10000277, 10003000, 252, 57, 253, 60);
        }
    }
    //原始地圖:瑞路斯分岔路(10004000)
    //目標地圖:瑞路斯山道(10003000)
    //目標坐標:(252,57) ~ (253,60)

    public class P10000326 : RandomPortal
    {
        public P10000326()
        {
            Init(10000326, 20010001, 42, 66, 45, 68);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(42,66) ~ (45,68)

    public class P10000327 : RandomPortal
    {
        public P10000327()
        {
            Init(10000327, 20010001, 57, 65, 58, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(57,65) ~ (58,66)

    public class P10000328 : RandomPortal
    {
        public P10000328()
        {
            Init(10000328, 20010001, 89, 65, 90, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(89,65) ~ (90,66)

    public class P10000329 : RandomPortal
    {
        public P10000329()
        {
            Init(10000329, 20010001, 69, 65, 70, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(69,65) ~ (70,66)

    public class P10000330 : RandomPortal
    {
        public P10000330()
        {
            Init(10000330, 20010001, 99, 112, 101, 115);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(99,112) ~ (101,115)

    public class P10000331 : RandomPortal
    {
        public P10000331()
        {
            Init(10000331, 20010001, 110, 111, 113, 113);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(110,111) ~ (113,113)

    public class P10000334 : RandomPortal
    {
        public P10000334()
        {
            Init(10000334, 20011001, 11, 108, 13, 111);
        }
    }
    //原始地圖:冰結的坑道B1F(20010001)
    //目標地圖:冰結的坑道B2F(20011001)
    //目標坐標:(11,108) ~ (13,111)

    public class P10000335 : RandomPortal
    {
        public P10000335()
        {
            Init(10000335, 20010001, 10, 108, 12, 111);
        }
    }
    //原始地圖:冰結的坑道B2F(20011001)
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(10,108) ~ (12,111)

    public class P10000338 : RandomPortal
    {
        public P10000338()
        {
            Init(10000338, 20012001, 113, 64, 115, 67);
        }
    }
    //原始地圖:冰結的坑道B2F(20011001)
    //目標地圖:冰結的坑道B3F(20012001)
    //目標坐標:(113,64) ~ (115,67)

    public class P10000339 : RandomPortal
    {
        public P10000339()
        {
            Init(10000339, 20011001, 115, 64, 117, 67);
        }
    }
    //原始地圖:冰結的坑道B3F(20012001)
    //目標地圖:冰結的坑道B2F(20011001)
    //目標坐標:(115,64) ~ (117,67)

    public class P10000340 : RandomPortal
    {
        public P10000340()
        {
            Init(10000340, 20012001, 57, 64, 59, 67);
        }
    }
    //原始地圖:冰結的坑道B3F(20012001)
    //目標地圖:冰結的坑道B3F(20012001)
    //目標坐標:(57,64) ~ (59,67)

    public class P10000341 : RandomPortal
    {
        public P10000341()
        {
            Init(10000341, 20012001, 76, 64, 78, 67);
        }
    }
    //原始地圖:冰結的坑道B3F(20012001)
    //目標地圖:冰結的坑道B3F(20012001)
    //目標坐標:(76,64) ~ (78,67)

    public class P10000344 : RandomPortal
    {
        public P10000344()
        {
            Init(10000344, 20010002, 62, 11, 65, 13);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(62,11) ~ (65,13)

    public class P10000345 : RandomPortal
    {
        public P10000345()
        {
            Init(10000345, 20010002, 42, 66, 45, 68);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(42,66) ~ (45,68)

    public class P10000346 : RandomPortal
    {
        public P10000346()
        {
            Init(10000346, 20010002, 57, 65, 58, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(57,65) ~ (58,66)

    public class P10000347 : RandomPortal
    {
        public P10000347()
        {
            Init(10000347, 20010002, 89, 65, 90, 66);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(89,65) ~ (90,66)

    public class P10000348 : RandomPortal
    {
        public P10000348()
        {
            Init(10000348, 20010002, 73, 64, 75, 67);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(73,64) ~ (75,67)

    public class P10000349 : RandomPortal
    {
        public P10000349()
        {
            Init(10000349, 20010002, 99, 112, 101, 115);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(99,112) ~ (101,115)

    public class P10000350 : RandomPortal
    {
        public P10000350()
        {
            Init(10000350, 20010002, 110, 111, 113, 113);
        }
    }
    //原始地圖:冰結的坑道B1F(20010002)
    //目標地圖:冰結的坑道B1F(20010002)
    //目標坐標:(110,111) ~ (113,113)

    public class P10000468 : Event
    {
        public P10000468()
        {
            this.EventID = 10000468;
        }
        public override void OnEvent(ActorPC pc)
        {
            BitMask<Knights> Knights_mask = pc.CMask["Knights"];

            if (pc.Account.GMLevel >= 100)
            {
                Warp(pc, 10049000, 147, 252);
                return;
            }
            if (pc.Skills2.ContainsKey(706) || pc.SkillsReserve.ContainsKey(706))
            {
                Warp(pc, 10049000, 147, 252);
                return;
            }
            if (Knights_mask.Test(Knights.北國過境檢查完成))
            {
                Warp(pc, 10049000, 147, 252);
                return;
            }
            Say(pc, 131, "您不能入境唷$R;" +
                "$R請接受諾頓$R;" +
                "國境警備員的入境審查吧$R;");
        }
        //原始地圖:北方海角(10001000)
        //目標地圖:北方高原(10049000)
        //目標坐標:(146,251) ~ (149,253)

        public class P10001262 : RandomPortal
        {
            public P10001262()
            {
                Init(10001262, 10002001, 217, 21, 219, 23);
            }
        }
        //原始地圖:瑞路斯雪原(10002000)
        //目標地圖:瑞路斯雪原寵物養殖場(10002001)
        //目標坐標:(217,21) ~ (219,23)

        public class P10001263 : RandomPortal
        {
            public P10001263()
            {
                Init(10001263, 10002000, 217, 21, 219, 23);
            }
        }
        //原始地圖:瑞路斯雪原寵物養殖場(10002001)
        //目標地圖:瑞路斯雪原(10002000)
        //目標坐標:(217,21) ~ (219,23)
        public class P10001323 : Event
        {
            public P10001323()
            {
                this.EventID = 10001323;
            }

            public override void OnEvent(ActorPC pc)
            {
                if (pc.Level < 15)
                {
                    Warp(pc, 30091001, 6, 15);
                }
                else
                {
                    Say(pc, 0, 65535, "……??$R;" +
                                      "$R不能進入?$R;" +
                                      "$P啊…忘記說了。$R;" +
                                      "$R有一定經驗的人不能進入「初心者學校」呀!$R;", " ");
                }
            }
        }
        //原始地圖:奧克魯尼亞北部平原(10014000)
        //目標地圖:北部平原初心者學校(30091004)
        //目標坐標:(6,15) ~ (6,15)

        public class P10001324 : Event
        {
            public P10001324()
            {
                this.EventID = 10001324;
            }

            public override void OnEvent(ActorPC pc)
            {
                switch (Select(pc, "想去哪裡呢?", "", "奧克魯尼亞東部平原", "奧克魯尼亞西部平原", "奧克魯尼亞南部平原", "奧克魯尼亞北部平原", "不出去"))
                {
                    case 1:
                        Warp(pc, 10025000, 108, 123);
                        break;

                    case 2:
                        Warp(pc, 10022000, 143, 133);
                        break;

                    case 3:
                        Warp(pc, 10031000, 132, 121);
                        break;

                    case 4:
                        Warp(pc, 10014000, 123, 147);
                        break;

                    case 5:
                        break;
                }
            }
        }
        //原始地圖:北部平原初心者學校(30091004)
        //目標地圖:奧克魯尼亞北部平原(10014000)
        //目標坐標:(123,147) ~ (123,147)
    }
}