
using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaDB.Item;
using SagaMap;
using SagaMap.Skill;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M30210000
{
    public class S80000703 : Event
    {
        public S80000703()
        {
            this.EventID = 80000703;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (pc.CInt["灾祸的见证者任务"] == 4)
            {
                Say(pc, 2133, "嗯……", "夏影");
                Select(pc, " ", "", "怎么样？");
                Say(pc, 132, "唔…事情还真是有意思起来了呢。", "夏影");
                Say(pc, 131, "只要简单看一下就能知道，$R那孩子并不是幽灵。$R但是恐怕，她也…不是人类。", "夏影");
                Wait(pc, 600);
                Say(pc, 0, "还记得我曾经给你们展示过的吗。$R魔导师实现魔法的原理就是依照自己的意志$R改变魔力的形态。$R$R只要能力足够，$R将魔法具现化为实体也是轻而易举的。", "夏影");
                Say(pc, 0, "通过魔法创造出人形是很容易的，$R我们一般称之为活幽灵。$R但是这样创造出来的活幽灵，$R本质上来说$R仅仅只是一具按照设定好的程序运行的应答机而已。", "夏影");
                Say(pc, 0, "这个孩子恐怕就是这样的存在。$R她除了按照设定好的程序，$R对冒险者发布委托，支付报酬以外。$R不会做出任何在此之外的行动。", "夏影");
                Say(pc, 0, "但是，$R活幽灵也仅仅只是这样的存在而已了…$R$R还记得我告诉你们的吗，$R魔导师的力量能发挥到什么程度，$R取决于你对这个世界的了解程度。$R如果你想要用魔法创造一件事物，$R你必须先深刻理解它。", "夏影");
                Say(pc, 0, "对人体的研究与实验$R不论在什么时代都是无上的禁忌。$R而没有足够的知识支撑的话，$R仅仅通过魔法是不可能创造出$R能够自我思考的生命的。", "夏影");
                Say(pc, 0, "这就解释了为什么她能够$R从东之国的惨剧中幸存下来，$R也没有受到夺魂者的影响。$R她只是纯粹由魔力构成的存在而已，$R并没有自己的灵魂。", "夏影");
                Say(pc, 0, "我倒是比较好奇，$R如果这个女孩真的是活幽灵的话，$R创造她的魔导师又是谁呢，$R为什么会将她留在$R这样一座死城中不闻不问呢？$R$R活幽灵这样的魔法，$R是需要从与主人的魔力链接中$R不断汲取魔力才能维持存在的…", "夏影");
                Say(pc, 0, "主人……？", "幽灵少女");
                ShowEffect(pc, 4539);
                ShowEffect(pc,6,4, 4539);
                NPCMove(pc, 80000703, 6, 4, 300, 5, 7, 121, 10, 0);
                Select(pc, " ", "", "？？？？");
                Say(pc, 0, "……你们刚才说了…主人？", "幽灵少女");
                Say(pc, 2036, "这，这是…？", "夏影");
                Say(pc, 0, "这孩子，$R听懂了我们在说什么……？", "夏影");
                Say(pc, 0, "……我不知道$R…但是，我听到你们说到主人…$R请告诉我，主人……主人在哪里？", "幽灵少女");
                Select(pc, " ", "", "冷静下来。你说的主人，究竟是谁？");
                Say(pc, 0, "…我不知道…$R…我…从意识到开始，就已经在这里了。$R我没有见过主人……$R$R不对…我是见过的，但是我…想不起来……", "幽灵少女");
                NPCMove(pc, 80000703, 6, 4, 300, 6, 7, 121, 10, 0);
                Select(pc, " ", "", "还有这种操作？");
                Say(pc, 2036, "……不，就算你问我…$R这种有自我意识的活幽灵$R我也是第一次见到……", "夏影");
                Wait(pc, 1000);
                Say(pc, 0, "虽然说她是活幽灵，$R留在这里也不会有什么事…$R不过相比来说我更好奇她的主人究竟是谁。", "夏影");
                Say(pc, 0, "能够制造出这样的活幽灵，$R想必是一个相当厉害的魔导师吧…$R回到鱼缸岛以后我要好好调查一下。", "夏影");
                pc.CInt["灾祸的见证者任务"] = 5;
                return;
            }
            else
                Say(pc, 0, "唔…", "夏影");
                Say(pc, 0, "暂且先回去鱼缸岛吧。", "夏影");

        }
    }
}

