using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
//所在地圖:諾頓咖啡館2(30010002) NPC基本信息:熊太郎(11000269) X:1 Y:3
namespace SagaScript.M30010002
{
    public class S11000269 : Event
    {
        public S11000269()
        {
            this.EventID = 11000269;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<LV35_Clothes_04> LV35_Clothes_04_mask = new BitMask<LV35_Clothes_04>(pc.CMask["LV35_Clothes_04"]);

            if (!LV35_Clothes_04_mask.Test(LV35_Clothes_04.熊太郎的委託完成))
            {
                熊太郎的委託(pc);
                return;
            }

            Say(pc, 11000269, 131, "嘿嘿嘿，$R;" +
                                   "可以跟「瓦雷利亚」在一起，$R;" +
                                   "实在是很高兴，$R;" +
                                   "非常另人高兴啊!!$R;", "熊太郎");

            switch (Select(pc, "想要买什么呢?", "", "魔法装备", "什么也不买"))
            {
                case 1:
                    OpenShopBuy(pc, 64);
                    break;

                case 2:
                    break;
            }
        }

        void 熊太郎的委託(ActorPC pc)
        {
            if (pc.CInt["LV35_Clothes_04"] == 0)
            {
                熊太郎告知想吃的料理(pc);
                return;
            }
            else
            {
                把料理交給熊太郎(pc);
                return;
            }
        }

        void 熊太郎告知想吃的料理(ActorPC pc)
        {
            int selection;

            if (pc.Level < 20)
            {
                Say(pc, 11000269, 131, "咇咯嘶? 咇咯嘶?$R;" +
                                       "咇咯咇咯咇咯!$R;" +
                                       "我叫「熊太郎」。$R;" +
                                       "$P这家店里，$R;" +
                                       "有「瓦雷利亚」的美食。$R;" +
                                       "$R好像不合人类的口味，$R;" +
                                       "但对少数民族同胞来说。$R;" +
                                       "是非常有名的店呢!$R;" +
                                       "$P从到这里来的人们那，$R;" +
                                       "收集材料是我应该做的事情!$R;" +
                                       "$R请多多关照!!$R;", "熊太郎");

                selection = Global.Random.Next(1, 10);

                pc.CInt["LV35_Clothes_04"] = selection;

                switch (pc.CInt["LV35_Clothes_04"])
                {
                    case 1:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『甜梅酱』是很好吃的东西。$R;" +
                                               "$R真想吃夹有美味果酱的鲜果馅饼啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30罐『甜梅酱』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;

                    case 2:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『果酱』是很好吃的东西。$R;" +
                                               "$R真想吃夹有美味果酱的鲜果馅饼啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30罐『果酱』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;

                    case 3:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『苹果酱』是很好吃的东西。$R;" +
                                               "$R真想吃夹有美味果酱的鲜果馅饼啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30罐『苹果酱』。$R;" +
                                               "$R拜託!$R;", "熊太郎");
                        break;

                    case 4:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『橙子酱』是很好吃的东西。$R;" +
                                               "$R真想吃夹有美味果酱的鲜果馅饼啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30罐『橙子酱』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;

                    case 5:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『杏汁』很好喝哦!$R;" +
                                               "$R是让人感到爽快的新鲜饮料啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30瓶『杏汁』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;

                    case 6:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『果汁』很好喝哦!$R;" +
                                               "$R是让人感到爽快的新鲜饮料啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30瓶『果汁』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;

                    case 7:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『苹果汁』很好喝哦!$R;" +
                                               "$R是让人感到爽快的新鲜饮料啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30瓶『苹果汁』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;

                    case 8:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『橙汁』很好喝唷!$R;" +
                                               "$R是让人感到爽快的新鲜饮料啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30瓶『橙汁』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;

                    case 9:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『黄油』很好吃的喔!$R;" +
                                               "$R好的奶油是很香的。$R;" +
                                               "$P来!$R;" +
                                               "给我85块『黄油』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;

                    case 10:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『煮鸡蛋』很好吃的哦!$R;" +
                                               "$R是半熟，还是全熟?$R;" +
                                               "热乎乎的煮鸡蛋耶!$R;" +
                                               "$P来!$R;" +
                                               "给我50颗『煮鸡蛋』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;
                }
            }
            else
            {
                Say(pc, 11000269, 131, "咇咯嘶? 咇咯嘶?$R;" +
                                       "咇咯咇咯咇咯!$R;" +
                                       "我叫「熊太郎」。$R;" +
                                       "$P这家店里，$R;" +
                                       "有「瓦雷利亚」的美食。$R;" +
                                       "$R好像不合人类的口味，$R;" +
                                       "但对少数民族同胞来说。$R;" +
                                       "是非常有名的店呢!$R;" +
                                       "$P从到这里来的人们那，$R;" +
                                       "收集材料是我应该做的事情!$R;" +
                                       "$R请多多关照!!$R;", "熊太郎");

                selection = Global.Random.Next(11, 12);

                pc.CInt["LV35_Clothes_04"] = selection;

                switch (pc.CInt["LV35_Clothes_04"])
                {
                    case 11:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『高级肉』很好吃的呀!$R;" +
                                               "$R又嫩又香的。$R;" +
                                               "$P来!$R;" +
                                               "给我30块『高级肉』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;

                    case 12:
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着。$R;" +
                                               "『鱼子酱』很好吃的哦!$R;" +
                                               "$R又嫩又美味。$R;" +
                                               "$P来!$R;" +
                                               "给我3份『鱼子酱』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                        break;
                }
            }
        }

        void 把料理交給熊太郎(ActorPC pc)
        {
            BitMask<LV35_Clothes_04> LV35_Clothes_04_mask = new BitMask<LV35_Clothes_04>(pc.CMask["LV35_Clothes_04"]);

            switch (pc.CInt["LV35_Clothes_04"])
            {
                case 1:
                    if (CountItem(pc, 10033908) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10033908, 30);
                        Say(pc, 0, 0, "把『甜梅酱』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                                "『甜梅酱』是很好吃的东西。$R;" +
                                                "$R真想吃夹有美味果酱的鲜果馅饼啊?$R;" +
                                                "$P来!$R;" +
                                                "给我30罐『甜梅酱』。$R;" +
                                                "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 2:
                    if (CountItem(pc, 10033900) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10033900, 30);
                        Say(pc, 0, 0, "把『果酱』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『果酱』是很好吃的东西。$R;" +
                                               "$R真想吃夹有美味果酱的鲜果馅饼啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30罐『果酱』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 3:
                    if (CountItem(pc, 10033901) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10033901, 30);
                        Say(pc, 0, 0, "把『苹果酱』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『苹果酱』是很好吃的东西。$R;" +
                                               "$R真想吃夹有美味果酱的鲜果馅饼啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30罐『苹果酱』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 4:
                    if (CountItem(pc, 10033907) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10033907, 30);
                        Say(pc, 0, 0, "把『橙子酱』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                       Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                              "『橙子酱』是很好吃的东西。$R;" +
                                              "$R真想吃夹有美味果酱的鲜果馅饼啊?$R;" +
                                              "$P来!$R;" +
                                              "给我30罐『橙子酱』。$R;" +
                                              "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 5:
                    if (CountItem(pc, 10001806) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10001806, 30);
                        Say(pc, 0, 0, "把『杏汁』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『杏汁』很好喝哦!$R;" +
                                               "$R是让人感到爽快的新鲜饮料啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30瓶『杏汁』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 6:
                    if (CountItem(pc, 10001600) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10001600, 30);
                        Say(pc, 0, 0, "把『果汁』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『果汁』很好喝哦!$R;" +
                                               "$R是让人感到爽快的新鲜饮料啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30瓶『果汁』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 7:
                    if (CountItem(pc, 10001807) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10001807, 30);
                        Say(pc, 0, 0, "把『苹果汁』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『苹果汁』很好喝哦!$R;" +
                                               "$R是让人感到爽快的新鲜饮料啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30瓶『苹果汁』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 8:
                    if (CountItem(pc, 10001808) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10001808, 30);
                        Say(pc, 0, 0, "把『橙汁』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『橙汁』很好喝哦!$R;" +
                                               "$R是让人感到爽快的新鲜饮料啊?$R;" +
                                               "$P来!$R;" +
                                               "给我30瓶『橙汁』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 9:
                    if (CountItem(pc, 10008450) >= 85)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10008450, 85);
                        Say(pc, 0, 0, "把『黄油』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『黄油』很好吃的喔!$R;" +
                                               "$R好的奶油是很香的。$R;" +
                                               "$P来!$R;" +
                                               "给我85块『黄油』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 10:
                    if (CountItem(pc, 10007750) >= 50)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10007750, 50);
                        Say(pc, 0, 0, "把『煮鸡蛋』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『煮鸡蛋』很好吃的哦!$R;" +
                                               "$R是半熟，还是全熟?$R;" +
                                               "热乎乎的煮鸡蛋耶!$R;" +
                                               "$P来!$R;" +
                                               "给我50颗『煮鸡蛋』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 11:
                    if (CountItem(pc, 10006400) >= 30)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10006400, 30);
                        Say(pc, 0, 0, "把『高级肉』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着，$R;" +
                                               "『高级肉』很好吃的呀!$R;" +
                                               "$R又嫩又香的。$R;" +
                                               "$P来!$R;" +
                                               "给我30块『高级肉』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                    }
                    break;

                case 12:
                    if (CountItem(pc, 10015250) >= 3)
                    {
                        LV35_Clothes_04_mask.SetValue(LV35_Clothes_04.熊太郎的委託完成, true);

                        PlaySound(pc, 2040, false, 100, 50);
                        TakeItem(pc, 10015250, 3);
                        Say(pc, 0, 0, "把『鱼子酱』交给它。$R;", " ");

                        Say(pc, 11000269, 131, "太谢谢了!!$R;" +
                                               "$R用这个就可以吃到$R;" +
                                               "「瓦雷利亚」的美食吧?!$R;", "熊太郎");
                    }
                    else
                    {
                        Say(pc, 11000269, 131, "「瓦雷利亚」的秘密便条里写着。$R;" +
                                               "『鱼子酱』很好吃的哦!$R;" +
                                               "$R又嫩又美味。$R;" +
                                               "$P来!$R;" +
                                               "给我3份『鱼子酱』。$R;" +
                                               "$R拜托!$R;", "熊太郎");
                    }
                    break;
            }
        }
    }
}
