using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;

namespace SagaScript
{
   
    public class P10000108 : RandomPortal
    {
        public P10000108()
        {
            Init(10000108, 10014002, 126, 197, 129, 199);
        }
    }
    //原始地圖:塔妮亞傳送室(30140000)
    //目標地圖:指導地圖(10014002)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000109 : RandomPortal
    {
        public P10000109()
        {
            Init(10000109, 10014002, 126, 197, 129, 199);
        }
    }
    //原始地圖:道米尼傳送室(30141000)
    //目標地圖:指導地圖(10014002)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000110 : RandomPortal
    {
        public P10000110()
        {
            Init(10000110, 30140000, 9, 14, 13, 19);
        }
    }
    //原始地圖:指導地圖(10014002)
    //目標地圖:塔妮亞傳送室(30140000)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000111 : RandomPortal
    {
        public P10000111()
        {
            Init(10000111, 30141000, 9, 14, 13, 19);
        }
    }
    //原始地圖:指導地圖(10014002)
    //目標地圖:道米尼傳送室(30141000)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000113 : RandomPortal
    {
        public P10000113()
        {
            Init(10000113, 50027000, 10, 10, 10, 10);
        }
    }
    //原始地圖:
    //目標地圖:埃米爾族的夢中(50027000)
    //目標坐標:(10,10) ~ (10,10)

    public class P10000114 : RandomPortal
    {
        public P10000114()
        {
            Init(10000114, 50028000, 10, 10, 10, 10);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞世界的幻影(50028000)
    //目標坐標:(10,10) ~ (10,10)

    public class P10000115 : RandomPortal
    {
        public P10000115()
        {
            Init(10000115, 50029000, 10, 10, 10, 10);
        }
    }
    //原始地圖:
    //目標地圖:道米尼世界的幻影(50029000)
    //目標坐標:(10,10) ~ (10,10)

    public class P10000116 : RandomPortal
    {
        public P10000116()
        {
            Init(10000116, 50030000, 10, 10, 10, 10);
        }
    }
    //原始地圖:
    //目標地圖:阿高普路斯市司令室(50030000)
    //目標坐標:(10,10) ~ (10,10)

    public class P10000117 : Event
    {
        public P10000117()
        {
            this.EventID = 10000117;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            int newMap;

            if (!Beginner_01_mask.Test(Beginner_01.司令官下令發射主砲))
            {
                司令官下令發射主砲(pc);
                return;
            }

            newMap = CreateMapInstance(50031000, 10023100, 250, 132);

            LoadSpawnFile(newMap, "DB/Spawns/50031000.xml");

            Warp(pc, (uint)newMap, 7, 38);

            DeleteMapInstance(pc.CInt["Beginner_Map"]);

            pc.CInt["Beginner_Map"] = newMap;
        }

        void 司令官下令發射主砲(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            Beginner_01_mask.SetValue(Beginner_01.司令官下令發射主砲, true);

            Say(pc, 0, 65535, "左邊的高射炮!$R;" +
                              "在幹什麼! 給我好好幹阿!$R;", "司令官");

            Say(pc, 0, 65535, "敵人的機甲要塞，緊急靠近中!$R;" +
                              "$R攻擊輸出功率下降 30%!$R;" +
                              "不能再抵抗了!$R;", "操作員");

            Say(pc, 0, 65535, "敵人已經在右邊上城區域登陸了!$R;" +
                             "好像已被突破防線了阿啊!$R;", "操作員");

            Say(pc, 0, 65535, "預備部隊集合!!$R:" +
                              "不論怎麼樣…$R;" +
                              "絕對不能讓敵人侵入中央區。$R;" +
                              "$P……好的，卸下機動模式!$R;" +
                              "$R集合城裡的戰鬥力，$R;" +
                              "發射威力最大的主炮呀!$R;" +
                              "目標是敵人的機甲要塞『瑪依瑪依』。$R;", "司令官");

            Say(pc, 0, 65535, "司…司令…要是…$R;" +
                              "$R…失去動力的話，$R;" +
                              "阿高普路斯市怎麼辦…$R;", "操作員");

            Say(pc, 0, 65535, "反正這樣不能持續多久的，$R;" +
                              "$R這次就跟他們決一死戰!$R;" +
                              "一口氣消滅那幫傢伙們阿!$R;", "司令官");

            Say(pc, 0, 65535, "知…知道了!$R;" +
                              "進入發射主炮群!$R;", "操作員");

            Say(pc, 0, 65535, "…!!什麼…!!$R;" +
                              "$R那些平民到這裡來想幹什麼?$R;" +
                              "$P已經下令戒嚴!$R;" +
                              "讓他們立即躲避呀!$R;", "司令官");
        }
    }
    //原始地圖:阿高普路斯市司令室(50030000)
    //目標地圖:阿高普路斯市市走道(50031000)
    //目標坐標:(7,38) ~ (7,38)

    public class P10000118 : Event
    {
        public P10000118()
        {
            this.EventID = 10000118;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = pc.CMask["Beginner_01"];

            byte x, y;

            if (!Beginner_01_mask.Test(Beginner_01.離開阿高普路斯市))
            {
                Beginner_01_mask.SetValue(Beginner_01.離開阿高普路斯市, true);

                Say(pc, 0, 65535, "阿高普路斯市…$R;" +
                                  "沉下去了$R;", " ");

                PlaySound(pc, 2437, false, 100, 50);
                Wait(pc, 990);

                ShowEffect(pc, 2, 5, 5303);
                Wait(pc, 1980);

                ShowEffect(pc, 12, 3, 5303);
                Wait(pc, 990);

                ShowEffect(pc, 10, 7, 5303);
                Wait(pc, 330);

                ShowEffect(pc, 5, 6, 5303);
                Wait(pc, 330);

                ShowEffect(pc, 7, 7, 5304);

                ShowEffect(pc, 2, 5, 9605);
                Wait(pc, 5940);
            }

            x = (byte)Global.Random.Next(98, 102);
            y = (byte)Global.Random.Next(19, 23);

            Warp(pc, 50032000, x, y);

            DeleteMapInstance(pc.CInt["Beginner_Map"]);
        }
    }
    //原始地圖:阿高普路斯市市走道(50031000)
    //目標地圖:奧克魯尼亞大陸廢墟(50032000)
    //目標坐標:(98,19) ~ (102,23)

    public class P10000119 : RandomPortal
    {
        public P10000119()
        {
            Init(10000119, 20081000, 12, 21, 12, 21);
        }
    }
    //原始地圖:
    //目標地圖:空中之咖啡室(20081000)
    //目標坐標:(12,21) ~ (12,21)   

    public class P10000169 : RandomPortal
    {
        public P10000169()
        {
            Init(10000169, 30900000, 20, 20, 21, 21);
        }
    }
    //原始地圖:
    //目標地圖:(30900000)
    //目標坐標:(20,20) ~ (21,21)

    public class P10000200 : RandomPortal
    {
        public P10000200()
        {
            Init(10000200, 20013000, 62, 67, 65, 69);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:永恆深淵聳立的門(20013000)
    //目標坐標:(62,67) ~ (65,69)

    public class P10000201 : RandomPortal
    {
        public P10000201()
        {
            Init(10000201, 10023000, 130, 139, 133, 140);
        }
    }
    //原始地圖:永恆深淵聳立的門(20013000)
    //目標地圖:上城(10023000)
    //目標坐標:(130,139) ~ (133,140)

    public class P10000202 : RandomPortal
    {
        public P10000202()
        {
            Init(10000202, 10001000, 90, 1, 93, 3);
        }
    }
    //原始地圖:
    //目標地圖:北方海角(10001000)
    //目標坐標:(90,1) ~ (93,3)

    public class P10000203 : RandomPortal
    {
        public P10000203()
        {
            Init(10000203, 10020000, 252, 158, 254, 161);
        }
    }
    //原始地圖:
    //目標地圖:殺人蜂山路(10020000)
    //目標坐標:(252,158) ~ (254,161)

   

   

    public class P10000244 : RandomPortal
    {
        public P10000244()
        {
            Init(10000244, 10030001, 235, 132, 236, 133);
        }
    }
    //原始地圖:
    //目標地圖:迷宮之林(10030001)
    //目標坐標:(235,132) ~ (236,133)

    public class P10000245 : RandomPortal
    {
        public P10000245()
        {
            Init(10000245, 30201002, 7, 10, 7, 10);
        }
    }
    //原始地圖:
    //目標地圖:寵物廣場(30201002)
    //目標坐標:(7,10) ~ (7,10)

    public class P10000246 : RandomPortal
    {
        public P10000246()
        {
            Init(10000246, 10030001, 237, 99, 239, 99);
        }
    }
    //原始地圖:
    //目標地圖:迷宮之林(10030001)
    //目標坐標:(237,99) ~ (239,99)

    public class P10000282 : RandomPortal
    {
        public P10000282()
        {
            Init(10000282, 10042000, 217, 1, 220, 3);
        }
    }
    //原始地圖:果樹森林(10030000)
    //目標地圖:步伐沙漠(10042000)
    //目標坐標:(217,1) ~ (220,3)

   

    public class P10000289 : RandomPortal
    {
        public P10000289()
        {
            Init(10000289, 10032000, 252, 223, 254, 226);
        }
    }
    //原始地圖:奧克魯尼亞東海岸(10034000)
    //目標地圖:樂天娜湖泊(10032000)
    //目標坐標:(252,223) ~ (254,226)

    

    public class P10000300 : RandomPortal
    {
        public P10000300()
        {
            Init(10000300, 30800000, 1, 2, 1, 2);
        }
    }
    //原始地圖:
    //目標地圖:(30800000)
    //目標坐標:(1,2) ~ (1,2)


    public class P10000306 : RandomPortal
    {
        public P10000306()
        {
            Init(10000306, 30204003, 15, 3, 15, 3);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:有風之肉的地方(30204003)
    //目標坐標:(15,3) ~ (15,3)

    public class P10000307 : RandomPortal
    {
        public P10000307()
        {
            Init(10000307, 10023000, 126, 149, 128, 151);
        }
    }
    //原始地圖:有風之肉的地方(30204003)
    //目標地圖:上城(10023000)
    //目標坐標:(126,149) ~ (128,151)

    public class P10000308 : RandomPortal
    {
        public P10000308()
        {
            Init(10000308, 11053000, 217, 19, 218, 20);
        }
    }
    //原始地圖:海底洞窟(21180000)
    //目標地圖:飄流水鄉(11053000)
    //目標坐標:(217,19) ~ (218,20)

    public class P10000309 : Event
    {
        public P10000309()
        {
            this.EventID = 10000309;
            //Init(10000309, 21180000, 52, 253, 83, 254);
        }

        public override void OnEvent(ActorPC pc)
        {
            if (DateTime.Now.Hour % 2 == 0)
            {
                Say(pc, 131, "现在是暖流$R;");
                Warp(pc, 21180000, 68, 253);
            }
            else
            {
                Say(pc, 131, "现在是寒流$R;");
                Warp(pc, 21180001, 68, 253);
            }
        }
    }
    //原始地圖:飄流水鄉(11053000)
    //目標地圖:海底洞窟(21180000)
    //目標坐標:(52,253) ~ (83,254)

    public class P10000313 : RandomPortal
    {
        public P10000313()
        {
            Init(10000313, 70000000, 5, 10, 5, 10);
        }
    }
    //原始地圖:
    //目標地圖:飛空庭(70000000)
    //目標坐標:(5,10) ~ (5,10)

    public class P10000315 : Event
    {
        public P10000315()
        {
            this.EventID = 10000315;
        }

        public override void OnEvent(ActorPC pc)
        {
            EnterFGRoom(pc);
        }
    }
    //原始地圖:飛空庭(70000000)
    //目標地圖:家之中(75000000)
    //目標坐標:(4,10) ~ (4,10)

    public class P10000316 : RandomPortal
    {
        public P10000316()
        {
            this.EventID = 10000316;
        }

        public override void OnEvent(ActorPC pc)
        {
            ExitFGRoom(pc);
        }
    }
    //原始地圖:家之中(75000000)
    //目標地圖:飛空庭(70000000)
    //目標坐標:(5,8) ~ (5,8)

    public class P10000320 : RandomPortal
    {
        public P10000320()
        {
            Init(10000320, 20000001, 62, 22, 65, 24);
        }
    }
    //原始地圖:
    //目標地圖:大陸之洞窟B1F(20000001)
    //目標坐標:(62,22) ~ (65,24)



    public class P10000325 : RandomPortal
    {
        public P10000325()
        {
            Init(10000325, 20010001, 62, 11, 65, 13);
        }
    }
    //原始地圖:
    //目標地圖:冰結的坑道B1F(20010001)
    //目標坐標:(62,11) ~ (65,13)

    public class P10000343 : RandomPortal
    {
        public P10000343()
        {
            Init(10000343, 20013001, 62, 67, 65, 69);
        }
    }
    //原始地圖:
    //目標地圖:永恆深淵聳立的門(20013001)
    //目標坐標:(62,67) ~ (65,69)

    

    public class P10000351 : RandomPortal
    {
        public P10000351()
        {
            Init(10000351, 20013002, 62, 67, 65, 69);
        }
    }
    //原始地圖:諾頓宮殿宴會廳(30160000)
    //目標地圖:寶物庫(20013002)
    //目標坐標:(62,67) ~ (65,69)

    public class P10000357 : RandomPortal
    {
        public P10000357()
        {
            Init(10000357, 20000002, 62, 22, 65, 24);
        }
    }
    //原始地圖:
    //目標地圖:大陸之洞窟B1F(20000002)
    //目標坐標:(62,22) ~ (65,24)

    public class P10000358 : RandomPortal
    {
        public P10000358()
        {
            Init(10000358, 20002002, 20, 62, 22, 65);
        }
    }
    //原始地圖:
    //目標地圖:(20002002)
    //目標坐標:(20,62) ~ (22,65)

    public class P10000359 : RandomPortal
    {
        public P10000359()
        {
            Init(10000359, 20030002, 62, 10, 65, 12);
        }
    }
    //原始地圖:
    //目標地圖:廢炭礦B1F(20030002)
    //目標坐標:(62,10) ~ (65,12)

    public class P10000360 : RandomPortal
    {
        public P10000360()
        {
            Init(10000360, 10001001, 125, 125, 130, 130);
        }
    }
    //原始地圖:
    //目標地圖:北方海角(10001001)
    //目標坐標:(125,125) ~ (130,130)

    public class P10000361 : RandomPortal
    {
        public P10000361()
        {
            Init(10000361, 10014001, 121, 125, 126, 130);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞北部平原(10014001)
    //目標坐標:(121,125) ~ (126,130)

    public class P10000364 : RandomPortal
    {
        public P10000364()
        {
            Init(10000364, 30020000, 3, 5, 3, 5);
        }
    }
    //原始地圖:上城(10023000)
    //目標地圖:裁縫阿姨的家(30020000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000365 : RandomPortal
    {
        public P10000365()
        {
            Init(10000365, 10023000, 84, 98, 87, 99);
        }
    }
    //原始地圖:裁縫阿姨的家(30020000)
    //目標地圖:上城(10023000)
    //目標坐標:(84,98) ~ (87,99)


    public class P10000370 : RandomPortal
    {
        public P10000370()
        {
            Init(10000370, 30013000, 3, 5, 3, 5);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:武器製造所(30013000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000371 : RandomPortal
    {
        public P10000371()
        {
            Init(10000371, 10024000, 120, 207, 121, 208);
        }
    }
    //原始地圖:武器製造所(30013000)
    //目標地圖:下城(10024000)
    //目標坐標:(120,207) ~ (121,208)

    public class P10000400 : RandomPortal
    {
        public P10000400()
        {
            Init(10000400, 40000000, 2, 5, 2, 5);
        }
    }
    //原始地圖:
    //目標地圖:帳篷(40000000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10000401 : RandomPortal
    {
        public P10000401()
        {
            Init(10000401, 20013003, 62, 67, 65, 69);
        }
    }
    //原始地圖:帳篷(40000000)
    //目標地圖:奧克魯尼亞東部平原(20013003)
    //目標坐標:(62,67) ~ (65,69)

    public class P10000404 : RandomPortal
    {
        public P10000404()
        {
            Init(10000404, 10023100, 245, 122, 253, 133);
        }
    }
    //原始地圖:
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(245,122) ~ (253,133)

    public class P10000405 : RandomPortal
    {
        public P10000405()
        {
            Init(10000405, 10023200, 2, 122, 10, 133);
        }
    }
    //原始地圖:
    //目標地圖:上城西邊吊橋(10023200)
    //目標坐標:(2,122) ~ (10,133)

    public class P10000406 : RandomPortal
    {
        public P10000406()
        {
            Init(10000406, 10023300, 122, 245, 133, 253);
        }
    }
    //原始地圖:
    //目標地圖:上城南邊吊橋(10023300)
    //目標坐標:(122,245) ~ (133,253)

    public class P10000407 : RandomPortal
    {
        public P10000407()
        {
            Init(10000407, 10023400, 122, 2, 133, 10);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(122,2) ~ (133,10)

    public class P10000408 : RandomPortal
    {
        public P10000408()
        {
            Init(10000408, 10001000, 96, 21, 101, 27);
        }
    }
    //原始地圖:
    //目標地圖:北方海角(10001000)
    //目標坐標:(96,21) ~ (101,27)

    public class P10000409 : RandomPortal
    {
        public P10000409()
        {
            Init(10000409, 10018100, 225, 86, 231, 93);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018100)
    //目標坐標:(225,86) ~ (231,93)

    public class P10000410 : RandomPortal
    {
        public P10000410()
        {
            Init(10000410, 10020000, 103, 73, 113, 77);
        }
    }
    //原始地圖:
    //目標地圖:殺人蜂山路(10020000)
    //目標坐標:(103,73) ~ (113,77)

    public class P10000411 : RandomPortal
    {
        public P10000411()
        {
            Init(10000411, 10034000, 38, 111, 41, 118);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞東海岸(10034000)
    //目標坐標:(38,111) ~ (41,118)

    public class P10000412 : RandomPortal
    {
        public P10000412()
        {
            Init(10000412, 10035000, 54, 175, 65, 185);
        }
    }
    //原始地圖:
    //目標地圖:軍艦島(10035000)
    //目標坐標:(54,175) ~ (65,185)

    public class P10000413 : RandomPortal
    {
        public P10000413()
        {
            Init(10000413, 10046000, 150, 221, 157, 229);
        }
    }
    //原始地圖:
    //目標地圖:南方海角(10046000)
    //目標坐標:(150,221) ~ (157,229)

    public class P10000414 : RandomPortal
    {
        public P10000414()
        {
            Init(10000414, 10002000, 33, 220, 41, 228);
        }
    }
    //原始地圖:
    //目標地圖:瑞路斯雪原(10002000)
    //目標坐標:(33,220) ~ (41,228)

    public class P10000415 : RandomPortal
    {
        public P10000415()
        {
            Init(10000415, 10032000, 136, 111, 143, 116);
        }
    }
    //原始地圖:
    //目標地圖:樂天娜湖泊(10032000)
    //目標坐標:(136,111) ~ (143,116)

    public class P10000416 : RandomPortal
    {
        public P10000416()
        {
            Init(10000416, 10065000, 41, 123, 45, 126);
        }
    }
    //原始地圖:
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(41,123) ~ (45,126)

    public class P10000417 : RandomPortal
    {
        public P10000417()
        {
            Init(10000417, 10050000, 225, 117, 232, 124);
        }
    }
    //原始地圖:
    //目標地圖:北方中央山脈(10050000)
    //目標坐標:(225,117) ~ (232,124)

    public class P10000418 : RandomPortal
    {
        public P10000418()
        {
            Init(10000418, 10061000, 139, 45, 148, 49);
        }
    }
    //原始地圖:
    //目標地圖:鬼之寢岩(10061000)
    //目標坐標:(139,45) ~ (148,49)

    public class P10000419 : RandomPortal
    {
        public P10000419()
        {
            Init(10000419, 10063100, 122, 146, 127, 153);
        }
    }
    //原始地圖:
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(122,146) ~ (127,153)

    public class P10000420 : RandomPortal
    {
        public P10000420()
        {
            Init(10000420, 10024000, 201, 119, 207, 122);
        }
    }
    //原始地圖:
    //目標地圖:下城(10024000)
    //目標坐標:(201,119) ~ (207,122)

    public class P10000421 : RandomPortal
    {
        public P10000421()
        {
            Init(10000421, 10054000, 185, 135, 192, 139);
        }
    }
    //原始地圖:
    //目標地圖:謎之團要塞(10054000)
    //目標坐標:(185,135) ~ (192,139)

    public class P10000422 : RandomPortal
    {
        public P10000422()
        {
            Init(10000422, 10057000, 7, 120, 17, 126);
        }
    }
    //原始地圖:
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(7,120) ~ (17,126)

    public class P10000423 : RandomPortal
    {
        public P10000423()
        {
            Init(10000423, 10060000, 162, 142, 166, 151);
        }
    }
    //原始地圖:
    //目標地圖:摩根市(10060000)
    //目標坐標:(162,142) ~ (166,151)

    public class P10000424 : RandomPortal
    {
        public P10000424()
        {
            Init(10000424, 10018001, 133, 67, 135, 69);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018001)
    //目標坐標:(133,67) ~ (135,69)

    public class P10000425 : Event
    {
        public P10000425()
        {
            this.EventID = 10000425;
        }

        public override void OnEvent(ActorPC pc)
        {
            byte x, y;

            switch (Select(pc, "結束個人指導嗎?", "", "結束後去阿高普路斯市", "不結束"))
            {
                case 1:
                    x = (byte)Global.Random.Next(252, 253);
                    y = (byte)Global.Random.Next(126, 129);

                    Warp(pc, 10023100, x, y);
                    break;

                case 2:
                    break;
            }
        }
    }
    //原始地圖:奧克魯尼亞東部平原(10025001)
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(252,126) ~ (253,129)

    public class P10000426 : RandomPortal
    {
        public P10000426()
        {
            Init(10000426, 10014002, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014002)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000427 : RandomPortal
    {
        public P10000427()
        {
            Init(10000427, 10014002, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014002)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000428 : RandomPortal
    {
        public P10000428()
        {
            Init(10000428, 10062000, 81, 201, 89, 206);
        }
    }
    //原始地圖:
    //目標地圖:唐卡島(10062000)
    //目標坐標:(81,201) ~ (89,206)

    public class P10000429 : RandomPortal
    {
        public P10000429()
        {
            Init(10000429, 30200001, 0, 1, 4, 2);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:朝聖者的住宿設施(30200001)
    //目標坐標:(0,1) ~ (4,2)

    public class P10000430 : RandomPortal
    {
        public P10000430()
        {
            Init(10000430, 10018100, 194, 64, 196, 67);
        }
    }
    //原始地圖:東方海角(10018000)
    //目標地圖:東方海角(10018100)
    //目標坐標:(194,64) ~ (196,67)

   

    public class P10000440 : RandomPortal
    {
        public P10000440()
        {
            Init(10000440, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)

    public class P10000441 : RandomPortal
    {
        public P10000441()
        {
            Init(10000441, 10014012, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014012)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000442 : RandomPortal
    {
        public P10000442()
        {
            Init(10000442, 10014012, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014012)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000443 : RandomPortal
    {
        public P10000443()
        {
            Init(10000443, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)

    public class P10000444 : RandomPortal
    {
        public P10000444()
        {
            Init(10000444, 10014022, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014022)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000445 : RandomPortal
    {
        public P10000445()
        {
            Init(10000445, 10014022, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014022)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000446 : RandomPortal
    {
        public P10000446()
        {
            Init(10000446, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)

    public class P10000447 : RandomPortal
    {
        public P10000447()
        {
            Init(10000447, 10014032, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014032)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000448 : RandomPortal
    {
        public P10000448()
        {
            Init(10000448, 10014032, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014032)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000449 : RandomPortal
    {
        public P10000449()
        {
            Init(10000449, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)

    public class P10000450 : RandomPortal
    {
        public P10000450()
        {
            Init(10000450, 10014042, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014042)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000451 : RandomPortal
    {
        public P10000451()
        {
            Init(10000451, 10014042, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014042)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000452 : RandomPortal
    {
        public P10000452()
        {
            Init(10000452, 10023400, 126, 2, 129, 3);
        }
    }
    //原始地圖:
    //目標地圖:上城北邊吊橋(10023400)
    //目標坐標:(126,2) ~ (129,3)

    public class P10000453 : RandomPortal
    {
        public P10000453()
        {
            Init(10000453, 10014052, 78, 4, 81, 6);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014052)
    //目標坐標:(78,4) ~ (81,6)

    public class P10000454 : RandomPortal
    {
        public P10000454()
        {
            Init(10000454, 10014052, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014052)
    //目標坐標:(126,197) ~ (129,199)

    public class P10000455 : RandomPortal
    {
        public P10000455()
        {
            Init(10000455, 30140001, 9, 14, 13, 19);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞傳送室(30140001)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000456 : RandomPortal
    {
        public P10000456()
        {
            Init(10000456, 30140002, 9, 14, 13, 19);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞傳送室(30140002)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000457 : RandomPortal
    {
        public P10000457()
        {
            Init(10000457, 30141001, 9, 14, 13, 19);
        }
    }
    //原始地圖:
    //目標地圖:道米尼傳送室(30141001)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000458 : RandomPortal
    {
        public P10000458()
        {
            Init(10000458, 30141002, 9, 14, 13, 19);
        }
    }
    //原始地圖:
    //目標地圖:道米尼傳送室(30141002)
    //目標坐標:(9,14) ~ (13,19)

    public class P10000459 : RandomPortal
    {
        public P10000459()
        {
            Init(10000459, 20080001, 24, 24, 26, 26);
        }
    }
    //原始地圖:
    //目標地圖:營運者調查室(20080001)
    //目標坐標:(24,24) ~ (26,26)

    public class P10000460 : RandomPortal
    {
        public P10000460()
        {
            Init(10000460, 20080002, 24, 24, 26, 26);
        }
    }
    //原始地圖:
    //目標地圖:營運者調查室(20080002)
    //目標坐標:(24,24) ~ (26,26)

    public class P10000461 : RandomPortal
    {
        public P10000461()
        {
            Init(10000461, 20080003, 24, 24, 26, 26);
        }
    }
    //原始地圖:
    //目標地圖:營運者調查室(20080003)
    //目標坐標:(24,24) ~ (26,26)

    public class P10000462 : RandomPortal
    {
        public P10000462()
        {
            Init(10000462, 20080004, 24, 24, 26, 26);
        }
    }
    //原始地圖:
    //目標地圖:營運者調查室(20080004)
    //目標坐標:(24,24) ~ (26,26)

    public class P10000463 : RandomPortal
    {
        public P10000463()
        {
            Init(10000463, 20080005, 24, 24, 26, 26);
        }
    }
    //原始地圖:
    //目標地圖:營運者調查室(20080005)
    //目標坐標:(24,24) ~ (26,26)



    public class P10000466 : RandomPortal
    {
        public P10000466()
        {
            Init(10000466, 30100001, 4, 14, 6, 15);
        }
    }
    //原始地圖:
    //目標地圖:接待室(30100001)
    //目標坐標:(4,14) ~ (6,15)

    public class P10000467 : RandomPortal
    {
        public P10000467()
        {
            Init(10000467, 20080000, 23, 10, 27, 10);
        }
    }
    //原始地圖:
    //目標地圖:鬥技場(20080000)
    //目標坐標:(23,10) ~ (27,10)

    public class P10000495 : RandomPortal
    {
        public P10000495()
        {
            Init(10000495, 10024000, 134, 47, 135, 50);
        }
    }
    //原始地圖:鬥技場(20080000)
    //目標地圖:下城(10024000)
    //目標坐標:(134,47) ~ (135,50)

    public class P10000498 : RandomPortal
    {
        public P10000498()
        {
            Init(10000498, 20080016, 25, 43, 25, 43);
        }
    }
    //原始地圖:奧克魯尼亞東部平原(20013003)
    //目標地圖:訓練所1F(20080016)
    //目標坐標:(25,43) ~ (25,43)

    public class P10000499 : RandomPortal
    {
        public P10000499()
        {
            Init(10000499, 20013003, 63, 58, 64, 58);
        }
    }
    //原始地圖:訓練所1F(20080016)
    //目標地圖:奧克魯尼亞東部平原(20013003)
    //目標坐標:(63,58) ~ (64,58)

   

    public class P10000599 : RandomPortal
    {
        public P10000599()
        {
            Init(10000599, 20070000, 22, 83, 25, 85);
        }
    }
    //原始地圖:
    //目標地圖:無限回廊B1F(20070000)
    //目標坐標:(22,83) ~ (25,85)

    

    

   

    public class P10000648 : RandomPortal
    {
        public P10000648()
        {
            Init(10000648, 30030001, 1, 1, 3, 2);
        }
    }
    //原始地圖:
    //目標地圖:道具的小部屋(30030001)
    //目標坐標:(1,1) ~ (3,2)

    public class P10000649 : RandomPortal
    {
        public P10000649()
        {
            Init(10000649, 20012002, 113, 64, 114, 67);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20012002)
    //目標坐標:(113,64) ~ (114,67)

    public class P10000650 : RandomPortal
    {
        public P10000650()
        {
            Init(10000650, 20012002, 56, 64, 58, 67);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20012002)
    //目標坐標:(56,64) ~ (58,67)

    public class P10000651 : RandomPortal
    {
        public P10000651()
        {
            Init(10000651, 20012002, 79, 64, 80, 67);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20012002)
    //目標坐標:(79,64) ~ (80,67)

    public class P10000652 : RandomPortal
    {
        public P10000652()
        {
            Init(10000652, 30030002, 1, 1, 3, 2);
        }
    }
    //原始地圖:
    //目標地圖:活動木偶的小屋(30030002)
    //目標坐標:(1,1) ~ (3,2)

    public class P10000653 : RandomPortal
    {
        public P10000653()
        {
            Init(10000653, 20002003, 70, 69, 73, 70);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20002003)
    //目標坐標:(70,69) ~ (73,70)

    public class P10000654 : RandomPortal
    {
        public P10000654()
        {
            Init(10000654, 20002003, 97, 31, 99, 33);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20002003)
    //目標坐標:(97,31) ~ (99,33)

    public class P10000655 : RandomPortal
    {
        public P10000655()
        {
            Init(10000655, 20002003, 97, 48, 98, 49);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20002003)
    //目標坐標:(97,48) ~ (98,49)

    public class P10000656 : RandomPortal
    {
        public P10000656()
        {
            Init(10000656, 20080006, 14, 14, 36, 36);
        }
    }
    //原始地圖:
    //目標地圖:訓練所1F(20080006)
    //目標坐標:(14,14) ~ (36,36)

    public class P10000657 : RandomPortal
    {
        public P10000657()
        {
            Init(10000657, 20002003, 21, 63, 23, 65);
        }
    }
    //原始地圖:
    //目標地圖:TGS活動用地牢(20002003)
    //目標坐標:(21,63) ~ (23,65)

    public class P10000658 : RandomPortal
    {
        public P10000658()
        {
            Init(10000658, 20080000, 25, 43, 25, 43);
        }
    }
    //原始地圖:
    //目標地圖:鬥技場(20080000)
    //目標坐標:(25,43) ~ (25,43)

    public class P10000659 : RandomPortal
    {
        public P10000659()
        {
            Init(10000659, 20080000, 25, 7, 25, 7);
        }
    }
    //原始地圖:
    //目標地圖:鬥技場(20080000)
    //目標坐標:(25,7) ~ (25,7)

    public class P10000660 : RandomPortal
    {
        public P10000660()
        {
            Init(10000660, 50000000, 3, 3, 3, 3);
        }
    }
    //原始地圖:
    //目標地圖:總部的房間(50000000)
    //目標坐標:(3,3) ~ (3,3)

    public class P10000661 : RandomPortal
    {
        public P10000661()
        {
            Init(10000661, 10067000, 36, 31, 38, 33);
        }
    }
    //原始地圖:
    //目標地圖:女王謁見之間(10067000)
    //目標坐標:(36,31) ~ (38,33)

    public class P10000662 : RandomPortal
    {
        public P10000662()
        {
            Init(10000662, 30160000, 20, 20, 20, 20);
        }
    }
    //原始地圖:寶物庫(20013002)
    //目標地圖:諾頓宮殿宴會廳(30160000)
    //目標坐標:(20,20) ~ (20,20)

    public class P10000663 : RandomPortal
    {
        public P10000663()
        {
            Init(10000663, 20013002, 63, 60, 64, 60);
        }
    }
    //原始地圖:諾頓宮殿宴會廳(30160000)
    //目標地圖:寶物庫(20013002)
    //目標坐標:(63,60) ~ (64,60)


    public class P10000752 : RandomPortal
    {
        public P10000752()
        {
            Init(10000752, 20080007, 21, 21, 29, 29);
        }
    }
    //原始地圖:
    //目標地圖:東軍團大廳(20080007)
    //目標坐標:(21,21) ~ (29,29)

    public class P10000753 : RandomPortal
    {
        public P10000753()
        {
            Init(10000753, 20080008, 21, 21, 29, 29);
        }
    }
    //原始地圖:
    //目標地圖:西軍團大廳(20080008)
    //目標坐標:(21,21) ~ (29,29)

    public class P10000754 : RandomPortal
    {
        public P10000754()
        {
            Init(10000754, 20080009, 21, 21, 29, 29);
        }
    }
    //原始地圖:
    //目標地圖:南軍團大廳(20080009)
    //目標坐標:(21,21) ~ (29,29)

    public class P10000755 : RandomPortal
    {
        public P10000755()
        {
            Init(10000755, 20080010, 21, 21, 29, 29);
        }
    }
    //原始地圖:
    //目標地圖:北軍團大廳(20080010)
    //目標坐標:(21,21) ~ (29,29)

    public class P10000756 : RandomPortal
    {
        public P10000756()
        {
            Init(10000756, 20080011, 21, 21, 29, 29);
        }
    }
    //原始地圖:
    //目標地圖:鬥技場2(20080011)
    //目標坐標:(21,21) ~ (29,29)

    public class P10000757 : RandomPortal
    {
        public P10000757()
        {
            Init(10000757, 10023001, 217, 126, 218, 129);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:上城練習場(10023001)
    //目標坐標:(217,126) ~ (218,129)

    public class P10000758 : RandomPortal
    {
        public P10000758()
        {
            Init(10000758, 10023001, 37, 126, 38, 129);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:上城練習場(10023001)
    //目標坐標:(37,126) ~ (38,129)

    public class P10000759 : RandomPortal
    {
        public P10000759()
        {
            Init(10000759, 10023001, 126, 218, 129, 219);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:上城練習場(10023001)
    //目標坐標:(126,218) ~ (129,219)

    public class P10000760 : RandomPortal
    {
        public P10000760()
        {
            Init(10000760, 10023001, 126, 37, 129, 38);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:上城練習場(10023001)
    //目標坐標:(126,37) ~ (129,38)

    

    

   

    public class P10000780 : RandomPortal
    {
        public P10000780()
        {
            Init(10000780, 20022000, 104, 30, 104, 30);
        }
    }
    //原始地圖:
    //目標地圖:南部地牢B3F(20022000)
    //目標坐標:(104,30) ~ (104,30)


    public class P10000782 : RandomPortal
    {
        public P10000782()
        {
            Init(10000782, 30020004, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:民家(30020004)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000783 : RandomPortal
    {
        public P10000783()
        {
            Init(10000783, 30010005, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:諾頓咖啡館(30010005)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000784 : RandomPortal
    {
        public P10000784()
        {
            Init(10000784, 30077001, 8, 12, 8, 12);
        }
    }
    //原始地圖:
    //目標地圖:動力制御室(30077001)
    //目標坐標:(8,12) ~ (8,12)

    public class P10000785 : RandomPortal
    {
        public P10000785()
        {
            Init(10000785, 30170001, 3, 6, 3, 6);
        }
    }
    //原始地圖:
    //目標地圖:伊戈路(30170001)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000786 : RandomPortal
    {
        public P10000786()
        {
            Init(10000786, 30140003, 11, 15, 12, 16);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞傳送室(30140003)
    //目標坐標:(11,15) ~ (12,16)

    

    public class P10000793 : RandomPortal
    {
        public P10000793()
        {
            Init(10000793, 10065000, 46, 114, 57, 123);
        }
    }
    //原始地圖:
    //目標地圖:諾頓海濱長廊(10065000)
    //目標坐標:(46,114) ~ (57,123)

    public class P10000794 : RandomPortal
    {
        public P10000794()
        {
            Init(10000794, 10062000, 195, 125, 196, 126);
        }
    }
    //原始地圖:
    //目標地圖:唐卡島(10062000)
    //目標坐標:(195,125) ~ (196,126)

    public class P10000795 : RandomPortal
    {
        public P10000795()
        {
            Init(10000795, 10069000, 125, 125, 125, 125);
        }
    }
    //原始地圖:
    //目標地圖:不死皇城(10069000)
    //目標坐標:(125,125) ~ (125,125)
   


    
    
    public class P10000982 : RandomPortal
    {
        public P10000982()
        {
            Init(10000982, 20092001, 168, 32, 171, 34);
        }
    }
    //原始地圖:毒濕地(20091001)
    //目標地圖:冥王之森(20092001)
    //目標坐標:(168,32) ~ (171,34)

    public class P10000983 : RandomPortal
    {
        public P10000983()
        {
            Init(10000983, 50001000, 7, 26, 9, 27);
        }
    }
    //原始地圖:皇宮1F(20108000)
    //目標地圖:阿卡茲的房間(50001000)
    //目標坐標:(7,26) ~ (9,27)

    public class P10000985 : RandomPortal
    {
        public P10000985()
        {
            Init(10000985, 10023000, 126, 149, 128, 151);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(126,149) ~ (128,151)

    public class P10000986 : RandomPortal
    {
        public P10000986()
        {
            Init(10000986, 10900000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 1(10900000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000987 : RandomPortal
    {
        public P10000987()
        {
            Init(10000987, 10901000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 2(10901000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000988 : RandomPortal
    {
        public P10000988()
        {
            Init(10000988, 10902000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 3(10902000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000989 : RandomPortal
    {
        public P10000989()
        {
            Init(10000989, 10903000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 4(10903000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000990 : RandomPortal
    {
        public P10000990()
        {
            Init(10000990, 10904000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 5(10904000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000991 : RandomPortal
    {
        public P10000991()
        {
            Init(10000991, 10905000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 6(10905000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000992 : RandomPortal
    {
        public P10000992()
        {
            Init(10000992, 20900000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 7(20900000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000993 : RandomPortal
    {
        public P10000993()
        {
            Init(10000993, 20901000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 8(20901000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000994 : RandomPortal
    {
        public P10000994()
        {
            Init(10000994, 20902000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 9(20902000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000995 : RandomPortal
    {
        public P10000995()
        {
            Init(10000995, 20903000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 10(20903000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000996 : RandomPortal
    {
        public P10000996()
        {
            Init(10000996, 20904000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 11(20904000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000997 : RandomPortal
    {
        public P10000997()
        {
            Init(10000997, 20905000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:取消視點鎖定地圖 12(20905000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000998 : RandomPortal
    {
        public P10000998()
        {
            Init(10000998, 20906000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:測試地圖(20906000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10000999 : RandomPortal
    {
        public P10000999()
        {
            Init(10000999, 20907000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:測試地圖(20907000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001000 : RandomPortal
    {
        public P10001000()
        {
            Init(10001000, 10068000, 194, 214, 205, 216);
        }
    }
    //原始地圖:
    //目標地圖:榖倉地帶(10068000)
    //目標坐標:(194,214) ~ (205,216)

    public class P10001001 : RandomPortal
    {
        public P10001001()
        {
            Init(10001001, 10032001, 219, 61, 221, 63);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:樂天娜湖泊練習場(10032001)
    //目標坐標:(219,61) ~ (221,63)

    public class P10001002 : RandomPortal
    {
        public P10001002()
        {
            Init(10001002, 10032001, 2, 200, 4, 202);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:樂天娜湖泊練習場(10032001)
    //目標坐標:(2,200) ~ (4,202)

    public class P10001003 : RandomPortal
    {
        public P10001003()
        {
            Init(10001003, 10032001, 131, 209, 133, 211);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:樂天娜湖泊練習場(10032001)
    //目標坐標:(131,209) ~ (133,211)

    public class P10001004 : RandomPortal
    {
        public P10001004()
        {
            Init(10001004, 10032001, 45, 80, 47, 82);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:樂天娜湖泊練習場(10032001)
    //目標坐標:(45,80) ~ (47,82)

    public class P10001005 : RandomPortal
    {
        public P10001005()
        {
            Init(10001005, 10034001, 208, 235, 210, 237);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:奧克魯尼亞東海岸練習場(10034001)
    //目標坐標:(208,235) ~ (210,237)

    public class P10001006 : RandomPortal
    {
        public P10001006()
        {
            Init(10001006, 10034001, 84, 87, 86, 89);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:奧克魯尼亞東海岸練習場(10034001)
    //目標坐標:(84,87) ~ (86,89)

    public class P10001007 : RandomPortal
    {
        public P10001007()
        {
            Init(10001007, 10034001, 49, 192, 51, 194);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:奧克魯尼亞東海岸練習場(10034001)
    //目標坐標:(49,192) ~ (51,194)

    public class P10001008 : RandomPortal
    {
        public P10001008()
        {
            Init(10001008, 10034001, 214, 16, 216, 18);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:奧克魯尼亞東海岸練習場(10034001)
    //目標坐標:(214,16) ~ (216,18)

    public class P10001009 : RandomPortal
    {
        public P10001009()
        {
            Init(10001009, 10042001, 233, 33, 235, 35);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:步伐沙漠練習場(10042001)
    //目標坐標:(233,33) ~ (235,35)

    public class P10001010 : RandomPortal
    {
        public P10001010()
        {
            Init(10001010, 10042001, 72, 141, 74, 143);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:步伐沙漠練習場(10042001)
    //目標坐標:(72,141) ~ (74,143)

    public class P10001011 : RandomPortal
    {
        public P10001011()
        {
            Init(10001011, 10042001, 54, 239, 56, 241);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:步伐沙漠練習場(10042001)
    //目標坐標:(54,239) ~ (56,241)

    public class P10001012 : RandomPortal
    {
        public P10001012()
        {
            Init(10001012, 10042001, 41, 37, 43, 39);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:步伐沙漠練習場(10042001)
    //目標坐標:(41,37) ~ (43,39)

    public class P10001013 : RandomPortal
    {
        public P10001013()
        {
            Init(10001013, 10064001, 230, 27, 232, 29);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:鐵火山練習場(10064001)
    //目標坐標:(230,27) ~ (232,29)

    public class P10001014 : RandomPortal
    {
        public P10001014()
        {
            Init(10001014, 10064001, 60, 208, 62, 210);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:鐵火山練習場(10064001)
    //目標坐標:(60,208) ~ (62,210)

    public class P10001015 : RandomPortal
    {
        public P10001015()
        {
            Init(10001015, 10064001, 161, 110, 163, 112);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:鐵火山練習場(10064001)
    //目標坐標:(161,110) ~ (163,112)

    public class P10001016 : RandomPortal
    {
        public P10001016()
        {
            Init(10001016, 10064001, 16, 16, 18, 18);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:鐵火山練習場(10064001)
    //目標坐標:(16,16) ~ (18,18)

    public class P10001017 : RandomPortal
    {
        public P10001017()
        {
            Init(10001017, 20020001, 245, 136, 247, 138);
        }
    }
    //原始地圖:東軍團大廳(20080007)
    //目標地圖:南部地牢B1F練習場(20020001)
    //目標坐標:(245,136) ~ (247,138)

    public class P10001018 : RandomPortal
    {
        public P10001018()
        {
            Init(10001018, 20020001, 15, 119, 17, 121);
        }
    }
    //原始地圖:西軍團大廳(20080008)
    //目標地圖:南部地牢B1F練習場(20020001)
    //目標坐標:(15,119) ~ (17,121)

    public class P10001019 : RandomPortal
    {
        public P10001019()
        {
            Init(10001019, 20020001, 127, 225, 129, 227);
        }
    }
    //原始地圖:南軍團大廳(20080009)
    //目標地圖:南部地牢B1F練習場(20020001)
    //目標坐標:(127,225) ~ (129,227)

    public class P10001020 : RandomPortal
    {
        public P10001020()
        {
            Init(10001020, 20020001, 127, 2, 129, 4);
        }
    }
    //原始地圖:北軍團大廳(20080010)
    //目標地圖:南部地牢B1F練習場(20020001)
    //目標坐標:(127,2) ~ (129,4)


    public class P10001025 : RandomPortal
    {
        public P10001025()
        {
            Init(10001025, 10071000, 64, 209, 64, 211);
        }
    }
    //原始地圖:
    //目標地圖:泰迪島(10071000)
    //目標坐標:(64,209) ~ (64,211)

   

    public class P10001028 : RandomPortal
    {
        public P10001028()
        {
            Init(10001028, 10062000, 129, 179, 129, 179);
        }
    }
    //原始地圖:
    //目標地圖:唐卡島(10062000)
    //目標坐標:(129,179) ~ (129,179)

    public class P10001030 : RandomPortal
    {
        public P10001030()
        {
            Init(10001030, 10054000, 156, 138, 157, 138);
        }
    }
    //原始地圖:
    //目標地圖:謎之團要塞(10054000)
    //目標坐標:(156,138) ~ (157,138)



  

    public class P10001070 : RandomPortal
    {
        public P10001070()
        {
            Init(10001070, 10060000, 88, 144, 90, 146);
        }
    }
    //原始地圖:
    //目標地圖:摩根市(10060000)
    //目標坐標:(88,144) ~ (90,146)

    public class P10001071 : RandomPortal
    {
        public P10001071()
        {
            Init(10001071, 10060000, 145, 141, 145, 146);
        }
    }
    //原始地圖:
    //目標地圖:摩根市(10060000)
    //目標坐標:(145,141) ~ (145,146)

    public class P10001076 : RandomPortal
    {
        public P10001076()
        {
            Init(10001076, 60001000, 24, 24, 27, 27);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(60001000)
    //目標坐標:(24,24) ~ (27,27)

    public class P10001077 : RandomPortal
    {
        public P10001077()
        {
            Init(10001077, 61004000, 83, 76, 83, 76);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(61004000)
    //目標坐標:(83,76) ~ (83,76)

    public class P10001078 : RandomPortal
    {
        public P10001078()
        {
            Init(10001078, 63006000, 40, 40, 40, 40);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(63006000)
    //目標坐標:(40,40) ~ (40,40)

    public class P10001079 : RandomPortal
    {
        public P10001079()
        {
            Init(10001079, 63007000, 27, 27, 27, 27);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(63007000)
    //目標坐標:(27,27) ~ (27,27)

    public class P10001080 : RandomPortal
    {
        public P10001080()
        {
            Init(10001080, 63008000, 19, 19, 19, 19);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(63008000)
    //目標坐標:(19,19) ~ (19,19)

    public class P10001081 : RandomPortal
    {
        public P10001081()
        {
            Init(10001081, 62002000, 47, 47, 47, 47);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(62002000)
    //目標坐標:(47,47) ~ (47,47)

    public class P10001082 : RandomPortal
    {
        public P10001082()
        {
            Init(10001082, 62003000, 56, 56, 56, 56);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(62003000)
    //目標坐標:(56,56) ~ (56,56)

    public class P10001083 : RandomPortal
    {
        public P10001083()
        {
            Init(10001083, 64008000, 8, 56, 8, 56);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(64008000)
    //目標坐標:(8,56) ~ (8,56)

    public class P10001084 : RandomPortal
    {
        public P10001084()
        {
            Init(10001084, 64009000, 24, 28, 24, 28);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(64009000)
    //目標坐標:(24,28) ~ (24,28)

    public class P10001085 : RandomPortal
    {
        public P10001085()
        {
            Init(10001085, 64010000, 31, 23, 31, 23);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(64010000)
    //目標坐標:(31,23) ~ (31,23)

    public class P10001086 : RandomPortal
    {
        public P10001086()
        {
            Init(10001086, 64011000, 37, 17, 37, 17);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(64011000)
    //目標坐標:(37,17) ~ (37,17)

    public class P10001087 : RandomPortal
    {
        public P10001087()
        {
            Init(10001087, 64012000, 43, 41, 43, 41);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依遺跡內部(64012000)
    //目標坐標:(43,41) ~ (43,41)

    public class P10001100 : RandomPortal
    {
        public P10001100()
        {
            Init(10001100, 30130000, 7, 4, 7, 4);
        }
    }
    //原始地圖:
    //目標地圖:帕斯特管理局(30130000)
    //目標坐標:(7,4) ~ (7,4)

    public class P10001103 : RandomPortal
    {
        public P10001103()
        {
            Init(10001103, 60000000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:INSD:遺跡內部(60000000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001104 : RandomPortal
    {
        public P10001104()
        {
            Init(10001104, 61000000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:INSD:遺跡內部(61000000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001105 : RandomPortal
    {
        public P10001105()
        {
            Init(10001105, 61001000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:(61001000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001106 : RandomPortal
    {
        public P10001106()
        {
            Init(10001106, 61002000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:(61002000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001107 : RandomPortal
    {
        public P10001107()
        {
            Init(10001107, 61003000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:(61003000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001108 : RandomPortal
    {
        public P10001108()
        {
            Init(10001108, 62000000, 0, 0, 0, 0);
        }
    }
    //原始地圖:
    //目標地圖:INSD:遺跡內部(62000000)
    //目標坐標:(0,0) ~ (0,0)

    public class P10001109 : RandomPortal
    {
        public P10001109()
        {
            Init(10001109, 20080012, 22, 28, 28, 41);
        }
    }
    //原始地圖:下城(10024000)
    //目標地圖:遺跡入口前廣場(20080012)
    //目標坐標:(22,28) ~ (28,41)

    public class P10001110 : RandomPortal
    {
        public P10001110()
        {
            Init(10001110, 20080013, 22, 28, 28, 41);
        }
    }
    //原始地圖:諾頓海濱長廊(10065000)
    //目標地圖:遺跡入口前廣場(20080013)
    //目標坐標:(22,28) ~ (28,41)

    public class P10001260 : RandomPortal
    {
        public P10001260()
        {
            Init(10001260, 10034002, 162, 29, 166, 33);
        }
    }
    //原始地圖:奧克魯尼亞東海岸(10034000)
    //目標地圖:東海岸寵物養殖場(10034002)
    //目標坐標:(162,29) ~ (166,33)

    public class P10001261 : RandomPortal
    {
        public P10001261()
        {
            Init(10001261, 10034000, 162, 29, 166, 33);
        }
    }
    //原始地圖:東海岸寵物養殖場(10034002)
    //目標地圖:奧克魯尼亞東海岸(10034000)
    //目標坐標:(162,29) ~ (166,33)


    public class P10001270 : RandomPortal
    {
        public P10001270()
        {
            this.EventID = 10001270;
            //Init(10001270, 10062000, 194, 58, 195, 59);
        }
        public override void OnEvent(ActorPC pc)
        {
            BitMask<TravelFGarden> TravelFGarden_mask = pc.CMask["TravelFGarden"];
            //EVT10001270
            if (pc.Skills2.ContainsKey(706) || pc.SkillsReserve.ContainsKey(706) ||
                TravelFGarden_mask.Test(TravelFGarden.已办理去唐卡手续))
            {
                switch (Select(pc, "這是往唐卡的飛空庭喔", "", "搭乘飛空庭", "暫時不用"))
                {
                    case 1:
                        TravelFGarden_mask.SetValue(TravelFGarden.已办理去唐卡手续, false);
                        //_5a83 = false;
                        PlaySound(pc, 2426, false, 100, 50);
                        Say(pc, 0, 131, "向唐卡出發$R;");
                        PlaySound(pc, 2438, false, 100, 50);
                        ShowEffect(pc, 152, 41, 8066);
                        Wait(pc, 2000);
                        Warp(pc, 10062000, 194, 58);
                        break;
                    case 2:
                        break;
                }
                return;
            }
            Say(pc, 0, 131, "現在不能往前走喔。$R;");
        }
    }
    //原始地圖:馬克特碼頭(20023000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(194,58) ~ (195,59)

    public class P10001300 : RandomPortal
    {
        public P10001300()
        {
            Init(10001300, 10025001, 22, 126, 24, 129);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞東部平原(10025001)
    //目標坐標:(22,126) ~ (24,129)

    public class P10001301 : Event
    {
        public P10001301()
        {
            this.EventID = 10001301;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            byte x, y;

            if (!Beginner_01_mask.Test(Beginner_01.已經與埃米爾進行第一次對話))
            {
                尚未與埃米爾對話(pc);
                return;
            }

            switch (Select(pc, "去下一個地方嗎?", "", "去下一個地方!", "在村子裡再轉轉"))
            {
                case 1:
                    x = (byte)Global.Random.Next(187, 189);
                    y = (byte)Global.Random.Next(64, 67);

                    Warp(pc, 10018001, x, y);
                    break;

                case 2:
                    break;
            }
        }

        void 尚未與埃米爾對話(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            int selection;

            byte x, y;

            Beginner_01_mask.SetValue(Beginner_01.已經與埃米爾進行第一次對話, true);

            Say(pc, 0, 65535, "先等等啊!$R;" +
                              "$R走之前，先聽我說好嗎?$R;", "埃米爾");

            Say(pc, 0, 65535, "您好!$R;" +
                              "是否第一次來到這裡呢?$R;" +
                              "$R我叫埃米爾，$R;" +
                              "是負責幫助來到$R;" +
                              "ECO世界的初心者們。$R;" +
                              "$P準備好了，就開始個人指導吧…$R;", "埃米爾");

            switch (Select(pc, "要進行指導嗎?", "", "進行指導", "直接返回遊戲"))
            {
                case 1:
                    Say(pc, 0, 65535, "首先，歡迎來到ECO世界!$R;" +
                                      "$R現在，您的眼前即將展開魔幻新世界。$R;" +
                                      "$P那麼開始教您一些基本操作方法吧!$R;", "埃米爾");
                    break;

                case 2:
                    Say(pc, 0, 65535, "真是的，以後再也聽不到說明喔!$R;", "埃米爾");

                    switch (Select(pc, "真的不聽說明嗎?", "", "聽完說明在走", "不聽也行!"))
                    {
                        case 1:
                            Say(pc, 0, 65535, "那就開始吧!$R;", "埃米爾");

                            Say(pc, 0, 65535, "首先，歡迎來到ECO世界!$R;" +
                                              "$R現在，您的眼前即將展開魔幻新世界。$R;" +
                                              "$P那麼開始教您一些基本操作方法吧!$R;", "埃米爾");
                            break;

                        case 2:
                            Beginner_01_mask.SetValue(Beginner_01.埃米爾給予埃米爾介紹書, true);

                            PlaySound(pc, 2040, false, 100, 50);
                            GiveItem(pc, 10043081, 1);
                            Say(pc, 0, 65535, "得到『埃米爾介紹書』!$R;", " ");

                            Say(pc, 0, 65535, "知道了，最後還有一點。$R;" +
                                              "$P到達阿高普路斯市後，$R;" +
                                              "最好去「咖啡館」或者「咖啡館分店」一趟。$R;" +
                                              "$P「咖啡館」在「阿高普路斯市」的$R;" +
                                              "「下城」東部喔!$R;" +
                                              "$R「咖啡館分店」在「阿高普路斯市」的$R;" +
                                              "東、南、西、北部平原的中央附近唷!$R;" +
                                              "$P我有給您一份介紹書，$R;" +
                                              "在道具視窗中確認一下吧?$R;" +
                                              "$P「阿高普路斯市」是一個很大的城市喔!$R;" +
                                              "迷了路可以利用「響導機械人」。$R;" +
                                              "$R「響導機械人」是個有點奇怪的機器人，$R;" +
                                              "「阿高普路斯市」裡到處都有，很容易找到的。$R;", "埃米爾");

                            Say(pc, 0, 65535, "那麼送您到「阿高普路斯市」吧!$R;", "埃米爾");

                            x = (byte)Global.Random.Next(245, 250);
                            y = (byte)Global.Random.Next(126, 131);

                            Warp(pc, 10023100, x, y);
                            return;
                    }
                    break;
            }

            selection = Select(pc, "想問關於哪方面的操作呢?", "", "說話/攻擊", "移動方法", "結束遊戲方法", "移動地圖的方法", "其他");

            while (selection != 5)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 0, 65535, "想跟村裡的人打招呼，$R;" +
                                          "或攻擊敵人的時候，$R;" +
                                          "對目標點擊滑鼠左鍵就可以囉。$R;" +
                                          "$P…看您跟我打招呼了，$R;" +
                                          "應該已經知道了吧?$R;" +
                                          "$P如果對方跟其他人重疊時，$R;" +
                                          "就請點擊滑鼠右鍵吧。$R;" +
                                          "$R將會出現重疊人名的視窗，$R;" +
                                          "在裡面可以選擇跟誰打招呼唷!$R;", "埃米爾");
                        break;

                    case 2:
                        Say(pc, 0, 65535, "移動時，在移動目標上點擊左鍵即可。$R;" +
                                          "$R如果長時間持續點擊，$R;" +
                                          "就會自動跟著滑鼠移動方向移動。$R;" +
                                          "$P人太多的時候操作困難。$R;" +
                                          "$R這時用鍵盤的方向鍵移動，$R;" +
                                          "會比較方便唷!$R;", "埃米爾");
                        break;

                    case 3:
                        Say(pc, 0, 65535, "要結束遊戲的話，$R;" +
                                          "請按鍵盤左上角ESC鍵…$R;" +
                                          "$P如果按這鍵…$R;" +
                                          "喂! 別現在點擊!$R;" +
                                          "$P然後…$R;" +
                                          "$R「返回遊戲」或「登出」$R;" +
                                          "$R兩個選項中做出選擇即可。$R;" +
                                          "$P注意一點，$R;" +
                                          "對話時結束遊戲，$R;" +
                                          "會聽不到後面的對話唷!$R;" +
                                          "$P登出需要5秒鐘的時間，$R;" +
                                          "$R這時移動或被魔物攻擊的話，$R;" +
                                          "會自動取消登出喔!$R;" +
                                          "$P在寒冷、炎熱或是在水裡等$R;" +
                                          "體質HP值漸漸減少的地方，$R;" +
                                          "是沒辦法登出的喔!$R;", "埃米爾");
                        break;

                    case 4:
                        Say(pc, 0, 65535, "想移動到下一幅地圖時，$R;" +
                                          "看到藍色光柱了嗎?$R;" +
                                          "這是「傳送點」，$R;" +
                                          "踩到它就會進入下一個地圖唷!$R;" +
                                          "$P同樣的，進入店裡時踩傳送點即可。$R;" +
                                          "$P如果沒有光柱，$R;" +
                                          "傳送點可能是隱藏的。$R;" +
                                          "$R如果覺得可能有的話，$R;" +
                                          "就踩一踩試試看，$R;" +
                                          "可能有新發現唷!$R;", "埃米爾");
                        break;
                }

                selection = Select(pc, "想問關於哪方面的操作呢?", "", "說話/攻擊", "移動方法", "結束遊戲方法", "移動地圖的方法", "其他");
            }

            if (!Beginner_01_mask.Test(Beginner_01.埃米爾給予埃米爾徽章))
            {
                埃米爾給予埃米爾徽章(pc);
                return;
            }

            Say(pc, 0, 65535, "那麼說明一下傳送點吧!$R;" +
                              "$R只要點擊那個傳送點，$R;" +
                              "就可以進入下一階段唷!$R;" +
                              "$P跟著路走就是阿高普路斯市了!$R;" +
                              "$R放心，$R;" +
                              "只要參照小地圖來走，就不會迷路啦。$R;", "埃米爾");
        }

        void 埃米爾給予埃米爾徽章(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            Beginner_01_mask.SetValue(Beginner_01.埃米爾給予埃米爾徽章, true);

            Say(pc, 0, 65535, "還有…$R;" +
                              "$R通過前面的傳送點，$R;" +
                              "就會進入下一張地圖，$R;" +
                              "沿著路走，$R;" +
                              "就會有「關卡」唷!$R;" +
                              "$R我的同伴，是道米尼男孩。$R;" +
                              "$P他會教您很多關於戰鬥的東西唷!$R;" +
                              "$R那麼，祝您好運!$R;", "埃米爾");

            Say(pc, 0, 65535, "這是歡送您的禮物!$R;", "埃米爾");

            PlaySound(pc, 2040, false, 100, 50);
            GiveItem(pc, 10009550, 1);
            Say(pc, 0, 65535, "得到『埃米爾徽章』!$R;", " ");

            Say(pc, 0, 65535, "把這個徽章放到叫「道具箱」的$R;" +
                              "粉紅色機器就可以交換到$R;" +
                              "各種有用的道具唷!$R;" +
                              "$P試試將徽章$R;" +
                              "放到我前面的「道具箱」吧!$R;", "埃米爾");

            Say(pc, 0, 65535, "對了!$R;" +
                              "$R走之前，先到村落裡走走吧!$;" +
                              "會聽到很多情報唷!$R;", "埃米爾");
        }
    }
    //原始地圖:東方海角(10018101)
    //目標地圖:東方海角(10018001)
    //目標坐標:(187,64) ~ (189,67)

    public class P10001302 : RandomPortal
    {
        public P10001302()
        {
            Init(10001302, 10018101, 194, 66, 196, 68);
        }
    }
    //原始地圖:東方海角(10018001)
    //目標地圖:東方海角(10018101)
    //目標坐標:(194,66) ~ (196,68)

    public class P10001303 : RandomPortal
    {
        public P10001303()
        {
            Init(10001303, 30201000, 7, 12, 7, 12);
        }
    }
    //原始地圖:東方海角(10018001)
    //目標地圖:飛空庭的庭院(30201000)
    //目標坐標:(7,12) ~ (7,12)

    public class P10001304 : RandomPortal
    {
        public P10001304()
        {
            Init(10001304, 30202000, 9, 14, 9, 14);
        }
    }
    //原始地圖:飛空庭的庭院(30201000)
    //目標地圖:飛空庭的房間(30202000)
    //目標坐標:(9,14) ~ (9,14)

    public class S10001305 : RandomPortal
    {
        public S10001305()
        {
            this.EventID = 10001305;
            //Init(10001305, 30201000, 7, 9, 7, 9);
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Neko_06> Neko_06_amask = pc.AMask["Neko_06"];

            if (Neko_06_amask.Test(Neko_06.杏子任务开始) &&
                !Neko_06_amask.Test(Neko_06.获得杏子))
            {
                pc.CInt["Neko_06_Map_04"] = CreateMapInstance(50038000, 10023000, 135, 64);
                Warp(pc, (uint)pc.CInt["Neko_06_Map_04"], 7, 10);
            }
            else
            {
                Warp(pc, 30201000, 7, 9);
            }
        }
    }
    //原始地圖:飛空庭的房間(30202000)
    //目標地圖:飛空庭的庭院(30201000)
    //目標坐標:(7,9) ~ (7,9)

    public class P10001306 : RandomPortal
    {
        public P10001306()
        {
            Init(10001306, 10025001, 170, 98, 173, 101);
        }
    }
    //原始地圖:飛空庭的庭院(30201000)
    //目標地圖:奧克魯尼亞東部平原(10025001)
    //目標坐標:(170,98) ~ (173,101)

    public class P10001307 : RandomPortal
    {
        public P10001307()
        {
            Init(10001307, 30200000, 2, 5, 2, 5);
        }
    }
    //原始地圖:奧克魯尼亞東部平原(10025001)
    //目標地圖:帳篷(30200000)
    //目標坐標:(2,5) ~ (2,5)

    public class P10001308 : RandomPortal
    {
        public P10001308()
        {
            Init(10001308, 10025001, 119, 137, 119, 137);
        }
    }
    //原始地圖:帳篷(30200000)
    //目標地圖:奧克魯尼亞東部平原(10025001)
    //目標坐標:(119,137) ~ (119,137)

    public class P10001309 : RandomPortal
    {
        public P10001309()
        {
            Init(10001309, 10018001, 62, 64, 65, 67);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018001)
    //目標坐標:(62,64) ~ (65,67)

    public class P10001310 : RandomPortal
    {
        public P10001310()
        {
            Init(10001310, 10018101, 197, 64, 200, 67);
        }
    }
    //原始地圖:埃米爾族的夢中(30203000)、道米尼世界的幻影(30205000)、塔妮亞世界的幻影(30204000)
    //目標地圖:東方海角(10018101)
    //目標坐標:(197,64) ~ (200,67)

    public class P10001311 : RandomPortal
    {
        public P10001311()
        {
            Init(10001311, 10023100, 251, 126, 253, 129);
        }
    }
    //原始地圖:
    //目標地圖:上城東邊吊橋(10023100)
    //目標坐標:(251,126) ~ (253,129)

    public class P10001312 : RandomPortal
    {
        public P10001312()
        {
            Init(10001312, 10018001, 62, 64, 65, 67);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018001)
    //目標坐標:(62,64) ~ (65,67)

    public class P10001316 : RandomPortal
    {
        public P10001316()
        {
            Init(10001316, 30201003, 7, 9, 7, 9);
        }
    }
    //原始地圖:飛空庭的房間(30202002)
    //目標地圖:飛空庭的庭院(30201003)
    //目標坐標:(7,9) ~ (7,9)


   

   

 

    public class P10001325 : RandomPortal
    {
        public P10001325()
        {
            Init(10001325, 10018002, 45, 94, 57, 96);
        }
    }
    //原始地圖:東方海角(10018000)
    //目標地圖:東方海角(10018002)
    //目標坐標:(45,94) ~ (57,96)

    public class P10001326 : RandomPortal
    {
        public P10001326()
        {
            Init(10001326, 10018000, 45, 94, 57, 96);
        }
    }
    //原始地圖:東方海角(10018002)
    //目標地圖:東方海角(10018000)
    //目標坐標:(45,94) ~ (57,96)

    public class P10001327 : RandomPortal
    {
        public P10001327()
        {
            Init(10001327, 30090002, 2, 2, 4, 3);
        }
    }
    //原始地圖:
    //目標地圖:初始之家(30090002)
    //目標坐標:(2,2) ~ (4,3)

    public class P10001328 : RandomPortal
    {
        public P10001328()
        {
            Init(10001328, 30090003, 2, 2, 4, 3);
        }
    }
    //原始地圖:
    //目標地圖:初始之家(30090003)
    //目標坐標:(2,2) ~ (4,3)

    public class P10001329 : RandomPortal
    {
        public P10001329()
        {
            Init(10001329, 30090004, 2, 2, 4, 3);
        }
    }
    //原始地圖:
    //目標地圖:初始之家(30090004)
    //目標坐標:(2,2) ~ (4,3)

    public class P10001330 : RandomPortal
    {
        public P10001330()
        {
            Init(10001330, 10014002, 126, 197, 129, 199);
        }
    }
    //原始地圖:
    //目標地圖:指導地圖(10014002)
    //目標坐標:(126,197) ~ (129,199)

    public class P10001331 : RandomPortal
    {
        public P10001331()
        {
            Init(10001331, 10025001, 22, 124, 25, 131);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞東部平原(10025001)
    //目標坐標:(22,124) ~ (25,131)

    public class P10001332 : RandomPortal
    {
        public P10001332()
        {
            Init(10001332, 10018001, 135, 64, 137, 66);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018001)
    //目標坐標:(135,64) ~ (137,66)

    public class P10001334 : RandomPortal
    {
        public P10001334()
        {
            Init(10001334, 30097001, 8, 12, 8, 12);
        }
    }
    //原始地圖:
    //目標地圖:賭徒行會(30097001)
    //目標坐標:(8,12) ~ (8,12)

    public class P10001336 : RandomPortal
    {
        public P10001336()
        {
            Init(10001336, 50005000, 11, 16, 11, 16);
        }
    }
    //原始地圖:
    //目標地圖:賭徒監獄(50005000)
    //目標坐標:(11,16) ~ (11,16)

    public class P10001337 : RandomPortal
    {
        public P10001337()
        {
            Init(10001337, 50005000, 3, 1, 3, 1);
        }
    }
    //原始地圖:
    //目標地圖:賭徒監獄(50005000)
    //目標坐標:(3,1) ~ (3,1)

    public class P10001338 : RandomPortal
    {
        public P10001338()
        {
            Init(10001338, 30097001, 8, 5, 8, 5);
        }
    }
    //原始地圖:
    //目標地圖:賭徒行會(30097001)
    //目標坐標:(8,5) ~ (8,5)

    public class P10001339 : RandomPortal
    {
        public P10001339()
        {
            Init(10001339, 10023000, 93, 163, 98, 171);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(93,163) ~ (98,171)

    public class P10001341 : RandomPortal
    {
        public P10001341()
        {
            Init(10001341, 30091005, 6, 15, 6, 15);
        }
    }
    //原始地圖:奧克魯尼亞東部平原(10025001)
    //目標地圖:東部平原初心者學校(30091005)
    //目標坐標:(6,15) ~ (6,15)

    public class P10001342 : RandomPortal
    {
        public P10001342()
        {
            Init(10001342, 10025001, 108, 123, 108, 123);
        }
    }
    //原始地圖:東部平原初心者學校(30091005)
    //目標地圖:奧克魯尼亞東部平原(10025001)
    //目標坐標:(108,123) ~ (108,123)

    public class P10001343 : RandomPortal
    {
        public P10001343()
        {
            Init(10001343, 20146001, 181, 130, 183, 132);
        }
    }
    //原始地圖:
    //目標地圖:光之塔下層(20146001)
    //目標坐標:(181,130) ~ (183,132)

    public class P10001359 : RandomPortal
    {
        public P10001359()
        {
            Init(10001359, 30156001, 7, 16, 7, 16);
        }
    }
    //原始地圖:
    //目標地圖:活動木偶本部(30156001)
    //目標坐標:(7,16) ~ (7,16)

    public class P10001360 : RandomPortal
    {
        public P10001360()
        {
            Init(10001360, 30157001, 6, 13, 6, 13);
        }
    }
    //原始地圖:
    //目標地圖:機械師本部(30157001)
    //目標坐標:(6,13) ~ (6,13)

    public class P10001361 : RandomPortal
    {
        public P10001361()
        {
            Init(10001361, 50009000, 11, 3, 11, 3);
        }
    }
    //原始地圖:
    //目標地圖:活動木偶第二研究所(50009000)
    //目標坐標:(11,3) ~ (11,3)

    public class P10001362 : RandomPortal
    {
        public P10001362()
        {
            Init(10001362, 50010000, 9, 3, 9, 3);
        }
    }
    //原始地圖:
    //目標地圖:活動木偶第二研究所(50010000)
    //目標坐標:(9,3) ~ (9,3)

    public class P10001365 : RandomPortal
    {
        public P10001365()
        {
            Init(10001365, 30060009, 4, 7, 4, 7);
        }
    }
    //原始地圖:
    //目標地圖:商人之店(30060009)
    //目標坐標:(4,7) ~ (4,7)

    public class P10001366 : RandomPortal
    {
        public P10001366()
        {
            Init(10001366, 50006000, 7, 12, 7, 12);
        }
    }
    //原始地圖:
    //目標地圖:飛空庭的庭院(50006000)
    //目標坐標:(7,12) ~ (7,12)

    public class P10001367 : RandomPortal
    {
        public P10001367()
        {
            Init(10001367, 10025000, 112, 122, 114, 124);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞東部平原(10025000)
    //目標坐標:(112,122) ~ (114,124)

    public class P10001368 : RandomPortal
    {
        public P10001368()
        {
            Init(10001368, 50007000, 8, 26, 8, 26);
        }
    }
    //原始地圖:
    //目標地圖:阿高普路斯市地下房間(50007000)
    //目標坐標:(8,26) ~ (8,26)

    public class P10001369 : RandomPortal
    {
        public P10001369()
        {
            Init(10001369, 50008000, 8, 3, 8, 3);
        }
    }
    //原始地圖:
    //目標地圖:阿高普路斯市地下房間(50008000)
    //目標坐標:(8,3) ~ (8,3)

    public class P10001370 : RandomPortal
    {
        public P10001370()
        {
            Init(10001370, 30102001, 5, 7, 5, 7);
        }
    }
    //原始地圖:
    //目標地圖:南軍本部長官室(30102001)
    //目標坐標:(5,7) ~ (5,7)

    public class P10001371 : RandomPortal
    {
        public P10001371()
        {
            Init(10001371, 10018100, 221, 68, 221, 68);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018100)
    //目標坐標:(221,68) ~ (221,68)

    public class P10001372 : RandomPortal
    {
        public P10001372()
        {
            Init(10001372, 30032000, 2, 1, 2, 1);
        }
    }
    //原始地圖:
    //目標地圖:南軍本部入口(30032000)
    //目標坐標:(2,1) ~ (2,1)

    public class P10001373 : Event
    {
        public P10001373()
        {
            this.EventID = 10001373;
        }

        public override void OnEvent(ActorPC pc)
        {
            Wait(pc, 333);
            ShowEffect(pc, 0, 9571);
            Wait(pc, 1000);
            Say(pc, 0, 131, "$R有看不見的牆，$R進不去呀$R;");
        }
    }

    public class P10001374 : Event
    {
        public P10001374()
        {
            this.EventID = 10001374;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Neko_03> Neko_03_cmask = pc.CMask["Neko_03"];

            if (Neko_03_cmask.Test(Neko_03.使用了電晶體) &&
                !Neko_03_cmask.Test(Neko_03.帶理路離開))
            {
                Say(pc, 0, 131, "喵…喵喵……$R;", "\"凱堤\"");
                Say(pc, 0, 131, "啊，對了$R;" +
                    "$R得把理路帶走…$R;");
                return;
            }
            if (CountItem(pc, 10023509) >= 1)
            {
                Neko_03_cmask.SetValue(Neko_03.使用了電晶體, true);
                Say(pc, 0, 131, "「機幹特的電晶體」破碎了$R;");
                TakeItem(pc, 10023509, 10);
                Wait(pc, 333);
                ShowEffect(pc, 0, 4023);
                Wait(pc, 1000);
                Say(pc, 0, 131, "關卡好像中和了$R;");
                return;
            }
            Wait(pc, 333);
            ShowEffect(pc, 0, 9571);
            Wait(pc, 1000);
            Say(pc, 0, 131, "$R有看不見的牆，$R進不去呀$R;");
        }
    }

    public class P10001375 : RandomPortal
    {
        public P10001375()
        {
            Init(10001375, 30102001, 5, 15, 5, 15);
        }
    }
    //原始地圖:
    //目標地圖:南軍本部長官室(30102001)
    //目標坐標:(5,15) ~ (5,15)

    public class P10001376 : RandomPortal
    {
        public P10001376()
        {
            Init(10001376, 10071001, 171, 46, 173, 48);
        }
    }
    //原始地圖:
    //目標地圖:得菩提島(10071001)
    //目標坐標:(171,46) ~ (173,48)

    public class P10001377 : RandomPortal
    {
        public P10001377()
        {
            Init(10001377, 20080015, 26, 26, 28, 28);
        }
    }
    //原始地圖:
    //目標地圖:發怒的得菩提的休息室(20080015)
    //目標坐標:(26,26) ~ (28,28)

    public class P10001378 : RandomPortal
    {
        public P10001378()
        {
            Init(10001378, 10071001, 62, 153, 64, 155);
        }
    }
    //原始地圖:
    //目標地圖:得菩提島(10071001)
    //目標坐標:(62,153) ~ (64,155)

    public class P10001379 : RandomPortal
    {
        public P10001379()
        {
            Init(10001379, 10023000, 126, 149, 128, 151);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(126,149) ~ (128,151)

    public class P10001380 : RandomPortal
    {
        public P10001380()
        {
            Init(10001380, 10071000, 211, 135, 217, 147);
        }
    }
    //原始地圖:
    //目標地圖:泰迪島(10071000)
    //目標坐標:(211,135) ~ (217,147)

    public class P10001381 : RandomPortal
    {
        public P10001381()
        {
            Init(10001381, 10071001, 157, 144, 163, 154);
        }
    }
    //原始地圖:
    //目標地圖:得菩提島(10071001)
    //目標坐標:(157,144) ~ (163,154)

    public class P10001383 : RandomPortal
    {
        public P10001383()
        {
            Init(10001383, 10023000, 178, 164, 187, 177);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(178,164) ~ (187,177)

    public class P10001384 : RandomPortal
    {
        public P10001384()
        {
            Init(10001384, 10018100, 215, 90, 219, 98);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018100)
    //目標坐標:(215,90) ~ (219,98)

    public class P10001385 : RandomPortal
    {
        public P10001385()
        {
            Init(10001385, 10035000, 97, 200, 105, 211);
        }
    }
    //原始地圖:
    //目標地圖:軍艦島(10035000)
    //目標坐標:(97,200) ~ (105,211)

    public class P10001386 : RandomPortal
    {
        public P10001386()
        {
            Init(10001386, 10019000, 116, 111, 120, 114);
        }
    }
    //原始地圖:
    //目標地圖:不死島嶼(10019000)
    //目標坐標:(116,111) ~ (120,114)

    public class P10001387 : RandomPortal
    {
        public P10001387()
        {
            Init(10001387, 10046000, 205, 197, 215, 200);
        }
    }
    //原始地圖:
    //目標地圖:南方海角(10046000)
    //目標坐標:(205,197) ~ (215,200)

    public class P10001388 : RandomPortal
    {
        public P10001388()
        {
            Init(10001388, 10001000, 102, 36, 105, 39);
        }
    }
    //原始地圖:
    //目標地圖:北方海角(10001000)
    //目標坐標:(102,36) ~ (105,39)

    public class P10001389 : RandomPortal
    {
        public P10001389()
        {
            Init(10001389, 10056000, 36, 69, 45, 72);
        }
    }
    //原始地圖:
    //目標地圖:牛牛草原(10056000)
    //目標坐標:(36,69) ~ (45,72)

    public class P10001390 : RandomPortal
    {
        public P10001390()
        {
            Init(10001390, 10054000, 203, 162, 208, 165);
        }
    }
    //原始地圖:
    //目標地圖:謎之團要塞(10054000)
    //目標坐標:(203,162) ~ (208,165)

    public class P10001391 : RandomPortal
    {
        public P10001391()
        {
            Init(10001391, 10060000, 228, 171, 229, 203);
        }
    }
    //原始地圖:
    //目標地圖:摩根市(10060000)
    //目標坐標:(228,171) ~ (229,203)

    public class P10001392 : RandomPortal
    {
        public P10001392()
        {
            Init(10001392, 20163000, 144, 68, 154, 71);
        }
    }
    //原始地圖:
    //目標地圖:光之塔上層(20163000)
    //目標坐標:(144,68) ~ (154,71)

    public class P10001393 : RandomPortal
    {
        public P10001393()
        {
            Init(10001393, 10061000, 161, 74, 171, 78);
        }
    }
    //原始地圖:
    //目標地圖:鬼之寢岩(10061000)
    //目標坐標:(161,74) ~ (171,78)

    public class P10001394 : RandomPortal
    {
        public P10001394()
        {
            Init(10001394, 10063100, 118, 46, 121, 58);
        }
    }
    //原始地圖:
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(118,46) ~ (121,58)

    public class P10001395 : RandomPortal
    {
        public P10001395()
        {
            Init(10001395, 10062000, 190, 42, 194, 45);
        }
    }
    //原始地圖:
    //目標地圖:唐卡島(10062000)
    //目標坐標:(190,42) ~ (194,45)

    public class P10001396 : RandomPortal
    {
        public P10001396()
        {
            Init(10001396, 10059000, 68, 147, 72, 150);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(68,147) ~ (72,150)

    public class P10001397 : RandomPortal
    {
        public P10001397()
        {
            Init(10001397, 10050000, 72, 140, 76, 145);
        }
    }
    //原始地圖:
    //目標地圖:北方中央山脈(10050000)
    //目標坐標:(72,140) ~ (76,145)

    public class P10001402 : RandomPortal
    {
        public P10001402()
        {
            Init(10001402, 10066000, 73, 130, 73, 130);
        }
    }
    //原始地圖:皮歐之家(30071001)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(73,130) ~ (73,130)

    public class P10001403 : RandomPortal
    {
        public P10001403()
        {
            Init(10001403, 30071001, 3, 5, 3, 5);
        }
    }
    //原始地圖:阿伊恩市下層(10066000)
    //目標地圖:皮歐之家(30071001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001407 : RandomPortal
    {
        public P10001407()
        {
            Init(10001407, 30102002, 5, 15, 5, 15);
        }
    }
    //原始地圖:
    //目標地圖:南軍本部長官室(30102002)
    //目標坐標:(5,15) ~ (5,15)

    public class P10001408 : RandomPortal
    {
        public P10001408()
        {
            Init(10001408, 20146001, 199, 144, 199, 144);
        }
    }
    //原始地圖:
    //目標地圖:光之塔下層(20146001)
    //目標坐標:(199,144) ~ (199,144)

   


    public class P10001431 : RandomPortal
    {
        public P10001431()
        {
            Init(10001431, 10059101, 234, 35, 234, 35);
        }
    }
    //原始地圖:
    //目標地圖:麵包樹森林 (夜)(10059101)
    //目標坐標:(234,35) ~ (234,35)

    public class P10001432 : RandomPortal
    {
        public P10001432()
        {
            Init(10001432, 10059100, 234, 35, 234, 35);
        }
    }
    //原始地圖:
    //目標地圖:麵包樹森林(10059100)
    //目標坐標:(234,35) ~ (234,35)

    
    public class P10001441 : RandomPortal
    {
        public P10001441()
        {
            Init(10001441, 10059000, 81, 138, 86, 143);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(81,138) ~ (86,143)

    public class P10001442 : RandomPortal
    {
        public P10001442()
        {
            Init(10001442, 10059000, 92, 92, 95, 95);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(92,92) ~ (95,95)

    public class P10001443 : RandomPortal
    {
        public P10001443()
        {
            Init(10001443, 10059102, 234, 35, 234, 35);
        }
    }
    //原始地圖:
    //目標地圖:麵包樹森林(10059102)
    //目標坐標:(234,35) ~ (234,35)

    public class P10001444 : RandomPortal
    {
        public P10001444()
        {
            Init(10001444, 20164000, 125, 125, 130, 130);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:瑪依瑪依遺跡第一甲板(20164000)
    //目標坐標:(125,125) ~ (130,130)

    public class P10001445 : RandomPortal
    {
        public P10001445()
        {
            Init(10001445, 10059000, 97, 93, 97, 94);
        }
    }
    //原始地圖:瑪依瑪依遺跡第一甲板(20164000)
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(97,93) ~ (97,94)

    public class P10001450 : RandomPortal
    {
        public P10001450()
        {
            Init(10001450, 10018102, 197, 64, 200, 67);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018102)
    //目標坐標:(197,64) ~ (200,67)

    public class P10001451 : RandomPortal
    {
        public P10001451()
        {
            Init(10001451, 10018103, 197, 64, 200, 67);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018103)
    //目標坐標:(197,64) ~ (200,67)

    public class P10001452 : RandomPortal
    {
        public P10001452()
        {
            Init(10001452, 10018003, 187, 64, 189, 67);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018003)
    //目標坐標:(187,64) ~ (189,67)

    public class P10001453 : RandomPortal
    {
        public P10001453()
        {
            Init(10001453, 10018102, 194, 66, 196, 68);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018102)
    //目標坐標:(194,66) ~ (196,68)

    public class P10001454 : RandomPortal
    {
        public P10001454()
        {
            Init(10001454, 10018103, 195, 65, 196, 66);
        }
    }
    //原始地圖:
    //目標地圖:東方海角(10018103)
    //目標坐標:(195,65) ~ (196,66)

    public class P10001455 : RandomPortal
    {
        public P10001455()
        {
            Init(10001455, 30202001, 9, 14, 9, 14);
        }
    }
    //原始地圖:
    //目標地圖:飛空庭的房間(30202001)
    //目標坐標:(9,14) ~ (9,14)

    public class P10001456 : RandomPortal
    {
        public P10001456()
        {
            Init(10001456, 30201001, 7, 9, 7, 9);
        }
    }
    //原始地圖:
    //目標地圖:飛空庭的庭院(30201001)
    //目標坐標:(7,9) ~ (7,9)

    public class P10001457 : RandomPortal
    {
        public P10001457()
        {
            Init(10001457, 30201001, 7, 12, 7, 12);
        }
    }
    //原始地圖:
    //目標地圖:飛空庭的庭院(30201001)
    //目標坐標:(7,12) ~ (7,12)

    public class P10001458 : RandomPortal
    {
        public P10001458()
        {
            Init(10001458, 30203000, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:埃米爾族的夢中(30203000)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001459 : RandomPortal
    {
        public P10001459()
        {
            Init(10001459, 30203001, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:埃米爾族的夢中(30203001)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001460 : RandomPortal
    {
        public P10001460()
        {
            Init(10001460, 30203002, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:埃米爾族的夢中(30203002)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001461 : RandomPortal
    {
        public P10001461()
        {
            Init(10001461, 30204000, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞世界的幻影(30204000)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001462 : RandomPortal
    {
        public P10001462()
        {
            Init(10001462, 30204001, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞世界的幻影(30204001)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001463 : RandomPortal
    {
        public P10001463()
        {
            Init(10001463, 30204002, 13, 13, 17, 17);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞世界的幻影(30204002)
    //目標坐標:(13,13) ~ (17,17)

    public class P10001464 : RandomPortal
    {
        public P10001464()
        {
            Init(10001464, 30205000, 15, 12, 20, 15);
        }
    }
    //原始地圖:
    //目標地圖:道米尼世界的幻影(30205000)
    //目標坐標:(15,12) ~ (20,15)

    public class P10001465 : RandomPortal
    {
        public P10001465()
        {
            Init(10001465, 30205001, 15, 12, 20, 15);
        }
    }
    //原始地圖:
    //目標地圖:道米尼世界的幻影(30205001)
    //目標坐標:(15,12) ~ (20,15)

    public class P10001466 : RandomPortal
    {
        public P10001466()
        {
            Init(10001466, 30205002, 15, 12, 20, 15);
        }
    }
    //原始地圖:
    //目標地圖:道米尼世界的幻影(30205002)
    //目標坐標:(15,12) ~ (20,15)

    public class P10001467 : RandomPortal
    {
        public P10001467()
        {
            Init(10001467, 10025000, 117, 131, 119, 133);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞東部平原(10025000)
    //目標坐標:(117,131) ~ (119,133)

    public class P10001468 : RandomPortal
    {
        public P10001468()
        {
            Init(10001468, 10022000, 142, 121, 144, 123);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞西部平原(10022000)
    //目標坐標:(142,121) ~ (144,123)

    public class P10001469 : RandomPortal
    {
        public P10001469()
        {
            Init(10001469, 10031000, 121, 130, 123, 132);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(121,130) ~ (123,132)

    public class P10001470 : RandomPortal
    {
        public P10001470()
        {
            Init(10001470, 10014000, 132, 136, 134, 138);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞北部平原(10014000)
    //目標坐標:(132,136) ~ (134,138)

    public class P10001471 : RandomPortal
    {
        public P10001471()
        {
            Init(10001471, 20081000, 11, 21, 13, 22);
        }
    }
    //原始地圖:
    //目標地圖:空中之咖啡室(20081000)
    //目標坐標:(11,21) ~ (13,22)

    public class P10001472 : RandomPortal
    {
        public P10001472()
        {
            Init(10001472, 20081000, 11, 4, 13, 6);
        }
    }
    //原始地圖:
    //目標地圖:空中之咖啡室(20081000)
    //目標坐標:(11,4) ~ (13,6)

    public class P10001473 : RandomPortal
    {
        public P10001473()
        {
            Init(10001473, 30208000, 3, 5, 3, 5);
        }
    }
    //原始地圖:奧克魯尼亞南部平原(10031000)
    //目標地圖:僕人的房間(30208000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001474 : RandomPortal
    {
        public P10001474()
        {
            Init(10001474, 30206000, 7, 16, 7, 16);
        }
    }
    //原始地圖:奧克魯尼亞南部平原(10031000)
    //目標地圖:愛麗絲之部屋(30206000)
    //目標坐標:(7,16) ~ (7,16)

    public class P10001475 : RandomPortal
    {
        public P10001475()
        {
            Init(10001475, 30207000, 3, 5, 3, 5);
        }
    }
    //原始地圖:奧克魯尼亞南部平原(10031000)
    //目標地圖:使用者之部屋(30207000)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001476 : RandomPortal
    {
        public P10001476()
        {
            Init(10001476, 10031000, 209, 214, 209, 214);
        }
    }
    //原始地圖:僕人的房間(30208000)
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(209,214) ~ (209,214)

    public class P10001477 : RandomPortal
    {
        public P10001477()
        {
            Init(10001477, 10031000, 217, 215, 218, 216);
        }
    }
    //原始地圖:愛麗絲之部屋(30206000)
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(217,215) ~ (218,216)

    public class P10001478 : RandomPortal
    {
        public P10001478()
        {
            Init(10001478, 10031000, 209, 217, 209, 217);
        }
    }
    //原始地圖:使用者之部屋(30207000)
    //目標地圖:奧克魯尼亞南部平原(10031000)
    //目標坐標:(209,217) ~ (209,217)

    public class P10001483 : RandomPortal
    {
        public P10001483()
        {
            Init(10001483, 10059002, 86, 16, 89, 18);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059002)
    //目標坐標:(86,16) ~ (89,18)

    public class P10001484 : RandomPortal
    {
        public P10001484()
        {
            Init(10001484, 10059103, 88, 158, 89, 159);
        }
    }
    //原始地圖:
    //目標地圖:麵包樹森林(10059103)
    //目標坐標:(88,158) ~ (89,159)

    public class P10001485 : RandomPortal
    {
        public P10001485()
        {
            Init(10001485, 10059002, 83, 155, 84, 156);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059002)
    //目標坐標:(83,155) ~ (84,156)

    public class P10001486 : RandomPortal
    {
        public P10001486()
        {
            Init(10001486, 10022000, 112, 102, 114, 104);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞西部平原(10022000)
    //目標坐標:(112,102) ~ (114,104)

    public class P10001487 : RandomPortal
    {
        public P10001487()
        {
            Init(10001487, 20091001, 92, 251, 95, 253);
        }
    }
    //原始地圖:
    //目標地圖:毒濕地(20091001)
    //目標坐標:(92,251) ~ (95,253)

    public class P10001488 : RandomPortal
    {
        public P10001488()
        {
            Init(10001488, 30122002, 10, 21, 13, 23);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞大聖堂(30122002)
    //目標坐標:(10,21) ~ (13,23)

    public class P10001489 : RandomPortal
    {
        public P10001489()
        {
            Init(10001489, 19900000, 2, 138, 4, 141);
        }
    }
    //原始地圖:
    //目標地圖:因緣之聖地(19900000)
    //目標坐標:(2,138) ~ (4,141)

    public class P10001490 : RandomPortal
    {
        public P10001490()
        {
            Init(10001490, 30200005, 3, 1, 4, 5);
        }
    }
    //原始地圖:
    //目標地圖:帳篷(30200005)
    //目標坐標:(3,1) ~ (4,5)

    public class P10001491 : RandomPortal
    {
        public P10001491()
        {
            Init(10001491, 10024000, 168, 120, 171, 123);
        }
    }
    //原始地圖:
    //目標地圖:下城(10024000)
    //目標坐標:(168,120) ~ (171,123)

    public class P10001492 : RandomPortal
    {
        public P10001492()
        {
            Init(10001492, 30002004, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:埃米爾之家(30002004)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001493 : RandomPortal
    {
        public P10001493()
        {
            Init(10001493, 20012003, 56, 63, 58, 70);
        }
    }
    //原始地圖:
    //目標地圖:冰結的坑道B3F(20012003)
    //目標坐標:(56,63) ~ (58,70)

    public class P10001494 : RandomPortal
    {
        public P10001494()
        {
            Init(10001494, 50044000, 11, 19, 11, 19);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞傳送室(50044000)
    //目標坐標:(11,19) ~ (11,19)

    public class P10001495 : RandomPortal
    {
        public P10001495()
        {
            Init(10001495, 50045000, 13, 17, 13, 17);
        }
    }
    //原始地圖:
    //目標地圖:塔妮亞傳送室(50045000)
    //目標坐標:(13,17) ~ (13,17)

    public class P10001496 : RandomPortal
    {
        public P10001496()
        {
            Init(10001496, 10024000, 197, 167, 197, 167);
        }
    }
    //原始地圖:
    //目標地圖:下城(10024000)
    //目標坐標:(197,167) ~ (197,167)

    public class P10001497 : RandomPortal
    {
        public P10001497()
        {
            Init(10001497, 30091006, 5, 14, 7, 15);
        }
    }
    //原始地圖:
    //目標地圖:等候室(30091006)
    //目標坐標:(5,14) ~ (7,15)

    public class P10001498 : RandomPortal
    {
        public P10001498()
        {
            Init(10001498, 10023000, 168, 109, 171, 111);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(168,109) ~ (171,111)

    public class P10001499 : RandomPortal
    {
        public P10001499()
        {
            Init(10001499, 20117001, 8, 57, 12, 61);
        }
    }
    //原始地圖:
    //目標地圖:大廳(20117001)
    //目標坐標:(8,57) ~ (12,61)

    public class P10001500 : Event
    {
        public P10001500()
        {
            this.EventID = 10001500;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 30098001, 5, 7);
        }
    }
    //原始地圖:
    //目標地圖:恐佈的房間(30098001)
    //目標坐標:(5,7) ~ (7,8)

    public class P10001501 : Event
    {
        public P10001501()
        {
            this.EventID = 10001501;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<obake> obake_mask = new BitMask<obake>(pc.CMask["obake"]);
            if (obake_mask.Test(obake.開關))
            {

                PlaySound(pc, 2212, false, 100, 50);

                Say(pc, 0, 0, "門緊緊的關閉著……。$R;", "");
                return;

            }
            PlaySound(pc, 2212, false, 100, 50);
            PlaySound(pc, 2445, false, 100, 50);
            Warp(pc, 20117001, 14, 28);

        }
    }
    //原始地圖:
    //目標地圖:大廳(20117001)
    //目標坐標:(14,28) ~ (15,29)

    public class P10001502 : Event
    {
        public P10001502()
        {
            this.EventID = 10001502;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<obake> obake_mask = new BitMask<obake>(pc.CMask["obake"]);
            if (obake_mask.Test(obake.第二目))
            {
                if (obake_mask.Test(obake.開門))
                {
                    Warp(pc, 30154002, 5, 14);
                }

                return;
            }

            Warp(pc, 30154002, 6, 14);
        }
    }
    //原始地圖:
    //目標地圖:恐佈的房間(30154002)
    //目標坐標:(5,14) ~ (7,15)

    public class P10001503 : Event
    {
        public P10001503()
        {
            this.EventID = 10001503;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 20117001, 1, 31);
        }
    }
    //原始地圖:
    //目標地圖:大廳(20117001)
    //目標坐標:(1,30) ~ (2,32)

    public class P10001504 : Event
    {
        public P10001504()
        {
            this.EventID = 10001504;
        }

        public override void OnEvent(ActorPC pc)
        {

            Warp(pc, 20117001, 14, 33);
        }
    }
    //原始地圖:
    //目標地圖:大廳(20117001)
    //目標坐標:(14,33) ~ (15,34)

    public class S10001505 : Event
    {
        public S10001505()
        {
            this.EventID = 10001505;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<obake> obake_mask = new BitMask<obake>(pc.CMask["obake"]);
            if (obake_mask.Test(obake.第二目))
            {
                if (obake_mask.Test(obake.木偶2))
                {
                    PlaySound(pc, 2101, false, 100, 50);
                    Warp(pc, 50049000, 3, 4);
                    return;
                }
                PlaySound(pc, 2212, false, 100, 50);

                Say(pc, 0, 0, "門緊緊的關閉著……。$R;", "");
                return;
            }
            if (obake_mask.Test(obake.鑰匙2))
            {
                PlaySound(pc, 2101, false, 100, 50);
                Warp(pc, 50049000, 3, 4);
                return;
            }
            PlaySound(pc, 2212, false, 100, 50);
            Say(pc, 0, 0, "門緊緊的關閉著……。$R;", "");
        }
    }
    //原始地圖:
    //目標地圖:秘室(50049000)
    //目標坐標:(3,4) ~ (4,5)

    public class P10001506 : Event
    {
        public P10001506()
        {
            this.EventID = 10001506;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 50050000, 3, 31);
        }
    }
    //原始地圖:
    //目標地圖:地下室(50050000)
    //目標坐標:(2,31) ~ (4,33)

    public class P10001507 : RandomPortal
    {
        public P10001507()
        {
            Init(10001507, 20117001, 6, 2, 10, 4);
        }
    }
    //原始地圖:
    //目標地圖:大廳(20117001)
    //目標坐標:(6,2) ~ (10,4)

    public class P10001508 : RandomPortal
    {
        public P10001508()
        {
            Init(10001508, 10023000, 177, 100, 180, 102);
        }
    }
    //原始地圖:
    //目標地圖:上城(10023000)
    //目標坐標:(177,100) ~ (180,102)

    public class P10001510 : RandomPortal
    {
        public P10001510()
        {
            Init(10001510, 50055000, 209, 125, 239, 142);
        }
    }

    //原始地圖:
    //目標地圖:瑪依瑪依島(10059003)
    //目標坐標:(83,155) ~ (84,156)

    public class P10001524 : RandomPortal
    {
        public P10001524()
        {
            Init(10001524, 10059003, 81, 138, 86, 143);
        }
    }
    //原始地圖:
    //目標地圖:瑪依瑪依島(10059003)
    //目標坐標:(81,138) ~ (86,143)

    public class P10001525 : RandomPortal
    {
        public P10001525()
        {
            Init(10001525, 30022001, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:書籍抵押所(30022001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001526 : RandomPortal
    {
        public P10001526()
        {
            Init(10001526, 10032000, 235, 84, 236, 85);
        }
    }
    //原始地圖:
    //目標地圖:樂天娜湖泊(10032000)
    //目標坐標:(235,84) ~ (236,85)

    public class P10001527 : RandomPortal
    {
        public P10001527()
        {
            Init(10001527, 30164001, 9, 17, 9, 17);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞王宮（王妃的寢室）(30164001)
    //目標坐標:(9,17) ~ (9,17)

    public class P10001528 : RandomPortal
    {
        public P10001528()
        {
            Init(10001528, 10030002, 193, 3, 194, 3);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞王國領土(10030002)
    //目標坐標:(193,3) ~ (194,3)

    public class P10001529 : RandomPortal
    {
        public P10001529()
        {
            Init(10001529, 10064002, 186, 2, 187, 2);
        }
    }
    //原始地圖:
    //目標地圖:聖火之山(10064002)
    //目標坐標:(186,2) ~ (187,2)

    public class P10001530 : RandomPortal
    {
        public P10001530()
        {
            Init(10001530, 20111001, 30, 21, 30, 21);
        }
    }
    //原始地圖:
    //目標地圖:受詛咒之城(20111001)
    //目標坐標:(30,21) ~ (30,21)

    public class P10001531 : RandomPortal
    {
        public P10001531()
        {
            Init(10001531, 20111001, 3, 21, 3, 21);
        }
    }
    //原始地圖:
    //目標地圖:受詛咒之城(20111001)
    //目標坐標:(3,21) ~ (3,21)

    public class P10001532 : RandomPortal
    {
        public P10001532()
        {
            Init(10001532, 20111002, 16, 3, 16, 3);
        }
    }
    //原始地圖:
    //目標地圖:受詛咒之城(20111002)
    //目標坐標:(16,3) ~ (16,3)

    public class P10001533 : RandomPortal
    {
        public P10001533()
        {
            Init(10001533, 30164001, 9, 17, 9, 17);
        }
    }
    //原始地圖:
    //目標地圖:奧克魯尼亞王宮（王妃的寢室）(30164001)
    //目標坐標:(9,17) ~ (9,17)

    public class P10001534 : RandomPortal
    {
        public P10001534()
        {
            Init(10001534, 30022001, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:書籍抵押所(30022001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001535 : RandomPortal
    {
        public P10001535()
        {
            Init(10001535, 30157002, 6, 13, 6, 13);
        }
    }
    //原始地圖:
    //目標地圖:電路機械研究所(30157002)
    //目標坐標:(6,13) ~ (6,13)

    public class P10001536 : RandomPortal
    {
        public P10001536()
        {
            Init(10001536, 20142001, 62, 10, 66, 13);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡上層(20142001)
    //目標坐標:(62,10) ~ (66,13)

    public class P10001537 : RandomPortal
    {
        public P10001537()
        {
            Init(10001537, 20142001, 68, 78, 68, 78);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡上層(20142001)
    //目標坐標:(68,78) ~ (68,78)

    public class P10001538 : RandomPortal
    {
        public P10001538()
        {
            Init(10001538, 20142001, 83, 70, 83, 70);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡上層(20142001)
    //目標坐標:(83,70) ~ (83,70)

    public class P10001539 : RandomPortal
    {
        public P10001539()
        {
            Init(10001539, 20141001, 58, 85, 58, 85);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡下層(20141001)
    //目標坐標:(58,85) ~ (58,85)

    public class P10001540 : RandomPortal
    {
        public P10001540()
        {
            Init(10001540, 20141001, 92, 64, 92, 64);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡下層(20141001)
    //目標坐標:(92,64) ~ (92,64)

    public class P10001541 : RandomPortal
    {
        public P10001541()
        {
            Init(10001541, 10024000, 163, 163, 166, 166);
        }
    }
    //原始地圖:
    //目標地圖:下城(10024000)
    //目標坐標:(163,163) ~ (166,166)

    public class P10001542 : RandomPortal
    {
        public P10001542()
        {
            Init(10001542, 10058000, 125, 244, 125, 244);
        }
    }
    //原始地圖:
    //目標地圖:通天之塔(10058000)
    //目標坐標:(125,244) ~ (125,244)

    public class P10001543 : RandomPortal
    {
        public P10001543()
        {
            Init(10001543, 10060000, 82, 38, 85, 42);
        }
    }
    //原始地圖:
    //目標地圖:摩根市(10060000)
    //目標坐標:(82,38) ~ (85,42)

    public class P10001544 : RandomPortal
    {
        public P10001544()
        {
            this.EventID = 10001544;
        }
        public override void OnEvent(ActorPC pc)
        {
            {
                Say(pc, 0, 0, "要出去？（埃米爾界）$R;", "");
                if (Select(pc, "出去？（埃米爾界）", "", "不好", "好") == 2)
                {
                    Warp(pc, 10058000, 128, 157);
                }
            }
        }
    }
    //原始地圖:
    //目標地圖:通天之塔(10058000)
    //目標坐標:(126,157) ~ (129,158)

    public class P10001545 : Event
    {
        public P10001545()
        {
            this.EventID = 10001545;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (CountItem(pc, 10011605) > 0)
            {
                Say(pc, 0, 0, "……。$R;", "");
                ShowEffect(pc, 4048);

                Say(pc, 0, 0, "『降竜石』$R;" +
               "開始放出淡淡的光芒！$R;", "");

                Say(pc, 0, 0, "要把$R;" +
                "『降竜石』舉起來么？$R;", "");
                if (Select(pc, "把『降竜石』舉起來？", "", "不舉起來", "舉起來") == 2)
                {
                    Say(pc, 0, 0, "高高的舉起了『降竜石』。$R;", "");

                    ShowEffect(pc, 4007);
                    Wait(pc, 660);
                    ShowEffect(pc, 4007);
                    Wait(pc, 660);
                    ShowEffect(pc, 4007);
                    ShowEffect(pc, 127, 153, 5306);
                    PlaySound(pc, 2407, false, 100, 50);
                    Wait(pc, 990);
                    Wait(pc, 3960);
                    Say(pc, 0, 0, "『降竜石』碎掉了。$R;", "");
                    TakeItem(pc, 10011605, 1);
                    Warp(pc, 20170001, 32, 59);
                    return;

                }
            }

            if (Select(pc, "要進入塔內么？", "", "不進去", "進去") == 2)
            {
                ShowEffect(pc, 127, 153, 5306);
                PlaySound(pc, 2407, false, 100, 50);
                Wait(pc, 990);
                NPCMotion(pc, 12002089, 621);
                Wait(pc, 3960);
                Warp(pc, 20170000, 31, 59);
            }
        }

    }
    //原始地圖:
    //目標地圖:升降機室(20170000)
    //目標坐標:(30,59) ~ (33,60)

    public class P10001546 : Event
    {
        public P10001546()
        {
            this.EventID = 10001546;
        }
        public override void OnEvent(ActorPC pc)
        {

            Say(pc, 0, 0, "控制面板的$R;" +
            "電源還連接著。$R;", "");
            switch (Select(pc, "要操作畫面么？", "", "不做", "按上方的按鈕", "按下方的按鈕"))
            {

                case 2:
                    ShowEffect(pc, 5289);

                    Say(pc, 0, 131, "嗶……。$R;" +
                    "$P……。$R;" +
                    "$P…………。$R;" +
                    "$P………………。$R;" +
                    "$P訪問成功。$R;" +
                    "開始傳送到塔尼亞界。$R;", " ");
                    ShowEffect(pc, 5314);
                    Wait(pc, 990);
                    Warp(pc, 11058000, 128, 157);
                    break;
                case 3:
                    if (pc.PossesionedActors.Count != 0)
                    {
                        Say(pc, 131, "解除凭依之后才能通过哦.");
                        return;
                    }
                    if (pc.Quest != null)
                        Say(pc, 131, "要交掉任务以后才能通过.");
                    else
                    {
                        ShowEffect(pc, 5289);

                        Say(pc, 0, 0, "ピッ……。$R;" +
                        "$P……。$R;" +
                        "$P…………。$R;" +
                        "$P………………。$R;" +
                        "$Pアクセス成功。$R;" +
                        "ドミニオンワールドニ転移シマスカ？$R;", "");
                        if (Select(pc, "転移シマスカ？", "", "次元転生ついて", "行く") == 2)
                        {
                            ShowEffect(pc, 5313);
                            Wait(pc, 990);
                            Warp(pc, 12058000, 127, 155);
                            SetHomePoint(pc, 12058000, 128, 155);
                        }
                    }
                    break;
            }
        }
    }
    //原始地圖:
    //目標地圖:通天之塔(11058000)
    //目標坐標:(126,157) ~ (129,158)

    public class P10001547 : Event
    {
        public P10001547()
        {
            this.EventID = 10001547;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 0, 0, "乘坐么？$R;" +
            "能帶你到漂流水鄉去哦♪$R;", "");
            if (Select(pc, "乘坐么？", "", "不去", "去") == 2)
            {
                Warp(pc, 11053000, 21, 230);
            }
            //Init(10001547, 11053000, 18, 232, 22, 236);
        }
    }
    //原始地圖:
    //目標地圖:飄流水鄉(11053000)
    //目標坐標:(18,232) ~ (22,236)

    public class P10001548 : Event
    {
        public P10001548()
        {
            this.EventID = 10001548;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 0, 0, "乘坐么？$R;" +
            "能帶你到衝天塔去哦♪$R;", "");
            if (Select(pc, "乘坐么？", "", "不去", "去") == 2)
            {
                Warp(pc, 11058000, 125, 244);
            }
            //Init(10001548, 11058000, 125, 244, 125, 244);
        }
    }
    //原始地圖:
    //目標地圖:通天之塔(11058000)
    //目標坐標:(125,244) ~ (125,244)

    public class P10001549 : RandomPortal
    {
        public P10001549()
        {
            this.EventID = 10001549;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (DateTime.Now.Hour % 2 == 0)
            {
                Say(pc, 131, "现在是暖流$R;");
                Warp(pc, 21180000, 68, 253);
            }
            else
            {
                Say(pc, 131, "现在是寒流$R;");
                Warp(pc, 21180001, 68, 253);
            }
        }
    }
    //原始地圖:
    //目標地圖:海底洞窟(21180000)
    //目標坐標:(62,249) ~ (77,252)

    public class P10001550 : RandomPortal
    {
        public P10001550()
        {
            Init(10001550, 11053000, 215, 19, 221, 20);
        }
    }
    //原始地圖:
    //目標地圖:飄流水鄉(11053000)
    //目標坐標:(215,19) ~ (221,20)

    public class P10001551 : RandomPortal
    {
        public P10001551()
        {
            Init(10001551, 21180000, 112, 121, 115, 122);
        }
    }
    //原始地圖:
    //目標地圖:海底洞窟(21180000)
    //目標坐標:(112,121) ~ (115,122)

    public class P10001552 : RandomPortal
    {
        public P10001552()
        {
            Init(10001552, 21180000, 112, 129, 114, 130);
        }
    }
    //原始地圖:
    //目標地圖:海底洞窟(21180000)
    //目標坐標:(112,129) ~ (114,130)

    public class P10001553 : RandomPortal
    {
        public P10001553()
        {
            Init(10001553, 11053000, 100, 130, 105, 135);
        }
    }
    //原始地圖:
    //目標地圖:飄流水鄉(11053000)
    //目標坐標:(100,130) ~ (105,135)

    public class P10001554 : RandomPortal
    {
        public P10001554()
        {
            Init(10001554, 21003000, 31, 49, 32, 50);
        }
    }
    //原始地圖:
    //目標地圖:美人魚之家(21003000)
    //目標坐標:(31,49) ~ (32,50)

    public class P10001555 : RandomPortal
    {
        public P10001555()
        {
            Init(10001555, 11053000, 71, 108, 72, 109);
        }
    }
    //原始地圖:
    //目標地圖:飄流水鄉(11053000)
    //目標坐標:(71,108) ~ (72,109)

    public class P10001556 : RandomPortal
    {
        public P10001556()
        {
            Init(10001556, 21003000, 107, 49, 108, 50);
        }
    }
    //原始地圖:
    //目標地圖:美人魚之家(21003000)
    //目標坐標:(107,49) ~ (108,50)

    public class P10001557 : RandomPortal
    {
        public P10001557()
        {
            Init(10001557, 11053000, 176, 112, 177, 113);
        }
    }
    //原始地圖:
    //目標地圖:飄流水鄉(11053000)
    //目標坐標:(176,112) ~ (177,113)

    public class P10001558 : RandomPortal
    {
        public P10001558()
        {
            Init(10001558, 21003000, 63, 103, 64, 104);
        }
    }
    //原始地圖:
    //目標地圖:美人魚之家(21003000)
    //目標坐標:(63,103) ~ (64,104)

    public class P10001559 : RandomPortal
    {
        public P10001559()
        {
            Init(10001559, 11053000, 112, 170, 113, 171);
        }
    }
    //原始地圖:
    //目標地圖:飄流水鄉(11053000)
    //目標坐標:(112,170) ~ (113,171)

    public class P10001560 : RandomPortal
    {
        public P10001560()
        {
            Init(10001560, 11058000, 127, 186, 128, 187);
        }
    }
    //原始地圖:
    //目標地圖:通天之塔(11058000)
    //目標坐標:(127,186) ~ (128,187)

    public class P10001561 : RandomPortal
    {
        public P10001561()
        {
            Init(10001561, 21180001, 62, 249, 77, 252);
        }
    }
    //原始地圖:
    //目標地圖:海底洞窟(21180001)
    //目標坐標:(62,249) ~ (77,252)

    public class P10001562 : RandomPortal
    {
        public P10001562()
        {
            Init(10001562, 21180001, 112, 121, 115, 122);
        }
    }
    //原始地圖:
    //目標地圖:海底洞窟(21180001)
    //目標坐標:(112,121) ~ (115,122)

    public class P10001563 : RandomPortal
    {
        public P10001563()
        {
            Init(10001563, 21180001, 105, 136, 109, 138);
        }
    }
    //原始地圖:
    //目標地圖:海底洞窟(21180001)
    //目標坐標:(105,136) ~ (109,138)

    public class P10001564 : RandomPortal
    {
        public P10001564()
        {
            Init(10001564, 21180002, 62, 249, 77, 252);
        }
    }
    //原始地圖:
    //目標地圖:海底洞窟(21180002)
    //目標坐標:(62,249) ~ (77,252)

    public class P10001565 : RandomPortal
    {
        public P10001565()
        {
            Init(10001565, 21180002, 112, 121, 115, 122);
        }
    }
    //原始地圖:
    //目標地圖:海底洞窟(21180002)
    //目標坐標:(112,121) ~ (115,122)

    public class P10001566 : RandomPortal
    {
        public P10001566()
        {
            Init(10001566, 21180002, 105, 136, 109, 138);
        }
    }
    //原始地圖:
    //目標地圖:海底洞窟(21180002)
    //目標坐標:(105,136) ~ (109,138)

    public class P10001567 : RandomPortal
    {
        public P10001567()
        {
            Init(10001567, 11058001, 126, 157, 129, 158);
        }
    }
    //原始地圖:
    //目標地圖:通天之塔(11058001)
    //目標坐標:(126,157) ~ (129,158)

    public class P10001568 : Event
    {
        public P10001568()
        {
            this.EventID = 10001568;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 0, 0, "下麵能看到某樣東西。$R;", "");
            if (Select(pc, "怎麼辦？", "", "潛入", "什麽都不做") == 1)
            {
                Warp(pc, 21003000, 82, 48);
            }
            //Init(10001568, 21003000, 81, 48, 83, 50);
        }
    }
    //原始地圖:
    //目標地圖:美人魚之家(21003000)
    //目標坐標:(81,48) ~ (83,50)

    public class P10001569 : RandomPortal
    {
        public P10001569()
        {
            Init(10001569, 11053000, 148, 133, 150, 135);
        }
    }
    //原始地圖:
    //目標地圖:飄流水鄉(11053000)
    //目標坐標:(148,133) ~ (150,135)

    public class P10001570 : RandomPortal
    {
        public P10001570()
        {
            Init(10001570, 20020002, 53, 2, 53, 2);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡第2層(20020002)
    //目標坐標:(53,2) ~ (53,2)

    public class P10001571 : RandomPortal
    {
        public P10001571()
        {
            Init(10001571, 20141001, 75, 13, 79, 13);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡下層(20141001)
    //目標坐標:(75,13) ~ (79,13)

    public class P10001580 : RandomPortal
    {
        public P10001580()
        {
            Init(10001580, 30022002, 3, 5, 3, 5);
        }
    }
    //原始地圖:
    //目標地圖:上世紀的房間(30022002)
    //目標坐標:(3,5) ~ (3,5)

    public class P10001581 : RandomPortal
    {
        public P10001581()
        {
            Init(10001581, 30157003, 6, 13, 6, 13);
        }
    }
    //原始地圖:
    //目標地圖:電路機械研究所(30157003)
    //目標坐標:(6,13) ~ (6,13)

    public class P10001582 : RandomPortal
    {
        public P10001582()
        {
            Init(10001582, 20142002, 63, 10, 66, 13);
        }
    }
    //原始地圖:
    //目標地圖:地下遺跡上層(20142002)
    //目標坐標:(63,10) ~ (66,13)

    public class P10001583 : RandomPortal
    {
        public P10001583()
        {
            Init(10001583, 10057000, 67, 141, 67, 141);
        }
    }
    //原始地圖:
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(67,141) ~ (67,141)

    public class P10001584 : RandomPortal
    {
        public P10001584()
        {
            Init(10001584, 30093000, 4, 7, 4, 7);
        }
    }
    //原始地圖:
    //目標地圖:伐木工人之家(30093000)
    //目標坐標:(4,7) ~ (4,7)




   

    //下麵是測試

    public class P10001723 : Event
    {
        public P10001723()
        {
            this.EventID = 10001723;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 0, 0, "上にあるクジラの口まで$R;" +
            "ロープが伸びている…$R;" +
            "$R伝って登れば、$R;" +
            "クジラの口の中に入れそうだ。$R;", "");
            switch (Select(pc, "登る？", "", "登らない", "登ってみる"))
            {
                case 2:
                    Warp(pc, 21190000, 32, 184);
                    break;
            }

        }

    }

    public class P10001724 : RandomPortal
    {
        public P10001724()
        {
            Init(10001724, 11027000, 189, 197, 189, 197);
        }
    }

    public class P10001725 : RandomPortal
    {
        public P10001725()
        {
            Init(10001725, 21192000, 63, 63, 64, 64);
        }
    }

    public class P10001726 : RandomPortal
    {
        public P10001726()
        {
            Init(10001726, 21192000, 63, 63, 64, 64);
        }
    }

    public class P10001727 : RandomPortal
    {
        public P10001727()
        {
            Init(10001727, 21195000, 67, 67, 69, 69);
        }
    }

    public class P10001728 : RandomPortal
    {
        public P10001728()
        {
            Init(10001728, 21190000, 17, 122, 18, 124);
        }
    }

    public class P10001729 : RandomPortal
    {
        public P10001729()
        {
            Init(10001729, 21192000, 63, 63, 64, 64);
        }
    }

    public class P10001730 : RandomPortal
    {
        public P10001730()
        {
            Init(10001730, 21192000, 63, 63, 64, 64);
        }
    }

    public class P10001731 : RandomPortal
    {
        public P10001731()
        {
            Init(10001731, 21196000, 24, 24, 24, 24);
        }
    }

    public class P10001732 : RandomPortal
    {
        public P10001732()
        {
            Init(10001732, 21191000, 95, 106, 95, 106);
        }
    }

    public class P10001733 : RandomPortal
    {
        public P10001733()
        {
            Init(10001733, 21190000, 17, 122, 18, 124);
        }
    }

    public class P10001734 : RandomPortal
    {
        public P10001734()
        {
            Init(10001734, 20125001, 24, 24, 24, 24);
        }
    }

    public class P10001735 : Event
    {
        public P10001735()
        {
            this.EventID = 10001735;
        }

        public override void OnEvent(ActorPC pc)
        {
            Warp(pc, 21193000, 127, 241);
            ShowEffect(pc, 10668, 4539);
            ShowEffect(pc, 10698, 4539);
        }
    }

    public class P10001736 : RandomPortal
    {
        public P10001736()
        {
            Init(10001736, 21190000, 17, 122, 18, 124);
        }
    }

    public class P10001695 : RandomPortal
    {
        public P10001695()
        {
            Init(10001695, 21194000, 3, 0, 4, 2);
        }
    }

    public class P10001696 : RandomPortal
    {
        public P10001696()
        {
            Init(10001696, 21193000, 132, 208, 135, 210);
        }
    }




    //進入遺跡
    public class P12001500 : Event
    {
        public P12001500()
        {
            this.EventID = 12001500;
        }

        public override void OnEvent(ActorPC pc)
        {


            if (GetPossibleDungeons(pc).Count == 0)
            {
                if (pc.Quest != null)
                {
                    if (pc.Quest.ID == 26500002 || pc.Quest.ID == 10032027 || pc.Quest.ID == 10032028 || pc.Quest.ID == 10032029)
                    {
                        Say(pc, 131, "您接的任務不能從這裡進入。$R;");
                        return;
                    }
                    if (pc.Quest.Detail.DungeonID != 0)
                    {
                        if (pc.Quest.Status == SagaDB.Quests.QuestStatus.OPEN)
                        {
                            switch (pc.MapID)
                            {
                                case 10066000:
                                    //阿伊恩市下層(10066000)
                                    CreateDungeon(pc, pc.Quest.Detail.DungeonID, 10066000, 79, 112);
                                    WarpToDungeon(pc);
                                    return;

                                case 20080012:
                                    //遺跡入口前廣場(20080012)
                                    CreateDungeon(pc, pc.Quest.Detail.DungeonID, 20080012, 22, 29);
                                    WarpToDungeon(pc);
                                    return;

                                case 20080013:
                                    //遺跡入口前廣場(20080013)
                                    CreateDungeon(pc, pc.Quest.Detail.DungeonID, 20080013, 22, 29);
                                    WarpToDungeon(pc);
                                    return;

                                case 20080014:
                                    //遺跡入口前廣場(20080014)
                                    CreateDungeon(pc, pc.Quest.Detail.DungeonID, 20080014, 22, 29);
                                    WarpToDungeon(pc);
                                    return;

                                case 30100000:
                                    //東軍本部長官室(30100000)
                                    CreateDungeon(pc, pc.Quest.Detail.DungeonID, 30100000, 8, 5);
                                    WarpToDungeon(pc);
                                    return;
                            }
                            CreateDungeon(pc, pc.Quest.Detail.DungeonID, 10023100, 247, 124);
                            WarpToDungeon(pc);
                        }
                        else
                        {
                            Say(pc, 131, "您不可以在這裡出入$R;" +
                                "請重新領取出入許可唷$R;");
                        }
                    }
                    else
                    {
                        Say(pc, 131, "傳送點沒有啟動$R;");
                    }
                }
                else
                {
                    Say(pc, 131, "您不可以在這裡出入$R;" +
                        "請重新領取出入許可唷$R;");
                }
            }
            else
            {
                WarpToDungeon(pc);
            }
        }
    }

    //起点: 谜团北部 
    //终点: 谜团本部
    public class P12001118 : Event
    {
        public P12001118()
        {
            this.EventID = 12001118;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (CountItem(pc, 10051801) >= 1)
            {
                Say(pc, 255, "給佈魯送櫻花糕去吧？$R;");
                switch (Select(pc, "怎麼辦呢？", "", "好阿", "我才不去勒"))
                {
                    case 1:
                        //EVENTMAP_IN 33 1 6 1 0
                        return;
                    case 2:
                        break;
                }
            }
            Warp(pc, 30131001, 6, 1);
        }
    }
}