using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M10024000
{
    public class S13000214: Event
    {
        public S13000214()
        {
            this.EventID = 13000214;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<wsj> wsj_mask = new BitMask<wsj>(pc.CMask["wsj"]);
            //int selection;
            if (wsj_mask.Test(wsj.契约))
            {
                if (SagaLib.Global.Random.Next(0, 99) < 30)
                {

                    Say(pc, 0, "(…どこからともなく声が聞こえる.)$R;", "");

                    Say(pc, 0, "…グヒャ……。$R;", "謎の声");

                    Say(pc, 0, "……。$R;", "謎の声");

                    Say(pc, 0, "(…声は聞こえなくなった。)$R;", "");
                }
                契约(pc);
            }
            Say(pc, 0, "(…どこからともなく声が聞こえる.)$R;", "謎の声");

            Say(pc, 0, "……ハッピ～ハロウィ～ン…。$R;", "謎の声");
            if (Select(pc, "誰だろう？", "", "声の主を探す", "無視する")==1)
            {
                Say(pc, 0, "…グヒャヒャ。$R;" +
                "$P……俺様を探してるのカ…？$R;" +
                "$R…そんなことしても無駄だゼ？$R;" +
                "$P…もし俺様の姿を拝みたいのなら……$R;" +
                "その肉体を捨てる以外に$R;" +
                "方法はないゾ…。$R;" +
                "$P…グヒャッ、グヒャ。$R;", "謎の声");
                if (Select(pc, "どうする？", "", "誰だ！", "名を名乗る", "笑い方が気持ち悪い") == 1)
                {
                    Say(pc, 0, "……あン、俺様か？$R;" +
                    "$Rグヒャヒャヒャ…。$R;" +
                    "いいだろう、教えてやろウ……。$R;", "謎の声");
                    Say(pc, 0, "よーく聞ケ！$R;" +
                    "$R…俺様はオマエ達の世界デ$R;" +
                    "｢死神｣という名で認識されている$R;" +
                    "存在ダ。$R;" +
                    "$Pもっと詳しい話をしてやりたいガ$R;" +
                    "これから死に逝く奴に説明しても$R;" +
                    "無駄だよナァ…。$R;" +
                    "$Rグヒャッヒャヒャッ！$R;", "死神");
                    if (Select(pc, "どうする？", "", "理由を説明して頂く", "無視する") == 1)
                    {
                        Say(pc, 0, "いいダロウ…教えてヤル…。$R;" +
                        "$P…オマエが先ほど食べた菓子ィ…$R;" +
                        "$Rアレにはある呪術が施されていてナ…$R;" +
                        "アレを食っちまうと…$R;" +
                        "｢私の魂を死神様へ差し上げます｣$R;" +
                        "という契約がされる仕組みでナ…。$R;" +
                        "$Pマぁ、一種の呪というヤツだナ…。$R;", "死神");

                        Say(pc, 0, "…さて、ソロソロ時間ダ…。$R;" +
                        "$R…なにか言い残すことはないかィ?$R;" +
                        "$Pもっとモ、$R;" +
                        "$R死神の俺様に言い残しても$R;" +
                        "……何も残らない訳だがねェ…！$R;", "死神");
                        if (Select(pc, "言い残すことは？", "", "助けてください", "見逃してください")==1)
                        {
                            Say(pc, 0, "…言い残すコトバはそれだけカ？$R;" +
                            "$R…契約は契約ダ…。$R;" +
                            "観念シロッ！眼をつむれッ！$R;" +
                            "その魂、頂くゾッ！！$R;", "死神");
                            Wait(pc, 1650);

                            Say(pc, 0, "……。$R;", "死神");

                            Say(pc, 0, "……グヒャヒャッ！$R;" +
                            "$Rビビッたカッ！？$R;" +
                            "$Pコノ世界での魂狩は禁則事項でナァ！$R;" +
                            "残念ながら、オマエの魂は奪えナイ。$R;" +
                            "$Pしかもこのハロウィンという季節は$R;" +
                            "魂狩りではなく、オマエ達ガキ共の$R;" +
                            "相手をするのが仕事なのサ…。$R;", "死神");

                            Say(pc, 0, "…さーテェ、商売ダ！$R;" +
                            "$Pハロウィン限定イベントォ！$R;" +
                            "$R死神との契約入門してみるカ？$R;", "死神");
                            if (Select(pc, "取引する？", "", "する", "断る") == 1)
                            {

                                wsj_mask.SetValue(wsj.契约, true);
                                契约(pc);
                            }
                        }
                    }
                }
            }
        }
        void 契约(ActorPC pc)
        {
            Say(pc, 0, "…グヘヘ、契約成立ダ…$R;" +
            "$P取引は簡単だ、$R;" +
            "オマエは俺様が要求するモノに$R;" +
            "対してイエス、ノーで$R;" +
            "答えて行くだケ。$R;" +
            "$Pそれでは始めさせてもらうゾ…。$R;", "死神");
            Say(pc, 0, "100ゴールドくれヨ。$R;", "死神");
            if (Select(pc, "100G払う？", "", "払わない", "払う（100ゴールド）") == 2)
            {
                if (pc.Gold >= 100)
                {

                    PlaySound(pc, 2040, false, 100, 50);
                    pc.Gold -= 100;
                    Say(pc, 0, "100ゴールド払った。$R;", "");

                    Say(pc, 0, "次ハ500ゴールドダ…。$R;", "死神");
                    if (Select(pc, "500G払う？", "", "払わない", "払う（500ゴールド）") == 2)
                    {
                        if (pc.Gold >= 500)
                        {
                            PlaySound(pc, 2040, false, 100, 50);

                            Say(pc, 0, "500ゴールド払った。$R;", "");
                            pc.Gold -= 500;
                            Say(pc, 0, "次ハ1000ゴールドダ…。$R;", "死神");
                            if (Select(pc, "1000G払う？", "", "払わない", "払う（1000ゴールド）") == 2)
                            {
                                if (pc.Gold >= 1000)
                                {
                                    PlaySound(pc, 2040, false, 100, 50);

                                    Say(pc, 0, "1000ゴールド払った。$R;", "");
                                    pc.Gold -= 1000;
                                    Say(pc, 0, "次ハ10000ゴールドダ…。$R;", "死神");
                                    if (Select(pc, "10000G払う？", "", "払わない", "払う（10000ゴールド）") == 2)
                                    {
                                        if (pc.Gold >= 10000)
                                        {
                                            PlaySound(pc, 2040, false, 100, 50);

                                            Say(pc, 0, "10000ゴールド払った。$R;", "");
                                            pc.Gold -= 10000;
                                            Say(pc, 0, "…グヒャッヒャヒャ！$R;" +
                                            "$R本当に払いやがったゼ！！$R;" +
                                            "…オマエ、金持ちだナ…。$R;" +
                                            "$P…次で最後ダ$R;" +
                                            "$Pグヘヘッ…100000ゴールドダ…$R;", "死神");
                                            if (Select(pc, "100000G払う？", "", "払わない", "払う（100000ゴールド）") == 2)
                                            {
                                                Say(pc, 0, "グヒャッ！？$R;" +
                                                "$P本当にいいんだナ…？$R;" +
                                                "後悔しても知らないゾ……？$R;", "死神");
                                                if (Select(pc, "本当に100000G払う？", "", "払わない", "払う！（100000ゴールド）") == 2)
                                                {
                                                    Say(pc, 0, "…本当にいいんだナ…？$R;" +
                                                    "後で文句言うなヨ…？$R;", "死神");
                                                    if (Select(pc, "100000G払う？", "", "払わない！！", "払う！！（100000ゴールド）") == 2)
                                                    {
                                                        PlaySound(pc, 2040, false, 100, 50);

                                                        Say(pc, 0, "グヒャーヒャヒャ！$R;" +
                                                        "契約成立ダッ！$R;" +
                                                        "$Pグヒャヒャッ！$R;" +
                                                        "$R気分がイイゼ…！$R;" +
                                                        "俺様のトッテオキをくれてヤル！$R;", "");

                                                        Say(pc, 0, "…ぐへへッ…$R;" +
                                                        "……大事にしろよ…。$R;", "死神");
                                                        pc.Gold -= 100000;
                                                        Say(pc, 0, "(…声は聞こえなくなった。)$R;", "死神");
                                                        给东西(pc);
                                                    }
                                                    不给(pc);
                                                    return;
                                                }
                                                不给(pc);
                                                return;
                                            }
                                            不给(pc);
                                            return;
                                        }
                                    }
                                    不给(pc);
                                    return;
                                }

                            }
                            不给(pc);
                            return;
                        }
                    }
                    不给(pc);
                    return;
                }
            }
            不给(pc);
            return;

        }
        void 给东西(ActorPC pc)
        {
            BitMask<wsj> wsj_mask = new BitMask<wsj>(pc.CMask["wsj"]);
            //int selection;
            if (wsj_mask.Test(wsj.东西3))
            {
                if (SagaLib.Global.Random.Next(0, 99) < 50)
                {
                    GiveItem(pc, 10048552, 1);
                    return;
                }
                GiveItem(pc, 10048200, 1);
                return;
            }
            if (wsj_mask.Test(wsj.东西2))
            {
                wsj_mask.SetValue(wsj.东西3, true);
                GiveItem(pc, 60104660, 1);
                return;
            }
            if (wsj_mask.Test(wsj.东西))
            {
                wsj_mask.SetValue(wsj.东西2, true);
                GiveItem(pc, 50051750, 1);
                return;
            }
            GiveItem(pc, 50039650, 1);
            wsj_mask.SetValue(wsj.东西, true);
        }
        void 不给(ActorPC pc)
        {
            Say(pc, 0, "…グヒャ？$R;" +
            "…ちょっと高いカ…？$R;", "死神");

            Say(pc, 0, "…あーン…そうだナァ……。$R;" +
            "…赤くてまーるイ…$R;" +
            "果物を１つクレ…。$R;", "死神");
            if (Select(pc, "渡す？", "", "渡す", "渡さない") == 1)
            {
                Say(pc, 0, "……。$R;" +
                "$R…オゥ！それダそれダ！$R;", "死神");

                Say(pc, 0, "次ハ…$R;", "死神");

                Say(pc, 0, "…ダイダイ色の甘酸っぱーイ$R;" +
                "果物を1つクレ…。$R;", "死神");
                if (Select(pc, "渡す？", "", "渡す", "渡さない") == 1)
                {
                    Say(pc, 0, "……。$R;" +
                    "$R…ダイダイ色の甘酸っぱーイのドコ？$R;" +
                    "…残念ダ…残念……。$R;", "死神");
                    GiveItem(pc, 10002800, 1);
                    Say(pc, 0, "(…声は聞こえなくなった。)$R;", "");
                }
            }
        }
    }

}
