using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
//所在地圖:東方海角(10018003) NPC基本信息:貝利爾(11001428) X:136 Y:68
namespace SagaScript.M10018003
{
    public class S11001428 : Event
    {
        public S11001428()
        {
            this.EventID = 11001428;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            int selection;

            if (!Beginner_01_mask.Test(Beginner_01.已經與貝利爾進行第一次對話))
            {
                初次與貝利爾進行對話(pc);
            }
            else
            {
                Say(pc, 11001428, 131, "哦?$R;" +
                                       "$R有什么要问的吗?$R;", "贝利尔");
            }

            if (Beginner_01_mask.Test(Beginner_01.戰鬥教學開始) &&
                !Beginner_01_mask.Test(Beginner_01.戰鬥教學完成))
            {
                戰鬥教學(pc);
                return;
            }

            if (Beginner_01_mask.Test(Beginner_01.技能教學開始) &&
                !Beginner_01_mask.Test(Beginner_01.技能教學完成))
            {
                技能教學(pc);
                return;
            }

            selection = Select(pc, "想听哪个说明呢?", "", "「道具」使用方法", "「战斗」方法", "「技能」使用方法", "关于「奖励点数」", "没有想要问的");

            while (selection != 5)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11001428, 131, "说明道具的使用方法之前，$R;" +
                                               "先来看看基本操作吧!$R;", "贝利尔");

                        Say(pc, 11001428, 131, "「道具」、「技能」；「装备」$R;" +
                                               "视窗打开了吗?$R;" +
                                               "$R这三种都可以在主视窗做开关唷!$R;" +
                                               "$P跟我说话的时候，$R;" +
                                               "也可以一边操作，$R;" +
                                               "先练练吧!$R;" +
                                               "$P…$R;" +
                                               "$P不行?$R;" +
                                               "$P现在介绍$R;" +
                                               "「道具」和「装备」视窗吧!$R;" +
                                               "$P我要说明的是$R;" +
                                               "关于「装备」和「消耗道具」。$R;" +
                                               "$P「装备」是$R;" +
                                               "武器、防具、装饰品$R;" +
                                               "等道具$R;" +
                                               "$R想佩带这些时，$R;" +
                                               "只要双击道具就可以了。$R;" +
                                               "$P大部分的装备佩带后，$R;" +
                                               "外貌是会改变的!$R;" +
                                               "$R收集好看的装备，$R;" +
                                               "也是一件快乐的事情呀!$R;" +
                                               "$P要确认是否装置正确，$R;" +
                                               "打开「装备」视窗即可。$R;" +
                                               "$R自己佩带的装备$R;" +
                                               "一眼就可以看出来了。$R;" +
                                               "$P当需要道具详细说明时，$R;" +
                                               "对道具图示点击滑鼠右键。$R;" +
                                               "$R就可以确认，$R;" +
                                               "攻击/防御/道具装备时的效果等。$R;" +
                                               "$P下一个是「消耗道具」。$R;" +
                                               "$P消耗道具是$R;" +
                                               "为了得到某种效果而使用的道具。$R;" +
                                               "$R简单的说就是恢复道具啦!$R;" +
                                               "$P基本上，双击就可以使用啰。$R;" +
                                               "$R如果不能使用的话，$R;" +
                                               "可能是「材料道具」或「贵重物品」。$R;" +
                                               "$P有关于材料道具的消息，$R;" +
                                               "「道具精制师」很清楚的!$R;" +
                                               "$R他一直在「阿克罗波利斯」前，$R;" +
                                               "有时间就去找他吧!$R;", "贝利尔");
                        break;

                    case 2:
                        if (!Beginner_01_mask.Test(Beginner_01.已經與貝利爾進行過戰鬥教學))
                        {
                            Beginner_01_mask.SetValue(Beginner_01.已經與貝利爾進行過戰鬥教學, true);
                            Beginner_01_mask.SetValue(Beginner_01.戰鬥教學開始, true);

                            Say(pc, 11001428, 131, "透过实际作战，最容易了解了，$R;" +
                                                   "但要先告诉您一些注意事项!$R;" +
                                                   "主视窗的「HP」「MP」「SP」$R;" +
                                                   "这三个数值。$R;" +
                                                   "$P在战斗时一定要注意。$R;" +
                                                   "$P特别是HP值达到0，就死亡了。$R;" +
                                                   "$P使用「技能」，$R;" +
                                                   "「MP」值和「SP」值就会减少呀!$R;" +
                                                   "$R即使数值跌至0也没问题，$R;" +
                                                   "但是就不能有效地战斗啰。$R;" +
                                                   "$P战斗时要点击敌人，$R;" +
                                                   "$R那么就带着配剑，$R;" +
                                                   "跟「微型皮露露」打一仗吧!$R;" +
                                                   "$P您应该有配剑吧?$R;" +
                                                   "装备好后就出来练习吧!$R;" +
                                                   "$R只要在道具视窗双击配剑就可以装上。$R;" +
                                                   "$P对付这些傢伙不用费太多力气，$R;" +
                                                   "他们很弱，不是很强呀!$R;", "贝利尔");
                            return;
                        }
                        else
                        {
                            Say(pc, 11001428, 131, "还想听关于战斗吗? 现在做简单说明。$R;" +
                                                   "$P战斗时，要注意以下几点!$R;" +
                                                   "主视窗的「HP」「MP」「SP」$R;" +
                                                   "这三个数值。$R;" +
                                                   "$P战斗时一定要注意。$R;" +
                                                   "$P特别是HP值达到0，就死亡了。$R;" +
                                                   "$P使用「技能」，$R;" +
                                                   "「MP」值和「SP」值就会减少呀!$R;" +
                                                   "$R即使数值跌至0也没问题，$R;" +
                                                   "但是就不能有效地战斗啰。$R;" +
                                                   "$P先告诉您，$R;" +
                                                   "战斗中失去的HP值的恢复方法吧!$R;" +
                                                   "$R要恢复HP，可以使用道具，$R;" +
                                                   "也可以透过「坐下」来恢复。$R;" +
                                                   "$P只要点击「Insert」键就可以坐下。$R;" +
                                                   "$P若您再点击一次，$R;" +
                                                   "或做其他动作的话，就会自动解除。$R;" +
                                                   "$P还有，在城市里或在帐篷里，$R;" +
                                                   "会自动恢复喔!$R;" +
                                                   "$R既不用花钱又有效呀$!R;", "贝利尔");
                        }
                        break;

                    case 3:
                        if (!Beginner_01_mask.Test(Beginner_01.已經與貝利爾進行過技能教學))
                        {
                            Beginner_01_mask.SetValue(Beginner_01.已經與貝利爾進行過技能教學, true);

                            Say(pc, 11001428, 131, "那么现在为您解释「技能」吧!$R;" +
                                                   "$P「初心者」时，只能普通攻击。$R;" +
                                                   "$R转职后，才可以使用各种技能哦!$R;" +
                                                   "$P怎么样，想试试吗?$R;", "贝利尔");

                            switch (Select(pc, "想要试一下技能吗?", "", "想试试", "听说明就够了"))
                            {
                                case 1:
                                    Beginner_01_mask.SetValue(Beginner_01.技能教學開始, true);

                                    PlaySound(pc, 2040, false, 100, 50);
                                    GiveItem(pc, 20050006, 1);
                                    Say(pc, 0, 0, "取得了技能石『力量提升』$R;", " ");

                                    Say(pc, 11001428, 131, "刚才给您的叫技能石，$R;" +
                                                           "是只能使用一次技能的道具呀!$R;" +
                                                           "$P使用这石头就可以$R;" +
                                                           "体验「力量提升」的技能喔!$R;" +
                                                           "$R这是可以马上提高$R;" +
                                                           "原有潜在力的技能，$R;" +
                                                           "主要用於自己或队员。$R;" +
                                                           "$P使用这技能，$R;" +
                                                           "跟魔物打一架试试看吧!$R;", "贝利尔");
                                    return;

                                case 2:
                                    Say(pc, 11001428, 131, "技能指的是，$R;" +
                                                           "消耗SP值和MP值$R;" +
                                                           "来使用的「技术」和「魔法」唷!$R;", "贝利尔");

                                    Say(pc, 11001428, 131, "您现在可以打开「技能视窗」，$R;" +
                                                           "熟悉或使用技能。$R;" +
                                                           "$P想要知道效果，$R;" +
                                                           "可以点击「技能视窗」的图示进行确认。$R;" +
                                                           "还有，有一些技能，$R;" +
                                                           "不配戴特定装备，就不能使用唷!$R;" +
                                                           "$R学习技能前，先确认一下吧!$R;" +
                                                           "$P使用技能时，$R;" +
                                                           "一定要注意MP值跟SP值喔!$R;" +
                                                           "$P恢复方法和HP值一样，$R;" +
                                                           "可以坐着恢复，$R;" +
                                                           "也可以使用道具，$R;" +
                                                           "或者是在城市/帐篷里自动恢复唷!$R;", "贝利尔");
                                    break;
                            }
                        }
                        else
                        {
                            Say(pc, 11001428, 131, "想再听一遍吗?$R;" +
                                                   "$R第二次就不能试验道具啰。$R;" +
                                                   "那就做个简单的说明吧!$R;" +
                                                   "技能指的是，消耗SP值跟MP值，$R;" +
                                                   "来使用的「技术」和「魔法」唷!$R;", "贝利尔");

                            Say(pc, 11001428, 131, "您现在可以打开「技能视窗」，$R;" +
                                                   "熟悉或使用技能。$R;" +
                                                   "$P想要知道效果，$R;" +
                                                   "可以点击「技能视窗」的图示进行确认。$R;" +
                                                   "还有，有一些技能，$R;" +
                                                   "不配戴特定装备，就不能使用唷!$R;" +
                                                   "$R学习技能前，先确认一下吧!$R;" +
                                                   "$P使用技能时，$R;" +
                                                   "一定要注意MP值跟SP值喔!$R;" +
                                                   "$P恢复方法和HP值一样，$R;" +
                                                   "可以坐着恢复，$R;" +
                                                   "也可以使用道具，$R;" +
                                                   "或者是在城市/帐篷里自动恢复唷!$R;", "贝利尔");
                        }
                        break;

                    case 4:
                        Say(pc, 11001428, 131, "「奖励点数」是提高自己$R;" +
                                               "各种能力值的非常重要的点数唷!$R;" +
                                               "$P先暂时打开状态视窗吧!$R;" +
                                               "$P打开了吗?$R;" +
                                               "$P视窗右下方有个小的「+」键对吧?$R;" +
                                               "$R点击一下吧!$R;" +
                                               "$P在这里可以分配「奖励点数」。$R;" +
                                               "$R点一下闪烁的「△」，会提升数值，$R;" +
                                               "上升的数值就会变成蓝色。$R;" +
                                               "$P千万不要立刻点击 「确认」啊!$R;" +
                                               "$R点击「确认」后，$R;" +
                                               "就不能再修改了，$R;" +
                                               "所以要想清楚了再分配呀!$R;" +
                                               "$P想修改的话，请点击「取消」或$R;" +
                                               "「奖励点数」视窗旁边的「-」，$R;" +
                                               "就会回到开始状态唷!$R;" +
                                               "$P这个数值对将来影响很大，$R;" +
                                               "现在先不要分配吧!$R;" +
                                               "$P在升级的时候，$R;" +
                                               "您会自动获得「奖励点数」哦!$R;" +
                                               "$R不好好分配能力值，是不行的，$R;" +
                                               "现在还需要增强实力呢!$R;", "贝利尔");
                        break;
                }

                selection = Select(pc, "想听哪个说明呢?", "", "「道具」使用方法", "「战斗」方法", "「技能」使用方法", "关于「奖励点数」", "没有想要问的");
            }
            

            if (!Beginner_01_mask.Test(Beginner_01.貝利爾給予初心者緞帶))
            {
                貝利爾給予初心者緞帶(pc);
            }

            Say(pc, 11001428, 131, "下一个地图，玛莎会告诉您的。$R;" +
                                   "$P她是个埃米尔族的女孩，$R;" +
                                   "虽然有点麻烦呀!$R;" +
                                   "$R刚刚说的不要告诉玛莎喔!$R;" +
                                   "$R玛莎会告诉您有关$R;" +
                                   "「飞空庭」的消息的!$R;" +
                                   "$P顺着这条路一直往前走，$R;" +
                                   "她就在前面，$R;" +
                                   "一边走一边看着小地图就不会迷路的。$R;" +
                                   "$P哎呀，对了!$R;" +
                                   "$R路上遇到其他人，也跟他们聊聊吧!$R;" +
                                   "$R他们会告诉您这个世界的歷史，$R;" +
                                   "或系统之类的喔!$R;" +
                                   "$P要是走错路也不要担心。$R;" +
                                   "$R刚才，听路利耶说过吧?$R;" +
                                   "小地图的红点就表示NPC的位置。$R;" +
                                   "$P迷路时，$R;" +
                                   "往那个点走过去就可以了。$R;" +
                                   "$R那么加油吧!!$R;", "贝利尔");
        }

        void 初次與貝利爾進行對話(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            Beginner_01_mask.SetValue(Beginner_01.已經與貝利爾進行第一次對話, true);

            byte x, y;

            Say(pc, 11001428, 131, "很高兴第一次见到您，$R;" +
                                   "我叫贝利尔。$R;" +
                                   "$R从埃米尔那里受了委托，$R;" +
                                   "为刚来的人介绍各种事情哦!$R;" +
                                   "$P说来话长…$R;" +
                                   "没关系吗?$R;", "贝利尔");

            switch (Select(pc, "您要从哪开始听?", "", "我想要从头开始听!", "跳过战斗指导部分", "到指导的最后部分"))
            {
                case 1:
                    Say(pc, 11001428, 131, "好了吗? 那么开始吧!$R;" +
                                           "$R我只告诉您基本的概念，$R;" +
                                           "其他的您自己修炼吧!$R;", "贝利尔");
                    break;

                case 2:
                    Say(pc, 11001428, 131, "哦? 是吗?$R;" +
                                           "跟我没关系呢…$R;", "贝利尔");

                    switch (Select(pc, "要听说明吗?", "", "我想听喔", "到下一个阶段"))
                    {
                        case 1:
                            Say(pc, 11001428, 131, "好了吗? 那么开始吧!$R;" +
                                                   "$R我只告诉您基本的概念，$R;" +
                                                   "其他的您自己修炼吧!$R;", "贝利尔");
                            break;

                        case 2:
                            Say(pc, 11001428, 131, "是这样吗?$R;" +
                                                   "下一个地图，玛莎会告诉您的。$R;" +
                                                   "$P她是个埃米尔族的女孩，$R;" +
                                                   "虽然有点麻烦呀!$R;" +
                                                   "$R刚刚说的不要告诉玛莎喔!$R;" +
                                                   "$R玛莎会告诉您有关$R;" +
                                                   "「飞空庭」的消息呢!$R;" +
                                                   "$P顺着这条路一直往前走，$R;" +
                                                   "她就在前面，$R;" +
                                                   "一边走一边看着小地图就不会迷路的。$R;" +
                                                   "$P哎呀，对了!$R;" +
                                                   "$R路上遇到其他人，也跟他们聊聊吧!$R;" +
                                                   "$R他们会告诉您这个世界的历史，$R;" +
                                                   "或系统之类的喔!$R;" +
                                                   "$P要是走错路也不要担心。$R;" +
                                                   "$R刚才，听路利耶说过吧?$R;" +
                                                   "小地图的红点就表示NPC的位置。$R;" +
                                                   "$P迷路时，$R;" +
                                                   "往那个点走过去就可以了。$R;" +
                                                   "$R那么加油吧!!$R;", "贝利尔");
                            break;
                    }
                    break;

                case 3:
                    Say(pc, 11001428, 131, "是吗?$R;" +
                                           "我无所谓。$R;", "贝利尔");

                    switch (Select(pc, "要继续听说明吗?", "", "继续听", "放弃"))
                    {
                        case 1:
                            Say(pc, 11001428, 131, "好了吗? 那么开始吧!$R;" +
                                                   "$R我只告诉您基本的概念，$R;" +
                                                   "其他的您自己修炼吧!$R;", "贝利尔");
                            break;

                        case 2:
                            Say(pc, 11001428, 131, "我知道了$R;" +
                                                   "$R我就送您到「阿克罗波利斯」吧!$R;" +
                                                   "$P不会说我在赶您走吧?$R;" +
                                                   "$P提多在前面…$R;" +
                                                   "问他就可以了，$R;" +
                                                   "$R那么加油吧!$R;", "贝利尔");

                            x = (byte)Global.Random.Next(18, 29);
                            y = (byte)Global.Random.Next(124, 130);

                            Warp(pc, 10025001, x, y);
                            break;
                    }
                    break;
            }
        }     

        void 戰鬥教學(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            if (!Beginner_01_mask.Test(Beginner_01.HP恢復教學完成))
            {
                Beginner_01_mask.SetValue(Beginner_01.HP恢復教學完成, true);

                Say(pc, 11001428, 131, "大概知道是什么意思了吧?$R;" +
                                       "当您HP值下降，就吃这个吧!$R;", "贝利尔");

                PlaySound(pc, 2040, false, 100, 50);
                GiveItem(pc, 10006350, 1);
                Say(pc, 0, 0, "得到「熏肉」!$R;", " ");
            }
            else
            {
                Beginner_01_mask.SetValue(Beginner_01.戰鬥教學完成, true);

                Say(pc, 11001428, 131, "HP值恢复了吧?$R;" +
                                       "$R要恢复HP，可以使用道具，$R;" +
                                       "也可以透过「坐下」来恢复。$R;" +
                                       "$P只要点击「Insert」键就可以坐下。$R;" +
                                       "$P若您再点击一次，$R;" +
                                       "或做其他动作的话，就会自动解除。$R;" +
                                       "$P还有，在城市里或在帐篷里，$R;" +
                                       "会自动恢复喔!$R;" +
                                       "$R既不用花钱又有效呀!$R;", "贝利尔");
            }
        }

        void 技能教學(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            if (!Beginner_01_mask.Test(Beginner_01.得到第二顆技能石))
            {
                Beginner_01_mask.SetValue(Beginner_01.得到第二顆技能石, true);

                Say(pc, 11001428, 131, "怎么样?$R;" +
                                       "攻击力量是不是变强大了?$R;", "贝利尔");

                PlaySound(pc, 2040, false, 100, 50);
                GiveItem(pc, 20050005, 1);
                Say(pc, 0, 0, "取得了技能石『烈焰风暴』$R;", " ");

                Say(pc, 11001428, 131, "第二种技能是「烈焰风暴」喔!$R;" +
                                       "$R就是其中一种「魔法」技能，$R;" +
                                       "用来催化世界上存在的各种力量。$R;" +
                                       "$P选择魔法师系列的职业，$R;" +
                                       "就可以学到!$R;" +
                                       "$P使用方法是双击技能石，$R;" +
                                       "浮标就会变成魔杖形状，$R;" +
                                       "然后点击施放技能的地方。$R;" +
                                       "$R时间控制并不容易，$R;" +
                                       "但还是试试吧!$R;", "贝利尔");
                return;
            }

            if (!Beginner_01_mask.Test(Beginner_01.得到第三顆技能石))
            {
                Beginner_01_mask.SetValue(Beginner_01.得到第三顆技能石, true);

                Say(pc, 11001428, 131, "怎么样? 使用华丽的技能，$R;" +
                                       "很爽吧?$R;", "贝利尔");

                PlaySound(pc, 2040, false, 100, 50);
                GiveItem(pc, 20050001, 1);
                Say(pc, 0, 0, "取得了技能石『旋风剑』$R;", " ");

                Say(pc, 11001428, 131, "第三种技能是「旋风剑」喔!$R;" +
                                       "$P使用这个技能，$R;" +
                                       "会给魔物非常强烈的打击呀!$R;" +
                                       "$R这种叫「技术」的技能，$R;" +
                                       "主要是给战士系列职业学的技能!$R;" +
                                       "$P这种技能需要透过剑来施放。$R;" +
                                       "$R没有剑的人就不能使用，要注意哦!$R;" +
                                       "$P需要详细说明时，$R;" +
                                       "就在技能图示点击右键吧!$R;" +
                                       "$R使用条件以及效果都有详细说明。$R;" +
                                       "$P被敌人包围时，$R;" +
                                       "使用这种技能非常有效呀!$R;" +
                                       "$R试一下吧!$R;", "贝利尔");
                return;
            }
            else
            {
                Beginner_01_mask.SetValue(Beginner_01.技能教學完成, true);

                Say(pc, 11001428, 131, "有没有喜欢的技能呢?$R;" +
                                       "试验技能已经完毕啰。$R;" +
                                       "$P各职业使用技能，$R;" +
                                       "都会消耗MP值和SP值喔!$R;" +
                                       "$R所以不仅HP值，$R;" +
                                       "同时也要留意MP值跟SP值呀!$R;" +
                                       "$P恢复方法和HP值一样，$R;" +
                                       "可以坐着恢复，也可以使用道具，$R;" +
                                       "也可以在城市或帐篷里自动恢复哦!$R;", "贝利尔");
            }
        }

        void 貝利爾給予初心者緞帶(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            Beginner_01_mask.SetValue(Beginner_01.貝利爾給予初心者緞帶, true);

            Say(pc, 11001428, 131, "基本的概念，$R;" +
                                   "现在大概清楚了吧?$R;" +
                                   "$P对了，还有这个给您…$R;", "贝利尔");

            PlaySound(pc, 2040, false, 100, 50);
            GiveItem(pc, 50053600, 1);
            Say(pc, 0, 0, "得到『初心者缎带』!$R;", " ");

            Say(pc, 11001428, 131, "给您的『初心者缎带』，$R;" +
                                   "看名称就知道是初心者用的装备。$R;" +
                                   "$R装备『初心者缎带』时，$R;" +
                                   "只要双击道具就可以了，$R;" +
                                   "以后再带吧!$R;" +
                                   "$P只要带着这个，$R;" +
                                   "别人一定会帮忙的唷!$R;" +
                                   "$P…对了，$R;" +
                                   "$P等您成长强大后。$R;" +
                                   "看到有其他人带着它，$R;" +
                                   "就可以知道那人需要帮忙了喔!$R;" +
                                   "$R到时去帮帮他吧，$R;" +
                                   "刚开始冒险的初心者，$R;" +
                                   "心中总有点不安吧?$R;", "贝利尔");
        }  
    }
}
