using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript.M50012000
{
    public class S11001207 : Event
    {
        public S11001207()
        {
            this.EventID = 11001207;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<LV75_Clothes> LV75_Clothes_mask = pc.CMask["LV75_Clothes"];

            Say(pc, 131, "这是！？$R;" +
                "您用赐给您的火凤凰在干什么！？$R;");
            Say(pc, 11001206, 131, "字体好像很大喔！$R;" +
                "得基利！$R;" +
                "$P……为什么到这里来呀?$R;");
            Say(pc, 131, "先回答我的问题吧！$R;");
            Say(pc, 11001206, 131, "哈哈！是！$R;" +
                "是恶娃阿……$R;" +
                "$R有很多种……$R;");
            Say(pc, 131, "回答是遐奇！$R;");
            Say(pc, 11001206, 131, "嗯！$R;" +
                "$R看过火凤凰的实力了吗？$R;" +
                "在跟比较强的冒险者战斗吧！$R;");
            Say(pc, 131, "$R看过火凤凰的实力？还有呢？$R;");
            Say(pc, 11001206, 131, "两……$R;" +
                "不会太强求吗？$R;" +
                "$R这火焰能燃烧天空阿$R;" +
                "所以…6公主她们……$R;" +
                "想跟妹妹们炫耀呀$R;" +
                "$P但是平时一样要像酷酷…$R;" +
                "看起来一点都不强阿$R;" +
                "$R跟比较强的敌人战斗$R;" +
                "应该让对方看看本性的……$R;");
            Say(pc, 131, "只是！$R;" +
                "$R像您这样不济的人，$R;" +
                "也可以出冒险者传记吗？$R;");
            Say(pc, 11001206, 131, "呜呜……$R;");
            Say(pc, 131, "这火凤凰是我们一族的守护神哦$R;" +
                "$R当您身体遇到危险的时候$R;" +
                "就会把那股力量解放！$R;" +
                "$P把那个，作为自己的兴趣$R;" +
                "打的话都是白打！$R;" +
                "$P加米加米加米加米……$R;");
            Say(pc, 11001206, 131, "红豆蘸料，红豆蘸料！$R;" +
                "对不起喔！$R;");
            Say(pc, 131, "加米加米，加米加米……$R;" +
                "加米加米，加米加米……$R;" +
                "$P……$R;");
            Say(pc, 0, 131, "一段时间后……$R;", "");

            Say(pc, 131, "在冒险者传记，加上您的名字吧！$R;" +
                pc.Name + " 是您的名字吧？……$R;");

            Say(pc, 131, pc.Name + "传$R;" +
                "给我们的孙子带来的麻烦$R;" +
                "真是对不起呢$R;" +
                "$P从现在开始，要充分的注意阿$R;" +
                "一定要原谅(许可)唷……$R;" +
                "$R喂，您也是呀！$R;");
            Say(pc, 11001206, 131, "对不起，冒险者传记$R;");
            Say(pc, 131, "那为什么没有把火凤凰打倒阿?$R;");
            switch (Select(pc, "为什么没有把火凤凰打倒呢?", "", "因为这好像是个陷阱呢……", "看见牠守护孩子的样子……", "不知道牠在哪裡……"))
            {
                case 1:
                    Say(pc, 131, "真是慎重的性格阿！$R;" +
                        "$R真得非常优秀！$R;" +
                        "冒险者不这样的话不行喔$R;");
                    break;
                case 2:
                    Say(pc, 131, "看见牠守护孩子的样子$R;" +
                        "就不忍心把牠打倒阿$R;" +
                        "$R真得非常优秀！$R;" +
                        "怎样看都是个善良的人唷！$R;");
                    break;
                case 3:
                    Say(pc, 131, "那敏锐的灵感！$R;" +
                        "$R真得非常优秀！$R;" +
                        "是一开始就拥有的才能吧！$R;");
                    break;
            }
            Say(pc, 131, "的仙姬美$R;" +
                "这位是传授我们一族秘笈的$R;" +
                "合适人选吗？$R;");
            Say(pc, 11001206, 131, "阿…那个，那样的话$R;" +
                "看起来也好像是呀！！$R;" +
                "$R又强悍又善良$R;" +
                "而且外型也不错呢！$R;");
            Say(pc, 131, "脸……圆圆的吧……$R;" +
                "$R也好$R;" +
                "不是偶然的喔！优秀的冒险者传记，$R;" +
                "找得好呢！$R;");

            Say(pc, 131, pc.Name + "殿。$R;" +
                "$R我们是从古代就开始制作盔甲的$R;" +
                "防具商店唷$R;" +
                "$P这是我们为了努力跟魔物战斗$R;" +
                "的冒险者们，诚心诚意制作的喔$R;" +
                "$P不仅高防御且容易使用$R;" +
                "$R是质量非常好的防具呀，$R使用者的评语也非常好喔$R;" +
                "不知不觉被称为传説的技工呢$R;" +
                "$P我们知名度的提升$R;" +
                "市场价值也会提升呀$R;" +
                "$R在队头排队购买防具的部分富翁$R;" +
                "都是滥购的$R;" +
                "$P而且把那些防具放在家裡只是装饰$R;" +
                "没有实际上的用途的话$R;" +
                "$R真是太不像样了！$R;" +
                "$P所以我们只卖给真正需要的人$R;" +
                "要找出冒险者，直接卖给他们唷$R;");
            Say(pc, 11001206, 131, "那是代代相传，女性的职责喔$R;" +
                "$R夜是为我们草$R;" +
                "找出优秀的冒险者唷$R;");
            Say(pc, 131, "一定要好好使用$R;" +
                "才可以收下我们的防具喔$R;");
            Say(pc, 11001206, 131, "草员向仓库那边托付了$R;" +
                "因为要做防具$R;" +
                "先回到阿高普路斯吧$R;");
            Say(pc, 131, "这是仙姬美！$R;" +
                "讲道还没结束吧？$R;" +
                "$R请在那边坐好吧！$R;");
            Say(pc, 131, "嗯！好像很大呢！$R;");
            Say(pc, 11001206, 131, "加米加米加米加米……$R;");
            Say(pc, 131, "(先回到阿克罗波利斯吧！)$R;");
            LV75_Clothes_mask.SetValue(LV75_Clothes.任務完成, true);
            Warp(pc, 10023000, 95, 165);
            //_0c89 = true;
            //WARP 1339
            //EVENTEND

        }
    }
}