using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M30157000
{
    public class S11001070 : Event
    {
        public S11001070()
        {
            this.EventID = 11001070;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 0, 131, "咇咇咇咇！咇咇咇~~~！$R;", "通信机");
            Say(pc, 255, "代表先生$R;" +
                "$R警备机器人来电话了。$R;");
            Say(pc, 11001052, 131, "接一下$R;");
            Say(pc, 0, 131, "咇咇咇咇！咇咇咇~~~！$R;" +
                "$P这里是警备机器人$R;" +
                "发现行会评议会通缉的犯人$R;" +
                "$R我们要开始追击了$R;", "通信机");
            Say(pc, 11001052, 131, "嗯$R;");
            Say(pc, 0, 131, "进入偏僻住宅街的民家了。$R;", "通信机");
            Say(pc, 11001052, 131, "家里的情况怎么样？$R;");
            Say(pc, 0, 131, "我们需要小型侦察机器人呀。$R;" +
                "$P……$R;" +
                "$P啊，回来了$R;" +
                "嗯…不…不$R;", "通信机");
            Say(pc, 11001052, 131, "怎么了，快点说$R;");
            Say(pc, 0, 131, "看样子要把小狗$R广场的小狗卖到国外去。$R;", "通信机");
            Say(pc, 11001052, 131, "什么？$R;" +
                "马上逮捕。$R;");
            Say(pc, 0, 131, "知道了$R;" +
                "$P轰！轰！轰！$R;" +
                "$P警备机器人，把手举起来。$R;" +
                "$P什么呀，这是？$R;" +
                "$R被发现了，没办法，$R;" +
                "全消灭掉$R;" +
                "$P轰！轰！$R;" +
                "$P啪！轰！$R;" +
                "$P啪！啪！啪！$R;" +
                "$R哇，太强大了$R;" +
                "投降！！投降！！$R;" +
                "$P代表，已经逮捕了犯人$R;" +
                "小狗安然无恙。$R;", "通信机");
            Say(pc, 11001052, 131, "哦，警备机器人$R;" +
                "做的太棒了$R;" +
                "大家鼓掌吧$R;");
            Say(pc, 255, "拍拍拍拍……$R;");
            Say(pc, 11001052, 131, "守住了唐卡市的和平$R;" +
                "但我们不可以松懈呀$R;" +
                "为了防止事件发生，$R;" +
                "为了唐卡市的和平，$R;" +
                "我们马上恢复警备工作。$R;" +
                "燃烧起来吧，警备机器人。$R;");
            Say(pc, 0, 131, "知道了$R;", "通信机");
            Say(pc, 255, "以上，报告结束。$R;");
        }
    }
}