using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;
//所在地圖:奧克魯尼亞東部平原(10025001) NPC基本信息:初心者告示板(12001065) X:104 Y:120
namespace SagaScript.M10025001
{
    public class S12001065 : Event
    {
        public S12001065()
        {
            this.EventID = 12001065;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 11001118, 131, "… 咳咳$R;" +
                                   "$R您好! 我是实菲。$R;" +
                                   "是这告示板的妖精喔!$R;" +
                                   "$R关於告示板的情报，我来说明吧!$R;", "告示板 妖精");

            switch (Select(pc, "说明…", "", "我要听", "不听"))
            {
                case 1:
                    Say(pc, 11001118, 131, "告示板是…$R;" +
                                           "$R可以自由地交换情报、招募队五、$R;" +
                                           "军团成员等，各种内容的地方。$R;" +
                                           "$P有些地方，留言要付钱的呀!$R;" +
                                           "但大部分都是免费的。$R;" +
                                           "$R到处都有告示版喔!$R;" +
                                           "发现的话，好好查看一下吧。$R;" +
                                           "$P要用滑鼠右键点击自己才能看到$R;" +
                                           "的招募广告不一样，$R;" +
                                           "即使您登出后，告示依然会保留。$R;" +
                                           "$R想长时间宣传的时候，$R;" +
                                           "使用告示板比较方便哦!$R;" +
                                           "$P特别在「阿克罗尼亚东部平原」$R;" +
                                           "学校前面设置的告示板，$R;" +
                                           "叫做「初心者告示板」。$R;" +
                                           "是老队员和冒险家前辈们，$R;" +
                                           "为了帮初心者解决疑问，$R;" +
                                           "而设立的告示板。$R;" +
                                           "$P有不知道的事情，$R;" +
                                           "可以在这个告示板上提问。$R;" +
                                           "$R我的说明到此结束了，$R;" +
                                           "详细的使用方法，$R;" +
                                           "等到真的要留讯息时，再告诉您吧!$R;" +
                                           "$R下次再见吧!!$R;", "告示板 妖精");
                    break;

                case 2:
                    break;
            }
        }
    }
}
