using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
//所在地圖:奧克魯尼亞東部平原(10025001) NPC基本信息:要憑依的女孩(11000944) X:177 Y:105
namespace SagaScript.M10025001
{
    public class S11000944 : Event
    {
        public S11000944()
        {
            this.EventID = 11000944;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Beginner_02> Beginner_02_mask = new BitMask<Beginner_02>(pc.CMask["Beginner_02"]);

            int selection;

            if (!Beginner_02_mask.Test(Beginner_02.已經與要憑依的女孩進行第一次對話))
            {
                初次與要憑依的女孩進行對話(pc);
            }
            else
            {
                Say(pc, 11000944, 131, "要再说一遍吗?$R;", "要凭依的女孩");
            }

            selection = Select(pc, "想问有关凭依的消息吗?", "", "关于凭依系统", "有什么优点", "凭依时的注意事项", "凭依后可以和不可以做的事情", "登出的话该怎么办", "没什么想问的");

            while (selection != 6)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11000944, 131, "所谓的「凭依」是指灵魂和身体脱离后，$R;" +
                                               "灵魂附着在武器或防具或饰品的意思。$R;" +
                                               "$R在那个状态下，$R;" +
                                               "只要有人佩带或穿上那件装备的话，$R;" +
                                               "就会一起行动了喔!$R;" +
                                               "$P对自己点击滑鼠右键后，$R;" +
                                               "选择「凭依自己」，$R;" +
                                               "或者用滑鼠右键点击对像，$R;" +
                                               "选择「凭依别人」，$R;" +
                                               "就可以了。$R;" +
                                               "$P直接凭依在对方或自己的装备上时，$R;" +
                                               "效果是一样的哦。$R;" +
                                               "$P可以凭依的装备种类有，$R;" +
                                               "「上衣」「右手」「左手」$R;" +
                                               "以及「胸部饰品」这4个地方。$R;" +
                                               "$P凭依装备在装备视窗里顏色不一样，$R;" +
                                               "所以一眼就能看出来呀!$R;" +
                                               "$P一个人身上最多只可以凭依3个人。$R;" +
                                               "$R所以看起来虽然是一个人，$R;" +
                                               "但实际上有可能是4个人呢!$R;", "要凭依的女孩");
                        break;

                    case 2:
                        Say(pc, 11000944, 131, "凭依的人…$R;" +
                                               "就是指凭依的对象，$R;" +
                                               "打败魔物得到经验值的话。$R;" +
                                               "$R凭依的人就可获得「凭依经验值」哦!$R;" +
                                               "$P但如果是像花、草之类的「材料魔物」，$R;" +
                                               "是无法得到经验值的呀…$R;" +
                                               "$R所以也无法获得「凭依经验值」。$R;" +
                                               "$P想升级的话，$R;" +
                                               "不应该打「材料魔物」，$R;" +
                                               "而应该打其他经验值高的魔物啊!$R;", "要凭依的女孩");

                        Say(pc, 11000945, 131, "还有凭依时，$R;" +
                                               "凭依的人的HP值/MP值/SP值，$R;" +
                                               "会自然恢复的呀!$R;" +
                                               "$R所以使用魔法时，凭依会更有利唷!$R;" +
                                               "$P而且有凭依的装备是不会损坏的!$R;" +
                                               "$R面对强大敌人时，$R;" +
                                               "这一点不是更有利吗?$R;", "凭依对象女孩");
                        break;

                    case 3:
                        Say(pc, 11000944, 131, "如果凭依对象和凭依者的$R;" +
                                               "等级相差太多的话，$R;" +
                                               "是无法进行凭依的呢!$R;" +
                                               "$R所以在凭依前，$R;" +
                                               "最好先确认一下对方的等级。$R;" +
                                               "$P还有…$R;" +
                                               "$R即使凭依了也不能算绝对安全，$R;" +
                                               "因为凭依的地方不同，$R;" +
                                               "受到伤害的情况，也会有所不同呀!$R;" +
                                               "$P凭依在HP值低的人身上时，$R;" +
                                               "要多注意!$R;" +
                                               "$P还有凭依的人，使用魔法或技能时，$R;" +
                                               "MP值/SP值的消耗量会增加的。$R;" +
                                               "$P如果只能自然恢复的话，$R;" +
                                               "过分使用的时候，就会很浪费的。$R;", "要凭依的女孩");
                        break;

                    case 4:
                        Say(pc, 11000944, 131, "就算是凭依中也可以使用道具哦!$R;" +
                                               "$R使用的道具效果，$R;" +
                                               "会生效在凭依对象上的。$R;" +
                                               "$P也就是凭依者使用恢复药物的话，$R;" +
                                               "恢复的会是凭依对象喔!$R;" +
                                               "$R使用魔法时，$R;" +
                                               "同样凭依者是不会恢复的。$R;" +
                                               "$P但有一些技能，凭依期间是无法使用的呀!$R;" +
                                               "$R所以使用前先确认一下$R;" +
                                               "技能说明比较好呢!$R;" +
                                               "$P还有凭依中是无法捡道具的，$R;" +
                                               "也不能跟NPC说话喔!$R;" +
                                               "$R想对话的时候得先把凭依解除啊!$R;", "要凭依的女孩");
                        break;

                    case 5:
                        Say(pc, 11000944, 131, "在凭依成装备的状态下登出的话，$R;" +
                                               "装备也不会消失的喔!$R;" +
                                               "$P比如说，$R;" +
                                               "凭依在自己装备后，再登出的话。$R;" +
                                               "$R虽然无法亲眼看到，$R;" +
                                               "但是凭依的装备，$R;" +
                                               "会暂时留在原来的地方唷!$R;" +
                                               "$P假设有谁使用那装备的话，$R;" +
                                               "凭依装备还是会留在游戏里的。$R;" +
                                               "$R如果没有人使用那凭依装备的话，$R;" +
                                               "过一段时间就会在游戏中消失。$R;" +
                                               "$P就算有人使用$R;" +
                                               "那装备也不会成为别人的东西，$R;" +
                                               "所以您大可放心。$R;" +
                                               "$R下次再登入的时候，$R;" +
                                               "那凭依道具会再次回到身上的。$R;" +
                                               "$P还有登出的时候，$R;" +
                                               "凭依的武器或者是您，$R;" +
                                               "都不会受到伤害的。$R;" +
                                               "$R所以不用担心别人使用您的装备呀!$R;", "要凭依的女孩");
                        break;
                }

                selection = Select(pc, "想问有关凭依的消息吗?", "", "关于凭依系统", "有什么优点", "凭依时的注意事项", "凭依后可以和不可以做的事情", "登出的话该怎么办", "没什么想问的");
            }
        }

        void 初次與要憑依的女孩進行對話(ActorPC pc)
        {
            BitMask<Beginner_02> Beginner_02_mask = new BitMask<Beginner_02>(pc.CMask["Beginner_02"]);

            Beginner_02_mask.SetValue(Beginner_02.已經與要憑依的女孩進行第一次對話, true);

            Say(pc, 11000944, 131, "那就开始凭依了，千万不要动啊!$R;", "要凭依的女孩");

            Say(pc, 11000945, 131, "知道了!$R;", "凭依对象女孩");

            Say(pc, 11000944, 131, "…??$R;" +
                                   "$R哎呀? 已经有人进去了?$R;" +
                                   "不能凭依啊?$R;", "要凭依的女孩");

            Say(pc, 11000945, 131, "…啊! 对不起、对不起!$R;" +
                                   "$R可能是因为这个项链吧!$R;" +
                                   "那是别人凭依的凭依装备。$R;" +
                                   "$P是我在路上捡到的! 漂亮吧?$R;", "凭依对象女孩");

            ShowEffect(pc, 11000944, 4506);
            Wait(pc, 660);

            Say(pc, 11000944, 131, "应该早点说嘛?!$R;" +
                                   "$R…您好!$R;" +
                                   "有什么要问的吗?$R;", "要凭依的女孩");
        }   
    }
}
