using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;
//所在地圖:奧克魯尼亞東部平原(10025001) NPC基本信息:魔法師前輩(11000950) X:151 Y:132
namespace SagaScript.M10025001
{
    public class S11000950 : Event
    {
        public S11000950()
        {
            this.EventID = 11000950;
        }

        public override void OnEvent(ActorPC pc)
        {
            int selection;

            Say(pc, 11000950, 131, "啊! 是初心者啊?$R;" +
                                   "要问我们什么吗?$R;", "魔法师前辈");

            switch (Select(pc, "想问关于魔法系的消息吗?", "", "好啊", "不用了"))
            {
                case 1:
                    selection = Select(pc, "想听哪种的说明呢?", "", "魔法系的特征", "「魔法师」是?", "「精灵使」是?", "「祭司」是?", "「暗术使」是?", "不用了");

                    while (selection != 6)
                    {
                        switch (selection)
                        {
                            case 1:
                                Say(pc, 11000950, 131, "那我开始说明吧!$R;" +
                                                       "$P魔法系是使用魔法技能的职业喔。$R;" +
                                                       "$R攻击/补助/恢复/重生…$R;" +
                                                       "不同的职业，使用的魔法也不一样。$R;" +
                                                       "$P虽然有几个职业$R;" +
                                                       "可以得到贵重的「知识技能」，$R;" +
                                                       "但是相对的采集能力并不怎么高呀!$R;" +
                                                       "$R可以搬运的行李数量也不多，$R;" +
                                                       "所以跟同伴一起行动比较好。$R;", "魔法师前辈");
                                break;

                            case 2:
                                Say(pc, 11000950, 131, "由我来介绍「魔法师」吧!$R;" +
                                                       "$P「魔法师」可以使用叫做$R;" +
                                                       "「新生魔法」的无属性魔法喔!$R;" +
                                                       "$P因为不受属性的影响，$R;" +
                                                       "因此不论在哪，都可以发挥稳定的威力。$R;" +
                                                       "$P使用异常状态捉弄敌人，$R;" +
                                                       "或支援同伴的技能也有很多。$R;" +
                                                       "$R制作小分身的 「魔法师的残象」，$R;" +
                                                       "不仅是看起来有趣，$R;" +
                                                       "而且用起来也很方便的技能哦!$R;", "魔法师前辈");
                                break;

                            case 3:
                                Say(pc, 11000951, 0, "由我来介绍「精灵使」吧!$R;" +
                                                     "$P「精灵使」是使用$R;" +
                                                     "$R火/水/风/土的四种属性魔法喔!$R;" +
                                                     "$R光属性魔法是「祭司」专用的，$R;" +
                                                     "而暗属性魔法是「暗术使」专用的。$R;" +
                                                     "$P元素使可以学到赋予属性的支援技能，$R;" +
                                                     "可以让我方成员实力增强哦!$R;" +
                                                     "$P施放四种属性的范围魔法，$R;" +
                                                     "真的很痛快呀!$R;", "元素使前辈");
                                break;

                            case 4:
                                Say(pc, 11000952, 0, "由我来介绍「祭司」吧!$R;" +
                                                     "$P「祭司」是光属性的独特职业喔!$R;" +
                                                     "$P主要学习恢复/支援系的技能唷!$R;" +
                                                     "$P单独战斗的话，会有点困难呀，$R;" +
                                                     "所以主要担任治疗同伴的角色。$R;" +
                                                     "$R拥有很多能解除状态异常的魔法，$R;" +
                                                     "即使队伍里只有一个祭司也没问题。$R;", "祭师前辈");
                                break;

                            case 5:
                                Say(pc, 11000953, 131, "由我来介绍「暗术使」吧!$R;" +
                                                       "$P「暗术使」是暗属性的独特职业。$R;" +
                                                       "$R是魔法系中唯一可以使用防御技能的，$R;" +
                                                       "暗术使能熟练地使用短剑和锤矛，$R;" +
                                                       "即使在近距离，$R;" +
                                                       "也可以使用高级魔法的魔法使用者。$R;", "暗术使前辈");
                                break;
                        }

                        selection = Select(pc, "想听哪种的说明呢?", "", "魔法系的特征", "「魔法师」是?", "「精灵使」是?", "「祭司」是?", "「暗术使」是?", "不用了");
                    }
                    break;
                    
                case 2:
                    break;
            }
        }
    }
}
