using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M10035000
{
    public class S11000800 : Event
    {
        public S11000800()
        {
            this.EventID = 11000800;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<NDFlags> ND_mask = pc.CMask["ND"];
            BitMask<Degura> Degura_mask = pc.CMask["Degura"];
            BitMask<Neko_04> Neko_04_amask = pc.AMask["Neko_04"];
            BitMask<Neko_04> Neko_04_cmask = pc.CMask["Neko_04"];
            BitMask<Neko_06> Neko_06_amask = pc.AMask["Neko_06"];
            BitMask<Neko_06> Neko_06_cmask = pc.CMask["Neko_06"];

            if (Neko_06_amask.Test(Neko_06.杏子任务开始) &&
                !Neko_06_amask.Test(Neko_06.获得杏子) &&
                Neko_04_amask.Test(Neko_04.任務結束) &&
                Neko_06_cmask.Test(Neko_06.獲知恢復的方法) &&
                !Neko_06_cmask.Test(Neko_06.獲得山吹的碎片))
            {

                Wait(pc, 990);
                ShowEffect(pc, 5058);
                Wait(pc, 990);
                ShowEffect(pc, 5179);
                Wait(pc, 1980);

                Say(pc, 0, 131, "（……あっ！$R;" +
                "$Rなんだか懐かしい気配がする…？！$R;" +
                "$Rこの気配は………山吹！！）$R;", " ");

                Say(pc, 0, 131, "にゃお〜〜〜ん！$R;", " ");
                Wait(pc, 990);
                PlaySound(pc, 4012, false, 100, 50);
                ShowEffect(pc, 4131);
                Wait(pc, 5940);

                Say(pc, 0, 131, "『背負い魔・ネコマタ（山吹）』$Rの心を取り戻した！$R;", " ");

                Say(pc, 0, 131, "お姉ちゃん！$R;", "ネコマタ（杏）");

                Say(pc, 0, 131, "杏！？$R;" +
                "$Rあれ？…ウチ…$R;" +
                "$Rなんでこんなとこおるん……？$R;" +
                "$R…うわっ！汗拭きっ！？$R;", "ネコマタ（山吹）");

                Say(pc, 0, 131, "（ほっ…$Rやっぱりここだった…よかった。）$R;", " ");
                Neko_06_cmask.SetValue(Neko_06.獲得山吹的碎片, true);
                return;
            }

            if (Neko_04_amask.Test(Neko_04.任務開始) && 
                !Neko_04_amask.Test(Neko_04.任務結束) &&
                Neko_04_cmask.Test(Neko_04.返回彙報結果) &&
                Neko_04_cmask.Test(Neko_04.超重))
            {
                if (CheckInventory(pc, 10017905, 1))
                {
                    GiveItem(pc, 10017905, 1);
                    Neko_04_amask.SetValue(Neko_04.任務結束, true);
                    if (Neko_04_cmask.Test(Neko_04.超重))
                    {
                        Neko_04_cmask.SetValue(Neko_04.超重, false);
                        PlaySound(pc, 2040, false, 100, 50);
                        Say(pc, 11000800, 131, "想要收下這黃色的布，得努力呀$R;");
                        return;
                    }
                    return;
                }
                Neko_04_cmask.SetValue(Neko_04.超重, true);
                Say(pc, 11000800, 131, "哈哈！$R那黃色的布不就是我的汗巾嗎？$R;" +
                    "$R什麼？想要？$R您幫了我大忙，$R所以您要什麼都可以給您唷$R;" +
                    "$P不過您的行李太多了，$R好像無法收下呀$R;" +
                    "$R我先幫您拿著$R您去把行李減少後再來吧$R;");
                return;
            }
            if (Neko_04_amask.Test(Neko_04.任務開始) &&
                !Neko_04_amask.Test(Neko_04.任務結束) &&
                Neko_04_cmask.Test(Neko_04.交回不明部品) &&
                !Neko_04_cmask.Test(Neko_04.返回彙報結果) &&
                pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.PET))
            {
                if (pc.Inventory.Equipments[EnumEquipSlot.PET].ItemID == 10017900)
                {
                    Neko_04_cmask.SetValue(Neko_04.返回彙報結果, true);
                    Say(pc, 11000800, 131, "哦！找到那個零件後$R送到行會主人那是嗎？$R;" +
                        "$R辛苦了！謝謝！$R;" +
                        "$P不過，那個犯人是哪個傢伙呢？$R;" +
                        "$P…$R;" +
                        "$P…傷$R;" +
                        "$R從阿高普路斯城建成以來$R行會宮殿5樓就是一種治外法權$R;" +
                        "$P即使是評議會也沒有權利干涉呢$R;" +
                        "$R不能看到的，也不能聽到的$R;" +
                        "$P不過…$R從行會宮殿謎語團的房間裡$R發現動靜的事情在$R我知道的事情中是第一次$R;" +
                        "$R…有種不祥的…預感呀$R;");
                    Say(pc, 0, 131, "…桃子！$R;", "\"凱堤（山吹）\"");
                    Say(pc, 0, 131, "叫我嗎？有什麼事呢？$R您看起來好像很消沉唷$R;", "\"凱堤（桃）\"");
                    Say(pc, 0, 131, "我要回到商人叔叔那裡了$R;", "\"凱堤（山吹）\"");
                    Say(pc, 0, 131, "什麼？為什麼?$R怎麼那麼突然阿$R;", "\"凱堤（桃）\"");
                    Say(pc, 0, 131, "我明白了，這人就是桃子你的主人$R;" +
                        "$R雖然…無法用語言來表達，$R但把他想成屬於誰的是不對的呀$R;" +
                        "$P我無法理解$R桃子你對主人的那份感情$R;", "\"凱堤（山吹）\"");
                    Say(pc, 0, 131, "嗯…！$R好不容易在一起卻…$R;" +
                        "$R一個人會孤獨的，$R跟我一起好嗎…$R;" +
                        "$P對了！$R;" +
                        "$R剛才見到了裁縫阿姨…$R…見到姐姐了是吧？$R;" +
                        "$P附在『裁縫阿姨的三角巾』$R那裡就可以了！$R我也是用這種方式$R跟著現在的主人…$R;" +
                        "$R…什麼？$R;" +
                        "$P哎喲！已經得到『三角巾』了？$R;" +
                        "$R真的…山吹…不要叫阿姨啊…$R;", "\"凱堤（桃）\"");
                    if (CountItem(pc, 10017902) >= 1 && CountItem(pc, 10017903) >= 1)
                    {
                        Say(pc, 0, 131, "不想分開呀…$R;", "\"凱堤（緑）\"");
                        Say(pc, 0, 131, "…我也不想分開…$R;", "\"凱堤（藍）\"");
                        Say(pc, 0, 131, "…桃子還有你們大家$R真的謝謝你們，$R我不會忘記的$R;" +
                            "\"$R即使分開了，我們還是姐妹唷\"$R;", "\"凱堤（山吹）\"");
                        Say(pc, 0, 131, "山吹！！！$R;", "\"凱堤（桃）\"");
                    }
                    else if (CountItem(pc, 10017902) >= 1)
                    {
                        Say(pc, 0, 131, "不想分開呀…$R;", "\"凱堤（緑）\"");
                        Say(pc, 0, 131, "…桃子還有你們大家$R真的謝謝你們，$R我不會忘記的$R;" +
                            "\"$R即使分開了，我們還是姐妹唷\"$R;", "\"凱堤（山吹）\"");
                        Say(pc, 0, 131, "山吹！！！$R;", "\"凱堤（桃）\"");
                    }
                    else if (CountItem(pc, 10017903) >= 1)
                    {
                        Say(pc, 0, 131, "…我也不想分開…$R;", "\"凱堤（藍）\"");
                        Say(pc, 0, 131, "…桃子還有你們大家$R真的謝謝你們，$R我不會忘記的$R;" +
                            "\"$R即使分開了，我們還是姐妹唷\"$R;", "\"凱堤（山吹）\"");
                        Say(pc, 0, 131, "山吹！！！$R;", "\"凱堤（桃）\"");
                    }
                    else
                    {
                        Say(pc, 0, 131, "\"…桃子，謝謝，我不會忘記你的\"$R;" +
                            "\"$R即使分開了，我們還是姐妹唷\"$R;", "\"凱堤（山吹）\"");
                        Say(pc, 0, 131, "山吹！$R;", "\"凱堤（桃）\"");
                    }
                    Say(pc, 0, 131, "喵$R;");
                    Wait(pc, 1000);
                    PlaySound(pc, 4012, false, 100, 50);
                    ShowEffect(pc, 4131);
                    Wait(pc, 6000);
                    Say(pc, 0, 131, "得到了『凱堤（山吹）』$R;");
                    Say(pc, 0, 131, "…哎喲？！這是怎麼回事？$R山吹！附身在這裡了？$R;", "\"凱堤（桃）\"");
                    Say(pc, 0, 131, "我…怎麼回事？$R;", "\"凱堤（山吹）\"");
                    Say(pc, 0, 131, "…怎麼會有這種事情？！$R沒有『裁縫阿姨的三角巾』阿$R怎麼會…$R;", "\"凱堤（桃）\"");
                    Say(pc, 11000800, 131, "哎喲！放在兜裡的汗巾不見了？$R;");
                    Say(pc, 0, 131, "「汗巾」…$R;", "\"凱堤（山吹）\"");
                    Say(pc, 0, 131, "是不是…$R;", "\"凱堤（桃）\"");
                    Say(pc, 11000800, 131, "上次到上城裁縫所送東西時$R;" +
                        "$R店員看到我的臉$R給了我一塊很奇怪的布$R;" +
                        "$P還說了靈魂什麼的$R;" +
                        "$R不知道是什麼意思，就當汗巾用了$R;");
                    Say(pc, 0, 131, "哇！主人！！主人！！！$R;" +
                        "$R快！！快！！洗一下！！！…$R;", "\"凱堤（山吹）\"");
                    if (CountItem(pc, 10017902) >= 1 && CountItem(pc, 10017903) >= 1)
                    {
                        Say(pc, 0, 131, "那個三角巾真是…$R黃…$R;", "\"凱堤（緑）\"");
                        Say(pc, 0, 131, "山吹…好像有點味道呀$R;", "\"凱堤（藍）\"");
                        Say(pc, 0, 131, "哈哈！這是山吹色！！$R不是變黃，是山吹色啦！！$R本來就是這個顏色的$R;" +
                            "$R主人!!快來!!!快幫我洗!!!…$R;", "\"凱堤（山吹）\"");
                    }
                    else if (CountItem(pc, 10017902) >= 1)
                    {
                        Say(pc, 0, 131, "我覺得那個三角巾…$R有點發黃阿…$R;", "\"凱堤（緑）\"");
                        Say(pc, 0, 131, "哈哈！這是山吹色！！$R不是變黃，是山吹色！！$R本來就是這個顏色的$R;", "\"凱堤（山吹）\"");
                    }
                    else if (CountItem(pc, 10017903) >= 1)
                    {
                        Say(pc, 0, 131, "山吹…好像有點味道$R;", "\"凱堤（藍）\"");
                        Say(pc, 0, 131, "夠了！夠了！$R主人~~可不可以幫我洗…$R;", "\"凱堤（山吹）\"");
                    }
                    Say(pc, 0, 131, "在商人叔叔那裡會把我當成汗巾的？$R;" +
                        "$R跟我們在一起吧$R現在開始，我們姐妹可以在一起了$R;" +
                        "$P以後多多關照唷！山吹$R;", "\"凱堤（桃）\"");
                    Say(pc, 0, 131, "…這個三角巾$R就當作跑腿的報酬收下吧…$R;");
                    if (CheckInventory(pc, 10017905, 1))
                    {
                        GiveItem(pc, 10017905, 1);
                        Neko_04_amask.SetValue(Neko_04.任務結束, true);
                        if (Neko_04_cmask.Test(Neko_04.超重))
                        {
                            Neko_04_cmask.SetValue(Neko_04.超重, false);
                            PlaySound(pc, 2040, false, 100, 50);
                            Say(pc, 11000800, 131, "想要收下這黃色的布，得努力呀$R;");
                            return;
                        }
                        return;
                    }
                    Neko_04_cmask.SetValue(Neko_04.超重, true);
                    Say(pc, 11000800, 131, "哈哈！$R那黃色的布不就是我的汗巾嗎？$R;" +
                        "$R什麼？想要？$R您幫了我大忙，$R所以您要什麼都可以給您唷$R;" +
                        "$P不過您的行李太多了，$R好像無法收下呀$R;" +
                        "$R我先幫您拿著$R您去把行李減少後再來吧$R;");

                    return;
                }
            }
            if (Neko_04_amask.Test(Neko_04.任務開始) &&
                !Neko_04_amask.Test(Neko_04.任務結束) &&
                Neko_04_cmask.Test(Neko_04.被詢問犯人的事) &&
                !Neko_04_cmask.Test(Neko_04.被告知去找機器人))
            {
                Neko_04_cmask.SetValue(Neko_04.被告知去找機器人, true);
                Say(pc, 11000800, 131, "什！什麼？$R;" +
                    "$R什麼？行李被偷了？$R;" +
                    "$P哎喲！這到底是怎麼回事阿??$R;" +
                    "$R那個是非常重要的研究材料呀！！$R;" +
                    "$R這個笨蛋!!把事情搞砸了！！$R;");
                Say(pc, 0, 131, "唉！$R你的嘴巴是不是太過分了？！$R;", "\"凱堤（山吹）\"");
                if (pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.PET))
                {
                    if (pc.Inventory.Equipments[EnumEquipSlot.PET].ItemID == 10017900)
                    {
                        Say(pc, 0, 131, "山吹！?！$R;", "\"凱堤（桃）\"");
                    }
                }
                Say(pc, 11000800, 131, "嗯？剛才說什麼了？$R;" +
                    "\"$R…嗯，到底是誰，$R為什麼把東西偷走了呢…\"$R;" +
                    "$P嗯？裡面的是什麼？$R;" +
                    "$R想知道嗎？$R;" +
                    "$R想知道的話，可以告訴您喔$R;");
                Say(pc, 11000800, 131, "…$R;" +
                    "\"$R那個呀，$R是在奧克魯尼亞大陸西南方島嶼的$R「光之塔」裡發掘的機械部件喔\"$R;" +
                    "$P「光之塔」是$R機械文明末期，建造的科學研究所$R;" +
                    "$R好像在研究復活生命$R以及保存的方式$R還有開發永恆的能源唷$R;" +
                    "$P…發掘那東西的機械神匠$R跟平時一樣撿一些有用的零件$R;" +
                    "$R可能在那時候發現的吧$R;" +
                    "$P這個出土品是$R生平第一次見到的東西喔$R;" +
                    "$P沒錯$R那個部件不是我們祖先$R機械時代的科技製作的$R;" +
                    "$R也不是塔妮亞統治時期製作的$R;" +
                    "$P完全是用另外一種$R高科技技術來製造的呀！！$R;");
                Say(pc, 11000800, 131, "那個機械神匠沒有理由$R把零件拿到我這來呀$R;" +
                    "$P我想通過行會，詳細調查零件，$R把這個送到阿高普路斯的$R機械神匠那裡吧$R;" +
                    "$P…您想像一下，$R這個零件是$R在我們人類歷史上最大$R戰爭災難時期的斷層發掘的$R;" +
                    "$P也許能夠取得，$R我們未知的戰爭情報唷$R;" +
                    "$P…！！$R是不是有人為了掩蓋什麼…？？$R;" +
                    "$R嗯！這件事情好像隱藏著巨大內幕呀$R;");
                //EVT1100080021
                Say(pc, 11000800, 131, "總之現在只有把犯人找出來$R找回那個零件阿$R;" +
                    "$P在上城發生的話，$R就有抓犯人的好方法喔$R;" +
                    "$R問一下阿高普路斯的嚮導機器人吧$R;" +
                    "他們可以馬上把顯示器裡$R顯示的所有影像儲存到記憶體$R;" +
                    "$P行會宮殿前的嚮導機器人$R應該有拍下犯人影像的資料唷$R;");
                return;
            }
            if (!Neko_04_amask.Test(Neko_04.任務開始) &&
                (Neko_04_cmask.Test(Neko_04.交出商人的傳達品) ||
                (!Neko_04_cmask.Test(Neko_04.交出商人的傳達品) &&
                pc.Fame > 9 && pc.Level > 29)) &&
                pc.Inventory.Equipments.ContainsKey(EnumEquipSlot.PET))
            {
                if (pc.Inventory.Equipments[EnumEquipSlot.PET].ItemID == 10017900)
                {
                    Say(pc, 0, 131, "喵$R;", "\"???\"");
                    Say(pc, 0, 131, "…！？$R哦…！？$R;", "\"凱堤\"");
                    Say(pc, 11000800, 131, "什麼？$R;" +
                        "$R又是哪來的哭聲呀$R;" +
                        "$P身後又開始傳來$R最近經常聽到的哭聲了$R;" +
                        "$R本來還以為是幻聽阿$R您也聽到了嗎？$R;");
                    switch (Select(pc, "哭聲…", "", "聽見了", "是不是聽錯了"))
                    {
                        case 1:
                            Say(pc, 11000800, 131, "是嗎？原來如此！$R;" +
                                "$R上次出發做買賣的時候$R就覺得很煩，$R原來不是只有我聽見了$R;" +
                                "$P只要不影響做生意，無所謂囉$R;");
                            Say(pc, 11000800, 131, "啊，對了！！$R;" +
                                "$R正好，不好意思，$R可不可以拜託您一件事情呢？$R;" +
                                "$P請送一件道具到阿高普路斯市$R行會宮殿4樓的商人行會那裡吧$R;" +
                                "$P本來我應該直接送過去的$R可是我不能離開這兒呀$R;" +
                                "$R怎麼樣？可以幫我送過去嗎？$R;");
                            switch (Select(pc, "怎麼做呢？", "", "幫他送過去", "不去"))
                            {
                                case 1:
                                    Say(pc, 11000800, 131, "是嗎？謝謝了！$R;" +
                                        "$R要送過去的是這個。$R有點重，小心點呀$R;");
                                    if (CheckInventory(pc, 50071151, 1))
                                    {
                                        if (CheckInventory(pc, 50071151, 1))
                                        {
                                            Neko_04_cmask.SetValue(Neko_04.收到商人的傳達品, true);
                                            Neko_04_amask.SetValue(Neko_04.任務開始, true);
                                            GiveItem(pc, 50071151, 1);
                                            PlaySound(pc, 2040, false, 100, 50);
                                            Say(pc, 0, 131, "得到了『商人的傳達品』$R;");
                                            Say(pc, 11000800, 131, "把這個送到阿高普路斯行會宮殿的$R行會總管那吧$R;" +
                                                "$P陶瓷盒裡藏著$R能夠改變我們人類未來的秘密唷$R;" +
                                                "不能偷看裡面喔!$R當然不是不相信您啦$R;");
                                            Say(pc, 0, 131, "…?$R;");
                                            Say(pc, 0, 131, "喵$R;", "\"???\"");
                                            Say(pc, 0, 131, "山吹？$R;", "\"凱堤（桃）\"");
                                            Say(pc, 0, 131, "這位好像有點商業天分$R;" +
                                                "好的！我塗上口水了$R;", "\"山吹？？\"");
                                            Say(pc, 0, 131, "難道是？！山吹？！$R;" +
                                                "$R你是山吹吧？對嗎？$R;", "\"凱堤（桃）\"");
                                            Say(pc, 0, 131, "是桃子呀！$R;" +
                                                "$R好久不見了$R過的怎樣呢？$R;" +
                                                "$P就像你看到的呀$R這個人現在開始是我的啦$R;" +
                                                "$R以後多多關照喔~$R;", "\"凱堤（山吹）\"");
                                            Say(pc, 0, 131, "\"什？什麼！！$R等，等等！\"$R;" +
                                                "$R這個人是我先發現的阿！！$R;", "\"凱堤（桃）\"");
                                            Say(pc, 0, 131, "哦…是嗎？辛苦你了！！$R;" +
                                                "$R現在開始我會貼身照顧他的$R不用為他擔心啦$R;", "\"凱堤（山吹）\"");
                                            Say(pc, 0, 131, "什麼？什麼話！！$R;" +
                                                "為什麼我要讓步阿！！$R;", "\"凱堤（桃）\"");
                                            if (!(pc.Job > (PC_JOB)110 &&
                                            pc.Job < (PC_JOB)116))
                                            {
                                                Say(pc, 0, 131, "還有！$R這個人不是商人！$R;" +
                                                    "$R為什麼隨便指定別人是商人？！！$R;", "\"凱堤（桃）\"");
                                            }
                                            if (CountItem(pc, 10017902) >= 1)
                                            {
                                                Say(pc, 0, 131, "…呀$R…有…有我的地方…$R;", "\"凱堤（緑）\"");
                                                Say(pc, 0, 131, "緑安靜點!$R;" +
                                                    "$R緑，你太吵了!$R;", "\"凱堤（桃）");
                                                Say(pc, 0, 131, "…對…對不起…$R;" +
                                                    "$R我有點氣過頭了$R…真是夠了$R;" +
                                                    "$R哎喲！！$R我的口氣跟山吹差不多了?!$R怎麼辦呀！$R;", "\"凱堤（桃）\"");
                                            }
                                            else if (CountItem(pc, 10017903) >= 1)
                                            {
                                                Say(pc, 0, 131, "那個…$R主人…是我的…$R;", "\"凱堤（藍）\"");
                                                Say(pc, 0, 131, "藍安靜點！$R;" +
                                                    "$R藍很吵耶!$R;", "\"凱堤（桃）");
                                                Say(pc, 0, 131, "…對…對不起…$R;" +
                                                    "$R我有點氣過頭了$R…真是夠了$R;" +
                                                    "$R哎喲！！$R我的口氣跟山吹差不多了?!$R怎麼辦呀！$R;", "\"凱堤（桃）\"");
                                            }
                                            Say(pc, 11000800, 131, "…?$R;" +
                                                "$R什麼聲音？$R好像是從您那，傳來煩人的哭聲喔$R;" +
                                                "$R是不是聽錯了？$R;");
                                            Say(pc, 0, 131, "喵！！喵喵喵喵！！$R;" +
                                                "$R喵！！喵喵喵喵！喵喵喵！$R;");
                                            Say(pc, 0, 131, "…今天比平時更煩…$R;" +
                                                "$R好像有種不祥的預感呀！$R;");
                                            return;
                                        }
                                        Say(pc, 11000800, 131, "怎麼回事！放上去就動不了了$R;" +
                                            "把行李減少後，再來吧$R;");
                                        return;
                                    }
                                    Say(pc, 11000800, 131, "怎麼回事！行李好像太多了$R;" +
                                        "把行李減少後，再來吧$R;");
                                    break;
                                case 2:
                                    Say(pc, 11000800, 131, "那麼沒辦法了$R;");
                                    Say(pc, 0, 131, "喵…$R;", "\"???\"");
                                    break;
                            }
                            break;
                        case 2:
                            Say(pc, 11000800, 131, "是嗎？$R;" +
                                "$R哦，可能年紀大了$R;");
                            break;
                    }
                    return;
                }
            }//*/

            if (ND_mask.Test(NDFlags.窮途末路的商人结束) &&
                (CountItem(pc, 10050851) >= 1 ||
                CountItem(pc, 10050852) >= 1))
            {
                if (!Degura_mask.Test(Degura.第一次對話))
                {
                    Say(pc, 131, "哦?$R對這小子有興趣?$R;" +
                        "$P牠叫「火紅德克拉」$R是盤古時代孵化出來的生物唷$R;");
                    Degura_mask.SetValue(Degura.第一次對話, true);
                }
                if (!Degura_mask.Test(Degura.持有火紅德拉古蛋))
                {
                    if (CountItem(pc, 10050851) >= 1)
                    {
                        Say(pc, 131, "嗯…您也有『火紅德拉古蛋』吧?$R;" +
                            "$P您也有嗎?讓我看看$R嗯…顏色好像有點不同呢$R;" +
                            "$R品種是不是有點不同…?$R;" +
                            "$P聽說魔物把蛋差不多都搶走了$R;" +
                            "$R這個，在某地方救回的吧?$R;" +
                            "$P啊！您特意來的嗎?$R;" +
                            "$R我帶了很多可以孵化那些蛋的蘋果來$R;" +
                            "$P什麼…?已經知道了?$R您怎麼會…?$R;" +
                            "$P您問在哪裡可以找到蘋果?$R;" +
                            "$R那個嘛…在摩根島的光之…糟了！$R;" +
                            "那個不可以說的呢$R我說我也不知道啊！$R;");
                    }
                    else
                    {
                        Say(pc, 131, "嗯…$R您…知道火紅德拉古嗎?$R;" +
                            "$P牠們的蛋，好像都給魔物搶走了$R;" +
                            "$R您又來了嗎?$R;" +
                            "$P嗯，是嗎…$R;" +
                            "$R我帶了很多可以孵化那些蛋的蘋果來$R;" +
                            "$P……?$R您怎麼知道?$R;" +
                            "$P什麼?您說在哪裡找到的?$R;" +
                            "$R這個當然，摩根島的光之…糟了！$R;" +
                            "我什麼都沒說！$R我什麼都沒說呀！$R;");
                    }
                    Degura_mask.SetValue(Degura.持有火紅德拉古蛋, true);
                }
                switch (Select(pc, "蘋果…", "", "讓一個給我吧", "沒什麼"))
                {
                    case 1:
                        兑换(pc);
                        break;
                    case 2:
                        break;
                }
                return;
            }
            Say(pc, 131, "真是~~！那麼慢阿！$R;" +
                "$R要到軍艦島機場接商人行會的人呀！$R;" +
                "$P我最近腰疼，不可以騎這小子去啊！$R;");
        }

        void 兑换(ActorPC pc)
        {
            Say(pc, 131, "！？$R您想把蛋孵化？$R;" +
                "$R蘋果是有的…可是$R;" +
                "$P孵化的話轉眼間$R就會變得這麼大呀$R;" +
                "$R他會很友善的跟著人到處走$R但把牠孵化的話，$R您就有責任和義務了$R;" +
                "$P得像自己的兒女般撫養啊，$R明白嗎?$R;");
            switch (Select(pc, "蘋果…", "", "讓一個給我吧", "沒什麼"))
            {
                case 1:
                    Say(pc, 131, "…好$R;" +
                        "$R要給蛋注射蘋果藥的話$R非用這注射器不可唷$R;" +
                        "$P這注射器是古文物，超難控制的$R反正，先把蛋拿過來吧$R;");
                    if (CheckInventory(pc, 10052301, 1))
                    {
                        if (CountItem(pc, 10050851) >= 1 && CountItem(pc, 10050852) >= 1)
                        {
                            Say(pc, 131, "…??您兩種蛋都有啊$R;" +
                                "$R您要孵化哪種顏色的蛋呢?$R;");
                            switch (Select(pc, "您要孵化哪一顆蛋?", "", "紅色", "藍色", "不用了"))
                            {
                                case 1:
                                    TakeItem(pc, 10050852, 1);
                                    GiveItem(pc, 10052301, 1);
                                    Say(pc, 131, "失去了『火紅德拉古蛋』！$R;");
                                    Say(pc, 131, "得到了『火紅德拉古』！$R;");
                                    Say(pc, 131, "要好好的養啊$R;" +
                                        "$R不要常常到處惹事啊…$R;");
                                    break;
                                case 2:
                                    TakeItem(pc, 10050851, 1);
                                    GiveItem(pc, 10052303, 1);
                                    Say(pc, 131, "失去了『水藍德拉古蛋』！$R;");
                                    Say(pc, 131, "得到了『水藍德拉古』！$R;");
                                    Say(pc, 131, "要好好的養啊$R;" +
                                        "$R不要常常到處惹事啊…$R;");
                                    break;
                                case 3:
                                    break;
                            }
                            return;
                        }
                        if (CountItem(pc, 10050851) >= 1)
                        {
                            TakeItem(pc, 10050851, 1);
                            GiveItem(pc, 10052303, 1);
                            Say(pc, 131, "失去了『水藍德拉古蛋』！$R;");
                            Say(pc, 131, "得到了『水藍德拉古』！$R;");
                            Say(pc, 131, "要好好的養啊$R;" +
                                "$R不要常常到處惹事啊…$R;");
                            return;
                        }
                        TakeItem(pc, 10050852, 1);
                        GiveItem(pc, 10052301, 1);
                        Say(pc, 131, "失去了『火紅德拉古蛋』！$R;");
                        Say(pc, 131, "得到了『火紅德拉古』！$R;");
                        Say(pc, 131, "要好好的養啊$R;" +
                            "$R不要常常到處惹事啊…$R;");
                        return;
                    }
                    Say(pc, 131, "您好像有很多東西啊$R;" +
                        "$R先減少一點再來吧$R;");
                    break;
                case 2:
                    break;
            }
        }
    }
}