using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript
{
    public class P10001358 : RandomPortal
    {
        public P10001358()
        {
            Init(10001358, 10062000, 182, 70, 185, 71);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:唐卡島(10062000)
    //目標坐標:(182,70) ~ (185,71)
    public class P10001363 : RandomPortal
    {
        public P10001363()
        {
            Init(10001363, 10059100, 88, 158, 89, 159);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:麵包樹森林(10059100)
    //目標坐標:(88,158) ~ (89,159)

    public class P10001364 : RandomPortal
    {
        public P10001364()
        {
            Init(10001364, 10059000, 83, 155, 84, 156);
        }
    }
    //原始地圖:麵包樹森林(10059100)
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(83,155) ~ (84,156)

    public class P10001429 : RandomPortal
    {
        public P10001429()
        {
            Init(10001429, 10059101, 88, 158, 89, 159);
        }
    }
    //原始地圖:瑪依瑪依島 (夜)(10059001)
    //目標地圖:麵包樹森林 (夜)(10059101)
    //目標坐標:(88,158) ~ (89,159)

    public class P10001430 : RandomPortal
    {
        public P10001430()
        {
            Init(10001430, 10059001, 83, 155, 84, 156);
        }
    }
    //原始地圖:麵包樹森林 (夜)(10059101)
    //目標地圖:瑪依瑪依島 (夜)(10059001)
    //目標坐標:(83,155) ~ (84,156)
    public class P10001433 : RandomPortal
    {
        public P10001433()
        {
            Init(10001433, 30200001, 2, 5, 2, 5);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:朝聖者的住宿設施(30200001)
    //目標坐標:(2,5) ~ (2,5)

    public class P10001434 : RandomPortal
    {
        public P10001434()
        {
            Init(10001434, 30200002, 2, 5, 2, 5);
        }
    }
    //原始地圖:瑪依瑪依島(10059000)
    //目標地圖:朝聖者的住宿設施(30200002)
    //目標坐標:(2,5) ~ (2,5)

    public class P10001435 : RandomPortal
    {
        public P10001435()
        {
            Init(10001435, 30200003, 2, 5, 2, 5);
        }
    }
    //原始地圖:瑪依瑪依島 (夜)(10059001)
    //目標地圖:朝聖者的住宿設施(30200003)
    //目標坐標:(2,5) ~ (2,5)

    public class P10001436 : RandomPortal
    {
        public P10001436()
        {
            Init(10001436, 30200004, 2, 5, 2, 5);
        }
    }
    //原始地圖:瑪依瑪依島 (夜)(10059001)
    //目標地圖:朝聖者的住宿設施(30200004)
    //目標坐標:(2,5) ~ (2,5)

    public class P10001437 : RandomPortal
    {
        public P10001437()
        {
            Init(10001437, 10059000, 103, 52, 103, 52);
        }
    }
    //原始地圖:朝聖者的住宿設施(30200001)
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(103,52) ~ (103,52)

    public class P10001438 : RandomPortal
    {
        public P10001438()
        {
            Init(10001438, 10059000, 101, 46, 101, 46);
        }
    }
    //原始地圖:朝聖者的住宿設施(30200002)
    //目標地圖:瑪依瑪依島(10059000)
    //目標坐標:(101,46) ~ (101,46)

    public class P10001439 : RandomPortal
    {
        public P10001439()
        {
            Init(10001439, 10059001, 103, 52, 103, 52);
        }
    }
    //原始地圖:朝聖者的住宿設施(30200003)
    //目標地圖:瑪依瑪依島 (夜)(10059001)
    //目標坐標:(103,52) ~ (103,52)

    public class P10001440 : RandomPortal
    {
        public P10001440()
        {
            Init(10001440, 10059001, 101, 46, 101, 46);
        }
    }
    //原始地圖:朝聖者的住宿設施(30200004)
    //目標地圖:瑪依瑪依島 (夜)(10059001)
    //目標坐標:(101,46) ~ (101,46)


}