using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
namespace SagaScript.M22197000
{
    public class S11002027 : Event
    {
        public S11002027()
        {
            this.EventID = 11002027;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 131, "唔。$R;" +
            "如果可以解析到這算法的話$R;" +
            "恐怕某些系統$R;" +
            "雖然我認為還在控制下……。$R;", "レジスタンス研究員Ａ");

            Say(pc, 11002028, 131, "這個蠻有趣的$R;" +
            "$P這兒把已成了這樣的事$R;" +
            "把那裡代入這道算式……。$R;" +
            "$P不、看來不行呢。$R;", "レジスタンス研究員Ｂ");

            Say(pc, 131, "啊！等一下！$R;" +
            "那算式這樣變形$R;" +
            "應用這項法則的話……。$R;", "レジスタンス研究員Ａ");

            Say(pc, 11002028, 131, "呵、這是一個驚喜。$R;" +
            "蠻能幹的不是嗎。$R;" +
            "$P可是、這樣弄了$R;" +
            "這兒成為了新的問題呢。$R;", "レジスタンス研究員Ｂ");

            Say(pc, 0, 131, "……。$R;" +
            "$P（最好不要去打擾）$R;", " ");

            //
            /*
            Say(pc, 131, "う～ん。$R;" +
            "このアルゴリズムの解析ができれば$R;" +
            "恐らくいくつかのシステムを$R;" +
            "制御下におけると思うんだけど……。$R;", "レジスタンス研究員Ａ");

            Say(pc, 11002028, 131, "これはなかなか興味深いですね$R;" +
            "$Pココがこうなっているという事は$R;" +
            "この式をソコに代入して……。$R;" +
            "$Pむぅ、ダメみたいですね。$R;", "レジスタンス研究員Ｂ");

            Say(pc, 131, "あ！ちょっとまって！$R;" +
            "その式をコウ変形して$R;" +
            "この法則を当てはめれば……。$R;", "レジスタンス研究員Ａ");

            Say(pc, 11002028, 131, "ほぅ、コレは驚きました。$R;" +
            "なかなかやるじゃないですか。$R;" +
            "$Pしかし、そうなると$R;" +
            "ココが新たな問題になりますね。$R;", "レジスタンス研究員Ｂ");

            Say(pc, 0, 131, "……。$R;" +
            "$P（邪魔しないほうがよさそうだ）$R;", " ");
            */

        }
    }
}


        
   


