using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
namespace SagaScript.M22197000
{
    public class S11002020 : Event
    {
        public S11002020()
        {
            this.EventID = 11002020;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 11002020, 112, "咚柊痛痛痛痛。$R;", "レジスタンス負傷兵");

            Say(pc, 131, "呼呼呼呼呼$R;" +
            "相當相當改造……もとい$R;" +
            "治し甲斐のあり這麼精神奕奕的患者だねぇ$R;", "レジスタンスドクター");

            Say(pc, 11002020, 112, "誒？$R;", "レジスタンス負傷兵");

            Say(pc, 131, "甚麼、傳感器好像壞了。$R;" +
            "只是稍微研究下……。$R;", "レジスタンスドクター");

            Say(pc, 11002020, 112, "啊、不、嗯、對不起！$R;" +
            "這傷、如同幻覺！$R;", "レジスタンス負傷兵");

            Say(pc, 11002019, 131, "醫生！$R;" +
            "果然請不要從年青人手上購入吧。$R;" +
            "這不是很可憐嗎！$R;", "レジスタンスナース");


            Say(pc, 131, "啊～、スマンスマン。$R;" +
            "戲弄患者是我輩的壞習慣呃。$R;" +
            "自稱『肯定之手』因此請你安心吧。$R;", "レジスタンスドクター");

            Say(pc, 11002020, 112, "自、自稱！？$R;", "レジスタンス負傷兵");

            //
            /*
            Say(pc, 11002020, 112, "イタたたたた。$R;", "レジスタンス負傷兵");

            Say(pc, 131, "フフフフフ$R;" +
            "なかなか改造……もとい$R;" +
            "治し甲斐のありそうな元気な患者だねぇ$R;", "レジスタンスドクター");

            Say(pc, 11002020, 112, "え？$R;", "レジスタンス負傷兵");

            Say(pc, 131, "なに、悪いようにはせんさ。$R;" +
            "ちょっとだけ研究の……。$R;", "レジスタンスドクター");

            Say(pc, 11002020, 112, "あ、いや、えっと、すみません！$R;" +
            "この傷、気のせいみたいです！$R;", "レジスタンス負傷兵");

            Say(pc, 11002019, 131, "ドクター！$R;" +
            "あまり若い子をからかわないで下さい。$R;" +
            "かわいそうじゃないですか！$R;", "レジスタンスナース");

            Say(pc, 131, "あ～、スマンスマン。$R;" +
            "患者をからかうのは我輩の悪い癖でな。$R;" +
            "自称『腕は確か』だから安心したまえ。$R;", "レジスタンスドクター");

            Say(pc, 11002020, 112, "じ、自称！？$R;", "レジスタンス負傷兵");
            */
        }
    }
}


        
   


