using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;
//所在地圖:上城(10023000) NPC基本信息:傢俱匠人(11000794) X:106 Y:122
namespace SagaScript.M10023000
{
    public class S11000794 : Event
    {
        public S11000794()
        {
            this.EventID = 11000794;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 11000794, 131, "要購買傢俱材料或摩根炭嗎?$R;", "傢俱工匠");

            switch (Select(pc, "想做什麼?", "", "購買材料","家具", "配置用キューブ", "購買摩根炭", "改建房子", "什麼也不做"))
            {
                case 1:
                    OpenShopBuy(pc, 1000);
                    break;
                case 2:
                    OpenShopBuy(pc, 243);
                    break;
                case 3:
                    OpenShopBuy(pc, 244);
                    break;

                case 4:
                    OpenShopBuy(pc, 220);
                    break;

                case 5:
                    改建房子(pc);
                    break;

                case 6:
                    break;
            }
        }

        void 改建房子(ActorPC pc)
        {
            switch (Select(pc, "想要怎樣的風格呢?", "", "阿高普路斯風格", "帕斯特風格", "摩根風格", "阿伊恩薩烏斯風格", "諾頓風格", "什麼也不做"))
            {
                case 1:
                    Say(pc, 11000794, 131, "阿高普路斯風格，顧名思義，$R;" +
                                           "代表「阿高普路斯市的」$R;" +
                                           "新都會建築樣式唷!$R;" +
                                           "$P這種風格得到$R;" +
                                           "「阿高普路斯評議會」贊助。$R;" +
                                           "$R所以比別的建築簡單一些。$R;" +
                                           "$P需要的道具有$R;" +
                                           "$R『ECO券』15張和『小屋』1間。$R;" +
                                           "$P只要參加「阿高普路斯評議會」$R;" +
                                           "特別實施的『清潔計劃』，$R;" +
                                           "就可以得到『ECO券』喔!$R;" +
                                           "$P怎麼樣? $R;" +
                                           "要改建成這個風格，試試看嗎?$R;", "傢俱工匠");

                    switch (Select(pc, "想怎麼做?", "", "再想想", "改建成阿高普路斯風格"))
                    {
                        case 1:
                            Say(pc, 0, 0, "目前尚未實裝$R;", " ");
                            break;

                        case 2:
                            Say(pc, 11000794, 131, "對不起，您好像沒有資格做呢$R;", "傢俱工匠");
                            break;
                    }
                    break;

                case 2:
                    Say(pc, 11000794, 131, "帕斯特風格，顧名思義，$R;" +
                                           "代表「帕斯特地域」的$R;" +
                                           "遊牧建築樣式唷!$R;" +
                                           "$P帕斯特擁有這個風格的改建權。$R;" +
                                           "$R所以只有屬於$R;" +
                                           "『混城騎士團東軍』的人，才能改建。$R;" +
                                           "$P如果得到改建許可，$R;" +
                                           "東軍會發放資金，改建比較容易。$R;" +
                                           "$P需要的道具有$R;" +
                                           "$R『ECO券』30張和『小屋』1間。$R;" +
                                           "$P只要參加「阿高普路斯評議會」$R;" +
                                           "特別實施的『清潔計劃』，$R;" +
                                           "就可以得到『ECO券』喔!$R;" +
                                           "$P怎麼樣? $R;" +
                                           "要改建成這個風格，試試看嗎?$R;", "傢俱工匠");

                    switch (Select(pc, "想怎麼做?", "", "再想想", "改建成帕斯特風格"))
                    {
                        case 1:
                            Say(pc, 0, 0, "目前尚未實裝$R;", " ");
                            break;

                        case 2:
                            Say(pc, 11000794, 131, "對不起，您好像沒有資格做呢$R;", "傢俱工匠");
                            break;
                    }
                    break;

                case 3:
                    Say(pc, 11000794, 131, "摩根風格，顧名思義，$R;" +
                                           "是代表「摩根地域」的$R;" +
                                           "實用性木製建築樣式唷!$R;" +
                                           "$P摩根擁有這個風格的改建權。$R;" +
                                           "$R所以只有屬於$R;" +
                                           "『混城騎士團西軍』的人，才能改建。$R;" +
                                           "$P如果得到改建許可，$R;" +
                                           "西軍會發放資金，改建比較容易。$R;" +
                                           "$P需要的道具有$R;" +
                                           "$R『ECO券』30張和『小屋』1間。$R;" +
                                           "$P只要參加「阿高普路斯評議會」$R;" +
                                           "特別實施的『清潔計劃』，$R;" +
                                           "就可以得到『ECO券』喔!$R;" +
                                           "$P怎麼樣? $R;" +
                                           "要改建成這個風格，試試看嗎?$R;", "傢俱工匠");

                    switch (Select(pc, "想怎麼做?", "", "再想想", "改建成摩根風格"))
                    {
                        case 1:
                            Say(pc, 0, 0, "目前尚未實裝$R;", " ");
                            break;

                        case 2:
                            Say(pc, 11000794, 131, "對不起，您好像沒有資格做呢$R;", "傢俱工匠");
                            break;
                    }
                    break;

                case 4:
                    Say(pc, 11000794, 131, "阿伊恩薩烏斯風格，顧名思義，$R;" +
                                           "是代表「阿伊恩薩烏斯地域」$R;" +
                                           "結實的鐵製建築樣式唷!$R;" +
                                           "$P阿伊恩薩烏斯擁有這個風格的改建權。$R;" +
                                           "$R所以只有屬於$R;" +
                                           "『混城騎士團南軍』的人，才能改建。$R;" +
                                           "$P如果得到改建許可，$R;" +
                                           "南軍會發放資金，改建比較容易。$R;" +
                                           "$P需要的道具有$R;" +
                                           "$R『ECO券』30張和『小屋』1間。$R;" +
                                           "$P只要參加「阿高普路斯評議會」$R;" +
                                           "特別實施的『清潔計劃』，$R;" +
                                           "就可以得到『ECO券』喔!$R;" +
                                           "$P怎麼樣? $R;" +
                                           "要改建成這個風格，試試看嗎?$R;", "傢俱工匠");

                    switch (Select(pc, "想怎麼做?", "", "再想想", "改建成阿伊恩薩烏斯風格"))
                    {
                        case 1:
                            Say(pc, 0, 0, "目前尚未實裝$R;", " ");
                            break;

                        case 2:
                            Say(pc, 11000794, 131, "對不起，您好像沒有資格做呢$R;", "傢俱工匠");
                            break;
                    }
                    break;

                case 5:
                    Say(pc, 11000794, 131, "諾頓風格，顧名思義，$R;" +
                                           "是代表「諾頓地域」的$R;" +
                                           "華麗建築樣式唷!$R;" +
                                           "$P諾頓擁有這個風格的改建權。$R;" +
                                           "$R所以只有屬於$R;" +
                                           "『混城騎士團北軍』的人，才能改建。$R;" +
                                           "$P如果得到改建許可，$R;" +
                                           "北軍會發放資金，改建比較容易。$R;" +
                                           "$P需要的道具有$R;" +
                                           "$R『ECO券』30張和『小屋』1間。$R;" +
                                           "$P只要參加「阿高普路斯評議會」$R;" +
                                           "特別實施的『清潔計劃』，$R;" +
                                           "就可以得到『ECO券』喔!$R;" +
                                           "$P怎麼樣? $R;" +
                                           "要改建成這個風格，試試看嗎?$R;", "傢俱工匠");

                    switch (Select(pc, "想怎麼做?", "", "再想想", "改建成諾頓風格"))
                    {
                        case 1:
                            Say(pc, 0, 0, "目前尚未實裝$R;", " ");
                            break;

                        case 2:
                            Say(pc, 11000794, 131, "對不起，您好像沒有資格做呢$R;", "傢俱工匠");
                            break;
                    }
                    break;

                case 6:
                    break;
            }
        }
    }
}



