using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
//所在地圖:上城(10023000) NPC基本信息:埃琳娜(11000155) X:106 Y:122
namespace SagaScript.M10023000
{
    public class S11000155 : Event
    {
        public S11000155()
        {
            this.EventID = 11000155;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Puppetry> Puppetry_mask = pc.AMask["Puppetry"];

            if (pc.Level < 8)
            {
                Say(pc, 131, "我的名字是埃琳娜$R;" +
                    "$R因為對埃米爾世界有興趣$R;" +
                    "所以來周圍看看$R;" +
                    "$P如果再強些的話$R;" +
                    "會告訴你一些好東西的$R;" +
                    "$R就這樣說好了!$R;");
                return;
            }

            if (Puppetry_mask.Test(Puppetry.與埃琳娜第一次對話))
            {
                Say(pc, 131, "有什麼可以幫助的…?$R;");
                普通對話(pc);
                return;
            }

            NPCChangeView(pc, 11000155, 11000139);
            ShowEffect(pc, 11000155, 8015);
            Say(pc, 131, "啊啊~!!好了!!$R;" +
                "不要突然跟我說話啊!$R;");
            Wait(pc, 3000);
            Say(pc, 131, "……$R;" +
                "$R眼睛睜這麼大，瞧什麼啊?!$R;");
            Select(pc, "為什麼瞧著啊?", "", "呵…因為…那個…那…", "看起來像美人魚", "你太美了");

            Say(pc, 131, "啊!不會是我現在…?$R;" +
                "變身成瑪歐斯！?$R;");
            NPCChangeView(pc, 11000155, 11000181);
            ShowEffect(pc, 11000155, 8015);
            Wait(pc, 2000);
            Say(pc, 131, "真不好意思，把你嚇一跳$R;" +
                "$R一時錯手變身成『活動木偶』$R;" +
                "$R告訴你幾個情報當作謝罪吧$R;");
            Puppetry_mask.SetValue(Puppetry.與埃琳娜第一次對話, true);
            普通對話(pc);

        }

        void 普通對話(ActorPC pc)
        {
            BitMask<Puppetry> Puppetry_mask = pc.AMask["Puppetry"];

            switch (Select(pc, "想要問什麼?", "", "關於憑依", "關於活動木偶", "關於拿到活動木偶得方法", "沒什麼特別要問的"))
            {
                case 1:
                    Say(pc, 131, "『憑依』就是附身在別人身上$R;" +
                        "簡單吧?$R;" +
                        "$R但是憑依的話$R;" +
                        "$R『力量』和『魔力』會變得很強$R;");
                    Say(pc, 131, "怎樣做呢？$R;" +
                        "把嘴張開後大把吸氣~!!$R;" +
                        "$R再使勁地吐氣~!$R;" +
                        "$P那樣的話，吐出來的氣和魂$R;" +
                        "會從身上脫離出來的$R;" +
                        "$R然後附上想要進的對象身上就可以$R;" +
                        "$R靈魂移動比較難$R;" +
                        "所以憑依在附近的人身上比較好!$R;");
                    Say(pc, 131, "不知道什麼是什麼?$R;" +
                        "$P簡單點說吧…$R;" +
                        "$P站到想憑依的對象旁邊$R;" +
                        "對目標點擊滑鼠右鍵!!$R;" +
                        "然後選擇憑依!$R;" +
                        "再選憑依的道具就可以了!$R;" +
                        "$P再點擊一次的話，憑依會自動解除$R;");
                    Say(pc, 131, "可以憑依的地方有盾牌或甲衣等$R;" +
                        "重要裝備品$R;" +
                        "$R當然別人的裝備，或是$R;" +
                        "自己的裝備也可以$R;" +
                        "$P此外還有幾個條件$R;" +
                        "就是符合相配性才可以$R;" +
                        "$R但是就算憑依失敗也不會死的$R;" +
                        "$P一個個試試看吧!$R;");
                    break;
                case 2:
                    Say(pc, 131, "活動木偶是可以變身的神秘道具$R;" +
                        "跟憑依在別人身上不同$R;" +
                        "只要有道具就可以變身$R;" +
                        "$P使用活動木偶的話…$R;");
                    NPCChangeView(pc, 11000155, 11000357);
                    ShowEffect(pc, 11000155, 8015);
                    Wait(pc, 2000);
                    Say(pc, 113, "這樣可以變身成各種模樣$R;" +
                        "$R很有意思吧?$R;");
                    Say(pc, 133, "活動木偶不僅有意思$R;" +
                        "還可以使用各種力量$R;" +
                        "$P比如『瑪歐斯』!$R;");
                    NPCChangeView(pc, 11000155, 11000139);
                    ShowEffect(pc, 11000155, 8015);
                    Wait(pc, 2000);
                    Say(pc, 137, "像這樣的話，在水中也可以呼吸喔！$R;" +
                        "$P此外還有『塞爾曼德』!$R;");
                    NPCChangeView(pc, 11000155, 11000260);
                    ShowEffect(pc, 11000155, 8015);
                    Wait(pc, 2000);
                    Say(pc, 364, "這樣的話，可以提升火之力$R;" +
                        "所以可以使用技能『火焰鞭』$R;");
                    Say(pc, 131, "是什麼樣的技能$R;" +
                        "你親自用過就知道了$R;" +
                        "$P但是能變身的時間只有『3分鐘』!$R;" +
                        "$R還原後的一定時間內$R;" +
                        "是無法變身的，要注意喔！$R;");
                    NPCChangeView(pc, 11000155, 11000181);
                    ShowEffect(pc, 11000155, 8015);
                    Wait(pc, 2000);
                    if (!Puppetry_mask.Test(Puppetry.已經獲得木偶))
                    {
                        索取木偶(pc);
                        return;
                    }
                    普通對話(pc);
                    break;
                case 3:
                    Say(pc, 131, "要得到活動木偶，其實有不同的方法$R;" +
                        "$P不同的活動木偶，方法也不一樣$R;" +
                        "$R我可以把我知道的$R;" +
                        "獲得活動木偶的方法都告訴你$R;");
                    獲取木偶的方法(pc);
                    break;
                case 4:
                    break;
            }
        }

        void 獲取木偶的方法(ActorPC pc)
        {
            switch (Select(pc, "想知道什麼?", "", "不用了?", "得到活動木偶塞爾曼德的方法", "得到活動木偶瑪歐斯的方法", "得到活動木偶曼陀蘿的方法", "得到活動木偶塔依的方法"))
            {
                case 1:
                    break;
                case 2:
                    Say(pc, 131, "把『毒蜥蜴尾巴』、『金製部件』$R;" +
                        "和『心型紅寶石』合成的話$R;" +
                        "可以製作『塞爾曼德的項鏈』的道具$R;" +
                        "$P如果把那個給火焰精靈看的話$R;" +
                        "就可以跟塞爾曼德作協議$R;" +
                        "$P但是火焰精靈最討厭瑪歐斯$R;" +
                        "如果你是把變成乾魚的瑪歐斯$R;" +
                        "變回原貌的人$R;" +
                        "他們不會跟你做協議的$R;");
                    獲取木偶的方法(pc);
                    break;
                case 3:
                    Say(pc, 131, "知道關於『乾魚』的消息嗎？$R;" +
                        "我偶爾會看到奇怪的乾魚，$R;" +
                        "您有見過嗎?$R;" +
                        "$R其實是那瑪歐斯乾了的樣子，很瘦喔…$R;" +
                        "該不會是不知道吃東西吧?$R;" +
                        "$R不管怎麼樣，如果把它由乾魚$R;" +
                        "恢復原樣的話，他會一直跟著您的$R;" +
                        "$R想要給恢復原樣的話到$R就要到大陸洞窟$R;" +
                        "大陸洞窟的深處$R有個叫『瑪歐斯的故鄉』的地方$R;" +
                        "不去不行啊$R;" +
                        "$P去的方法，得到『行會宮殿5樓』$R;" +
                        "問問『瑪歐斯』$R;" +
                        "$R如果有乾魚的話，他會告訴你的$R;");
                    獲取木偶的方法(pc);
                    break;
                case 4:
                    Say(pc, 131, "知道被詛咒的『樹種子』的傳說嗎?$R;" +
                        "$R把那詛咒的『樹種子』栽培的話$R;" +
                        "聽說會變成『莫潔株』$R;" +
                        "$P但是把莫潔株擊退後$R;" +
                        "把詛咒解開的話$R;" +
                        "會成為曼陀蘿，它會報答您的$R;" +
                        "$P唔…曼陀蘿的話，有點變化無常$R;" +
                        "所以難保他會報答$R;");
                    獲取木偶的方法(pc);
                    break;
                case 5:
                    Say(pc, 131, "塔依的存在挺煩啊$R;" +
                        "$R集齊所有構成塔依的$R;" +
                        "零部件後就可以組裝$R;" +
                        "但是零部件太多了…$R;" +
                        "$P像我這樣對機器不太懂的人$R;" +
                        "根本就自己無法組裝$R;" +
                        "$R但是世界上什麼樣的人都有$R;" +
                        "也有喜歡這個的人$R;" +
                        "…說的是古董商店$R;" +
                        "$P拿材料到古董商店的話$R;" +
                        "古董商會很親切的給你說明$R;" +
                        "$R真不知道有什麼可開心的$R你都不知道有多吵…$R;");
                    獲取木偶的方法(pc);
                    break;
            }
        }

        void 索取木偶(ActorPC pc)
        {
            BitMask<Puppetry> Puppetry_mask = pc.AMask["Puppetry"];

            Say(pc, 131, "啊，看您遠道而來，$R;" +
                "送您一個活動木偶吧！$R;" +
                "$R喜歡哪一個?$R;");
            switch (Select(pc, "想要怎麼樣的活動木偶?", "", "想一想", "活動木偶塞爾曼德", "活動木偶瑪歐斯", "活動木偶曼陀蘿", "活動木偶塔依"))
            {
                case 1:
                    Say(pc, 131, "塞爾曼德是火焰精靈$R;" +
                        "瑪歐斯是水靈精靈$R;" +
                        "曼陀蘿是大地精靈$R;" +
                        "塔依是神風精靈$R;" +
                        "$P各有各的長處$R;" +
                        "因此根據情況，強弱也不一樣$R;" +
                        "$R跟活動木偶結緣$R;" +
                        "也不是在這裡就結束的$R;" +
                        "$P開始冒險以後$R;" +
                        "一定會得到別的活動木偶的$R;" +
                        "$R到時候好好選就可以了$R;");
                    索取木偶(pc);
                    break;
                case 2:
                    if (CheckInventory(pc, 10013850, 1))
                    {
                        GiveItem(pc, 10013850, 1);
                        Say(pc, 131, "塞爾曼德作為火焰精靈的化身$R;" +
                            "是比水屬強而比風屬弱的活動木偶$R;" +
                            "$R因為活動木偶是道具$R;" +
                            "所以總有一天會不能用的$R;" +
                            "$R所以請您珍惜地使用吧!$R;");
                        Puppetry_mask.SetValue(Puppetry.已經獲得木偶, true);
                        //_1A36 = true;
                        //_Xa03 = true;
                        普通對話(pc);
                        return;
                    }
                    Say(pc, 131, "好像因為太重沒法拿啊$R;");
                    break;
                case 3:
                    if (CheckInventory(pc, 10019400, 1))
                    {
                        GiveItem(pc, 10019400, 1);
                        Say(pc, 131, "瑪歐斯作為水靈精靈的化身$R;" +
                            "是比大地強但比火屬弱的活動木偶$R;" +
                            "$R因為活動木偶是道具$R;" +
                            "所以總有一天會不能用的$R;" +
                            "$R所以請您珍惜地使用吧!$R;");
                        Puppetry_mask.SetValue(Puppetry.已經獲得木偶, true);
                        //_1A36 = true;
                        //_Xa03 = true;
                        普通對話(pc);
                        return;
                    }
                    Say(pc, 131, "好像因為太重沒法拿啊$R;");
                    break;
                case 4:
                    if (CheckInventory(pc, 10019200, 1))
                    {
                        GiveItem(pc, 10019200, 1);
                        Say(pc, 131, "曼陀蘿作為大地精靈的化身$R;" +
                            "是比風屬強但比水屬弱的活動木偶$R;" +
                            "$R因為活動木偶是道具$R;" +
                            "所以總有一天會不能用的$R;" +
                            "$R所以請您珍惜地使用吧!$R;");
                        Puppetry_mask.SetValue(Puppetry.已經獲得木偶, true);
                        //_1A36 = true;
                        //_Xa03 = true;
                        普通對話(pc);
                        return;
                    }
                    Say(pc, 131, "好像因為太重沒法拿啊$R;");
                    break;
                case 5:
                    if (CheckInventory(pc, 10030001, 1))
                    {
                        GiveItem(pc, 10030001, 1);
                        Say(pc, 131, "塔依作為神風精靈的化身$R;" +
                            "是比火屬強但比大地弱的活動木偶$R;" +
                            "$R因為活動木偶是道具$R;" +
                            "所以總有一天會不能用的$R;" +
                            "$R所以請您珍惜地使用吧!$R;");
                        Puppetry_mask.SetValue(Puppetry.已經獲得木偶, true);
                        //_1A36 = true;
                        //_Xa03 = true;
                        普通對話(pc);
                        return;
                    }
                    Say(pc, 131, "好像因為太重沒法拿啊$R;");
                    break;
            }
        }
    }
}