using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;
//所在地圖:奧克魯尼亞東部平原(10025001) NPC基本信息:初心者告示板(12001065) X:104 Y:120
namespace SagaScript.M10025001
{
    public class S12001065 : Event
    {
        public S12001065()
        {
            this.EventID = 12001065;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 11001118, 131, "… 咳咳$R;" +
                                   "$R您好! 我是實菲。$R;" +
                                   "是這告示板的妖精喔!$R;" +
                                   "$R關於告示板的情報，我來說明吧!$R;", "告示板 妖精");

            switch (Select(pc, "說明…", "", "我要聽", "不聽"))
            {
                case 1:
                    Say(pc, 11001118, 131, "告示板是…$R;" +
                                           "$R可以自由地交換情報、招募隊伍、$R;" +
                                           "軍團成員等，各種內容的地方。$R;" +
                                           "$P有些地方，留言要付錢的呀!$R;" +
                                           "但大部分都是免費的。$R;" +
                                           "$R到處都有告示版喔!$R;" +
                                           "發現的話，好好查看一下吧。$R;" +
                                           "$P要用滑鼠右鍵點擊自己才能看到$R;" +
                                           "的招募廣告不一樣，$R;" +
                                           "即使您登出後，告示依然會保留。$R;" +
                                           "$R想長時間宣傳的時候，$R;" +
                                           "使用告示板比較方便唷!$R;" +
                                           "$P特別在「奧克魯尼亞東部平原」$R;" +
                                           "學校前面設置的告示板，$R;" +
                                           "叫做「初心者告示板」。$R;" +
                                           "是老隊員和冒險家前輩們，$R;" +
                                           "為了幫初心者解決疑問，$R;" +
                                           "而設立的告示板。$R;" +
                                           "$P有不知道的事情，$R;" +
                                           "可以在這個告示板上提問。$R;" +
                                           "$R我的說明到此結束了，$R;" +
                                           "詳細的使用方法，$R;" +
                                           "等到真的要留訊息時，再告訴您吧!$R;" +
                                           "$R下次再見吧!!$R;", "告示板 妖精");
                    break;

                case 2:
                    break;
            }
        }
    }
}
