using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;
//所在地圖:奧克魯尼亞東部平原(10025001) NPC基本信息:劍士前輩(11000946) X:153 Y:105
namespace SagaScript.M10025001
{
    public class S11000946 : Event
    {
        public S11000946()
        {
            this.EventID = 11000946;
        }

        public override void OnEvent(ActorPC pc)
        {
            int selection;

            Say(pc, 11000946, 131, "您好!$R;" +
                                   "$R我們是戰士系的職業唷!$R;" +
                                   "$R對我們的職業，有什麼好奇的嗎?$R;", "劍士前輩");

            switch (Select(pc, "想問有關戰士系的消息嗎?", "", "好啊", "不用了"))
            {
                case 1:
                    selection = Select(pc, "想聽哪種的說明呢?", "", "戰士系的特徵", "「劍士」是?", "「騎士」是?", "「盜賊」是?", "「弓手」是?", "不用了");

                    while (selection != 6)
                    {
                        switch (selection)
                        {
                            case 1:
                                Say(pc, 11000946, 131, "我先說明一下戰士系的特徵吧!$R;" +
                                                       "$P戰士系擁有全面性的超強攻擊力!$R;" +
                                                       "$R每個人的方法可能都不一樣，$R;" +
                                                       "但即使是單獨行動也可以喔!$R;" +
                                                       "$P但是無法學習「知識技能」，$R;" +
                                                       "能拿的行李也不多，$R;" +
                                                       "所以…並不適合採集或搬運呀。$R;" +
                                                       "$R練功時，$R;" +
                                                       "可能需要幫忙搬行李的同伴也不一定。$R;", "劍士前輩");
                                break;

                            case 2:
                                Say(pc, 11000946, 131, "由我來介紹「劍士」吧!$R;" +
                                                       "$P「劍士」是在最前線，$R;" +
                                                       "用劍或斧頭攻擊敵人的職業呀!!$R;" +
                                                       "$R可以使用雙手劍的只有劍士唷!$R;" +
                                                       "$P可以擁有高攻擊力和強化的技能。$R;" +
                                                       "$R如果想要連續使用的話，$R;" +
                                                       "我會推薦$R;" +
                                                       "能發揮巨大威力的「居和」系技能!$R;", "劍士前輩");
                                break;

                            case 3:
                                Say(pc, 11000947, 0, "由我來介紹「騎士」吧!$R;" +
                                                     "$P「騎士」是在最前線上，$R;" +
                                                     "用尖銳的劍或長槍，$R;" +
                                                     "來戰鬥的職業喔!$R;" +
                                                     "$R是唯一可以裝備槍類武器的職業呀!$R;" +
                                                     "$P可以學會很多防禦高$R;" +
                                                     "與提升防禦力相關的技能。$R;" +
                                                     "$P學會可以提升一定防禦的$R;" +
                                                     "「重裝鎧化」也不錯呢!$R;" +
                                                     "$R使用這個技能的話，$R;" +
                                                     "即使受到攻擊也不會疼啊!$R;", "騎士前輩");
                                break;

                            case 4:
                                Say(pc, 11000948, 0, "由我來介紹「盜賊」吧!$R;" +
                                                     "$P「盜賊」是特殊化攻擊力$R;" +
                                                     "和動作迅速的職業喔!$R;" +
                                                     "$R擅長使用投擲武器和短劍，$R;" +
                                                     "而且有強化技能可以學唷!$R;" +
                                                     "$P只要學會隱藏身體的「隱身」技術，$R;" +
                                                     "就可以很簡單的迴避戰鬥。$R;", "盜賊前輩");
                                break;

                            case 5:
                                Say(pc, 11000949, 0, "好啊、好啊~!$R;" +
                                                     "由我來介紹「弓手」吧!$R;" +
                                                     "$P「弓手」的特徵是用弓箭攻擊$R;" +
                                                     "遠距離的目標喔!$R;" +
                                                     "$R但是因為防禦力有點低，$R;" +
                                                     "魔物多的時候，$R;" +
                                                     "可能會有點棘手。$R;" +
                                                     "$P能強化弓的攻擊力的技能也有很多，$R;" +
                                                     "所以不會比其他職業遜色唷!$R;" +
                                                     "$R能把對方打飛的$R;" +
                                                     "「衝擊之箭」真是厲害啊!$R;", "弓手前輩");
                                break;
                        }

                        selection = Select(pc, "想聽哪種的說明呢?", "", "戰士系的特徵", "「劍士」是?", "「騎士」是?", "「盜賊」是?", "「弓手」是?", "不用了");
                    }
                    break;
                    
                case 2:
                    break;
            }  
        }
    }
}
