using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
//所在地圖:奧克魯尼亞東部平原(10025001) NPC基本信息:要憑依的女孩(11000944) X:177 Y:105
namespace SagaScript.M10025001
{
    public class S11000944 : Event
    {
        public S11000944()
        {
            this.EventID = 11000944;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Beginner_02> Beginner_02_mask = new BitMask<Beginner_02>(pc.CMask["Beginner_02"]);

            int selection;

            if (!Beginner_02_mask.Test(Beginner_02.已經與要憑依的女孩進行第一次對話))
            {
                初次與要憑依的女孩進行對話(pc);
            }
            else
            {
                Say(pc, 11000944, 131, "要再說一遍嗎?$R;", "要憑依的女孩");
            }

            selection = Select(pc, "想問有關憑依的消息嗎?", "", "關於憑依系統", "有什麼優點", "憑依時的注意事項", "憑依後可以和不可以做的事情", "登出的話該怎麼辦", "沒什麼想問的");

            while (selection != 6)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11000944, 131, "所謂的「憑依」是指靈魂和身體脫離後，$R;" +
                                               "靈魂附著在武器或防具或飾品的意思。$R;" +
                                               "$R在那個狀態下，$R;" +
                                               "只要有人佩帶或穿上那件裝備的話，$R;" +
                                               "就會一起行動了喔!$R;" +
                                               "$P對自己點擊滑鼠右鍵後，$R;" +
                                               "選擇「憑依自己」，$R;" +
                                               "或者用滑鼠右鍵點擊對像，$R;" +
                                               "選擇「憑依別人」，$R;" +
                                               "就可以了。$R;" +
                                               "$P直接憑依在對方或自己的裝備上時，$R;" +
                                               "效果是一樣的唷。$R;" +
                                               "$P可以憑依的裝備種類有，$R;" +
                                               "「上衣」「右手」「左手」$R;" +
                                               "以及「胸部飾品」這4個地方。$R;" +
                                               "$P憑依裝備在裝備視窗裡顏色不一樣，$R;" +
                                               "所以一眼就能看出來呀!$R;" +
                                               "$P一個人身上最多只可以憑依3個人。$R;" +
                                               "$R所以看起來雖然是一個人，$R;" +
                                               "但實際上有可能是4個人唷!$R;", "要憑依的女孩");
                        break;

                    case 2:
                        Say(pc, 11000944, 131, "憑依的人…$R;" +
                                               "就是指憑依的對象，$R;" +
                                               "打敗魔物得到經驗值的話。$R;" +
                                               "$R憑依的人就可獲得「憑依經驗值」唷!$R;" +
                                               "$P但如果是像花、草之類的「材料魔物」，$R;" +
                                               "是無法得到經驗值的呀…$R;" +
                                               "$R所以也無法獲得「憑依經驗值」。$R;" +
                                               "$P想升級的話，$R;" +
                                               "不應該打「材料魔物」，$R;" +
                                               "而應該打其他經驗值高的魔物啊!$R;", "要憑依的女孩");

                        Say(pc, 11000945, 131, "還有憑依時，$R;" +
                                               "憑依的人的HP值/MP值/SP值，$R;" +
                                               "會自然恢復的呀!$R;" +
                                               "$R所以使用魔法時，憑依會更有利唷!$R;" +
                                               "$P而且有憑依的裝備是不會損壞的!$R;" +
                                               "$R面對強大敵人時，$R;" +
                                               "這一點不是更有利嗎?$R;", "憑依對象女孩");
                        break;

                    case 3:
                        Say(pc, 11000944, 131, "如果憑依對象和憑依者的$R;" +
                                               "等級相差太多的話，$R;" +
                                               "是無法進行憑依的唷!$R;" +
                                               "$R所以在憑依前，$R;" +
                                               "最好先確認一下對方的等級。$R;" +
                                               "$P還有…$R;" +
                                               "$R即使憑依了也不能算絕對安全，$R;" +
                                               "因為憑依的地方不同，$R;" +
                                               "受到傷害的情況，也會有所不同呀!$R;" +
                                               "$P憑依在HP值低的人身上時，$R;" +
                                               "要多注意唷!$R;" +
                                               "$P還有憑依的人，使用魔法或技能時，$R;" +
                                               "MP值/SP值的消耗量會增加的。$R;" +
                                               "$P如果只能自然恢復的話，$R;" +
                                               "過分使用的時候，就會很浪費的。$R;", "要憑依的女孩");
                        break;

                    case 4:
                        Say(pc, 11000944, 131, "就算是憑依中也可以使用道具唷!$R;" +
                                               "$R使用的道具效果，$R;" +
                                               "會生效在憑依對象上的。$R;" +
                                               "$P也就是憑依者使用恢復藥物的話，$R;" +
                                               "恢復的會是憑依對象喔!$R;" +
                                               "$R使用魔法時，$R;" +
                                               "同樣憑依者是不會恢復的。$R;" +
                                               "$P但有一些技能，憑依期間是無法使用的呀!$R;" +
                                               "$R所以使用前先確認一下$R;" +
                                               "技能說明比較好唷!$R;" +
                                               "$P還有憑依中是無法撿道具的，$R;" +
                                               "也不能跟NPC說話喔!$R;" +
                                               "$R想對話的時候得先把憑依解除啊!$R;", "要憑依的女孩");
                        break;

                    case 5:
                        Say(pc, 11000944, 131, "在憑依成裝備的狀態下登出的話，$R;" +
                                               "裝備也不會消失的喔!$R;" +
                                               "$P比如說，$R;" +
                                               "憑依在自己裝備後，再登出的話。$R;" +
                                               "$R雖然無法親眼看到，$R;" +
                                               "但是憑依的裝備，$R;" +
                                               "會暫時留在原來的地方唷!$R;" +
                                               "$P假設有誰使用那裝備的話，$R;" +
                                               "憑依裝備還是會留在遊戲裡的。$R;" +
                                               "$R如果沒有人使用那憑依裝備的話，$R;" +
                                               "過一段時間就會在遊戲中消失。$R;" +
                                               "$P就算有人使用$R;" +
                                               "那裝備也不會成為別人的東西，$R;" +
                                               "所以您大可放心。$R;" +
                                               "$R下次再登入的時候，$R;" +
                                               "那憑依道具會再次回到身上的。$R;" +
                                               "$P還有登出的時候，$R;" +
                                               "憑依的武器或者是您，$R;" +
                                               "都不會受到傷害的。$R;" +
                                               "$R所以不用擔心別人使用您的裝備呀!$R;", "要憑依的女孩");
                        break;
                }

                selection = Select(pc, "想問有關憑依的消息嗎?", "", "關於憑依系統", "有什麼優點", "憑依時的注意事項", "憑依後可以和不可以做的事情", "登出的話該怎麼辦", "沒什麼想問的");
            }
        }

        void 初次與要憑依的女孩進行對話(ActorPC pc)
        {
            BitMask<Beginner_02> Beginner_02_mask = new BitMask<Beginner_02>(pc.CMask["Beginner_02"]);

            Beginner_02_mask.SetValue(Beginner_02.已經與要憑依的女孩進行第一次對話, true);

            Say(pc, 11000944, 131, "那就開始憑依了，千萬不要動啊!$R;", "要憑依的女孩");

            Say(pc, 11000945, 131, "知道了!$R;", "憑依對象女孩");

            Say(pc, 11000944, 131, "…??$R;" +
                                   "$R哎呀? 已經有人進去了?$R;" +
                                   "不能憑依啊?$R;", "要憑依的女孩");

            Say(pc, 11000945, 131, "…啊! 對不起、對不起!$R;" +
                                   "$R可能是因為這個項鏈吧!$R;" +
                                   "那是別人憑依的憑依裝備。$R;" +
                                   "$P是我在路上撿到的! 漂亮吧?$R;", "憑依對象女孩");

            ShowEffect(pc, 11000944, 4506);
            Wait(pc, 660);

            Say(pc, 11000944, 131, "應該早點說嘛?!$R;" +
                                   "$R…您好!$R;" +
                                   "有什麼要問的嗎?$R;", "要憑依的女孩");
        }   
    }
}
