using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;
//所在地圖:奧克魯尼亞東部平原(10025001) NPC基本信息:魔攻師前輩(11000953) X:153 Y:130
namespace SagaScript.M10025001
{
    public class S11000953 : Event
    {
        public S11000953()
        {
            this.EventID = 11000953;
        }

        public override void OnEvent(ActorPC pc)
        {
            int selection;

            Say(pc, 11000953, 131, "啊啊…是初心者啊!$R;" +
                                   "關於魔法系職業，有什麼要問的嗎?$R;", "魔攻師前輩");

            switch (Select(pc, "想問關於魔法系的消息嗎?", "", "好啊", "不用了"))
            {
                case 1:
                    selection = Select(pc, "想聽哪種的說明呢?", "", "魔法系的特徵", "「魔法師」是?", "「元素使」是?", "「祭司」是?", "「魔攻師」是?", "不用了");

                    while (selection != 6)
                    {
                        switch (selection)
                        {
                            case 1:
                                Say(pc, 11000950, 131, "那我開始說明吧!$R;" +
                                                       "$P魔法系是使用魔法技能的職業喔。$R;" +
                                                       "$R攻擊/補助/恢復/重生…$R;" +
                                                       "不同的職業，使用的魔法也不一樣。$R;" +
                                                       "$P雖然有幾個職業$R;" +
                                                       "可以得到貴重的「知識技能」，$R;" +
                                                       "但是相對的採集能力並不怎麼高呀!$R;" +
                                                       "$R可以搬運的行李數量也不多，$R;" +
                                                       "所以跟同伴一起行動比較好。$R;", "魔法師前輩");
                                break;

                            case 2:
                                Say(pc, 11000950, 131, "由我來介紹「魔法師」吧!$R;" +
                                                       "$P「魔法師」可以使用叫做$R;" +
                                                       "「新生魔法」的無屬性魔法喔!$R;" +
                                                       "$P因為不受屬性的影響，$R;" +
                                                       "因此不論在哪，都可以發揮穩定的威力。$R;" +
                                                       "$P使用異常狀態捉弄敵人，$R;" +
                                                       "或支援同伴的技能也有很多。$R;" +
                                                       "$R製作小分身的 「魔法師的殘象」，$R;" +
                                                       "不僅是看起來有趣，$R;" +
                                                       "而且用起來也很方便的技能唷!$R;", "魔法師前輩");
                                break;

                            case 3:
                                Say(pc, 11000951, 0, "由我來介紹「元素使」吧!$R;" +
                                                     "$P「元素使」是使用$R;" +
                                                     "$R火/水/風/土的四種屬性魔法喔!$R;" +
                                                     "$R光屬性魔法是「祭司」專用的，$R;" +
                                                     "而闇屬性魔法是「魔攻師」專用的。$R;" +
                                                     "$P元素使可以學到賦予屬性的支援技能，$R;" +
                                                     "可以讓我方成員實力增強唷!$R;" +
                                                     "$P施放四種屬性的範圍魔法，$R;" +
                                                     "真的很痛快呀!$R;", "元素使前輩");
                                break;

                            case 4:
                                Say(pc, 11000952, 0, "由我來介紹「祭司」吧!$R;" +
                                                     "$P「祭司」是光屬性的獨特職業喔!$R;" +
                                                     "$P主要學習恢復/支援系的技能唷!$R;" +
                                                     "$P單獨戰鬥的話，會有點困難呀，$R;" +
                                                     "所以主要擔任治療同伴的角色。$R;" +
                                                     "$R擁有很多能解除狀態異常的魔法，$R;" +
                                                     "即使隊伍裡只有一個祭司也沒問題。$R;", "祭師前輩");
                                break;

                            case 5:
                                Say(pc, 11000953, 131, "由我來介紹「魔攻師」吧!$R;" +
                                                       "$P「魔攻師」是闇屬性的獨特職業。$R;" +
                                                       "$R是魔法系中唯一可以使用防禦技能的，$R;" +
                                                       "魔攻師能熟練地使用短劍和鎚矛，$R;" +
                                                       "即使在近距離，$R;" +
                                                       "也可以使用高級魔法的魔法使用者。$R;", "魔攻師前輩");
                                break;
                        }

                        selection = Select(pc, "想聽哪種的說明呢?", "", "魔法系的特徵", "「魔法師」是?", "「元素使」是?", "「祭司」是?", "「魔攻師」是?", "不用了");
                    }
                    break;

                case 2:
                    break;
            }
        }
    }
}
