
using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaDB.Item;
using SagaMap.Scripting;
using SagaDB;
using SagaScript.Chinese.Enums;
using WeeklyExploration;
using System.Globalization;
namespace SagaScript.M30210000
{
    public class S60000009 : Event
    {
        public S60000009()
        {
            this.EventID = 60000009;
        }
        private void 魔导师转职任务4(ActorPC pc)
        {
            Say(pc, 0, "啊啊啊，到底上哪去了。", "慌乱的元素使·星麻麻");
            Say(pc, 0, "难道是我被抛弃了吗？！？！", "慌乱的元素使·星麻麻");
            Say(pc, 0, "不，不可能的，怎么会这样呢？", "慌乱的元素使·星麻麻");
            Select(pc, " ", "", "那个，我……");
            Say(pc, 0, "小吱啊！！！", "慌乱的元素使·星麻麻");
            Say(pc, 0, "什么啊，是冒险者啊。", "慌乱的元素使·星麻麻");
            Say(pc, 0, "不好意思啊，我现在有事要忙，$R没办法倾听你的诉求。", "慌乱的元素使·星麻麻");
            Select(pc, " ", "", "？？？一脸懵逼。");
            Say(pc, 0, "嘎哦！！", "慌乱的元素使·星麻麻");
            Select(pc, " ", "", "（给她看禁断之书）");
            Say(pc, 0, "这个是……$R$R这不是老夏很久之前就遗失的禁断之书吗？$R你在哪弄到的啊？", "慌乱的元素使·星麻麻");
            Select(pc, " ", "", "我想要成为魔法师，是夏影让我来找你学习。");
            Say(pc, 0, "这样啊，$R$R可是冒险者，我现在真的腾不开手，$R所以没有办法，除非……", "慌乱的元素使·星麻麻");
            Say(pc, 0, "除非你能帮个我忙！", "慌乱的元素使·星麻麻");
            if (Select(pc, " ", "", "哈？", "好吧。") == 2)
            {
                Say(pc, 0, "谢谢，$R其实挺不好意思的，$R本该是我自己来处理的事情……", "慌乱的元素使·星麻麻");
                Say(pc, 0, "我有一个搭档，名叫小吱，$R前几天，她突然失踪了。", "慌乱的元素使·星麻麻");
                Say(pc, 0, "鱼缸岛和城寨外我都已经找遍了，$R哪里都没有她的身影。", "慌乱的元素使·星麻麻");
                Say(pc, 0, "我想，她可能是跑到更远的地方去了。", "慌乱的元素使·星麻麻");
                Say(pc, 0, "更远的地方，$R就是靠近法伊斯特的区域了，$R$R万一小吱要是出了什么事的话……", "慌乱的元素使·星麻麻");
                Say(pc, 0, "冒险者，$R你替我去$CR哞哞草原$CD找找小吱吧，$R$R她是一位有着长长耳朵，$R浑身通黄的沙鼠。", "慌乱的元素使·星麻麻");
                Say(pc, 0, "对了，$R她可能已经饿上好几天了，$R请带上这些食物去找它吧。", "慌乱的元素使·星麻麻");
                GiveItem(pc, 10104406, 5);//谷物种子
                GiveItem(pc, 10104404, 5);//果物种子
                pc.CInt["魔导师转职任务"] = 5;
                return;
            }
            else
                Say(pc, 0, "为什么我还没说内容你就觉得Hard了呢？", "慌乱的元素使·星麻麻");
            return;
        }
        private void 魔导师转职任务7(ActorPC pc)
        {
            if (CountItem(pc, 140000001) >= 1)//检测道具
            {
                Say(pc, 0, "怎么样，$R找到小吱了吗？", "慌乱的元素使·星麻麻");
                Select(pc, " ", "", "她说……让我把这个给你看。");
                TakeItem(pc, 140000001, 1);//收走 沙鼠的护身符
                pc.CInt["魔导师转职任务"] = 8;
                Say(pc, 0, "这是……唔……$R……嗯嗯……哦！？", "慌乱的元素使·星麻麻");
                Say(pc, 0, "是这么回事啊，$R我差点都忘了这回事了，$R哎呀……瞧我这记性。", "慌乱的元素使·星麻麻");
                Say(pc, 0, "唔……咳咳，$R$R言归正传，$R你是受老夏的委托来找我的吧？$R具体是什么事呢？", "认真的元素使·星麻麻");
                Select(pc, " ", "", "关于寒冰魔法与火焰魔法的使用心得。");
                Say(pc, 0, "啊，是元素系的魔法……", "认真的元素使·星麻麻");
                Say(pc, 0, "通俗点讲，$R$R就是用指定一个区域，$R用魔力去控制它的状况。", "认真的元素使·星麻麻");
                Say(pc, 0, "魔法师施法需要借助媒介，$R$R比如以空气为媒介点，$R用魔力去驱动，$R改变它的构造，它就会发生燃烧。", "认真的元素使·星麻麻");
                Say(pc, 0, "当然，$R$R这属于一种违背大自然的行为，$R$R如果魔力不足，或者控制不好就会被吞噬。", "认真的元素使·星麻麻");
                Say(pc, 0, "比如在极寒的北方施展水属性魔法，$R$R若是魔力不够强大，$R就会被吞噬，结成冰块……", "认真的元素使·星麻麻");
                Say(pc, 0, "对了，$R$R我将说明记录在禁断之书上，$R你可以慢慢研究。", "认真的元素使·星麻麻");
                Say(pc, 0, "比起说明，$R不如亲眼见识一下比较容易理解。", "认真的元素使·星麻麻");
                Say(pc, 0, "比如，$R$R令你周围空气中的水份聚集、凝结……", "认真的元素使·星麻麻");
                ShowEffect(pc, 4021);
                Wait(pc, 3000);
                Say(pc, 0, "就像这样啦。", "认真的元素使·星麻麻");
                Say(pc, 0, "咦，对不起！！$R弄湿你的衣服了。", "认真的元素使·星麻麻");
                Say(pc, 0, "那么……我帮你烘干吧，$R这次是用火属性魔法……", "认真的元素使·星麻麻");
                ShowEffect(pc, 4242);
                Wait(pc, 2000);
                Select(pc, " ", "", "……（阿嚏）");
                Say(pc, 0, "……咦？$R衣服还没干吗？再来一次！", "认真的元素使·星麻麻");
                ShowEffect(pc, 4242);
                ShowEffect(pc, 4264);
                Wait(pc, 2000);
                Say(pc, 0, "这样应该好了吧？", "认真的元素使·星麻麻");
                Say(pc, 0, "总之要记住一句话：$R$R魔法就是用自己的魔力去操纵周遭的事物，$R使它们如自己愿地产生变化。", "认真的元素使·星麻麻");
                Say(pc, 0, "那么我把详细的心得$R记到你的禁断之书上了咯。", "认真的元素使·星麻麻");
                ShowEffect(pc, 4274);
                Wait(pc, 2000);
                Say(pc, 0, "这样就可以了，你可以回去找老夏啦。", "认真的元素使·星麻麻");
                Select(pc, " ", "", "……感觉心里很不是滋味。");
                Say(pc, 0, "你说什么？", "认真的元素使·星麻麻");
                Select(pc, " ", "", "没什么，感谢您的指导。");
                Say(pc, 0, "不客气，$R因为你是老夏推荐的人嘛，嘎哈哈~~", "认真的元素使·星麻麻");
                return;
            }
            else
                Say(pc, 0, "怎么样，$R找到小吱了吗？", "慌乱的元素使·星麻麻");
            return;
        }
        public override void OnEvent(ActorPC pc)
        {
            if (pc.CInt["羽川柠技能点任务标记"] == 1 && pc.CInt["黑暗料理1任务技能点获得"] == 1)
                TitleProccess(pc, 7, 1);//称号补领

            if (pc.CInt["魔导师转职任务"] == 4 || pc.CInt["魔导师转职任务"] == 5 || pc.CInt["魔导师转职任务"] == 7 || pc.CInt["魔导师转职任务"] == 8)
            {
                switch (pc.CInt["魔导师转职任务"])
                {
                    case 4:
                        魔导师转职任务4(pc);
                        return;
                    case 5:
                        Say(pc, 0, "冒险者，$R你替我去$CR哞哞草原$CD找找小吱吧，$R$R她是一位有着长长耳朵，$R浑身通黄的沙鼠。", "慌乱的元素使·星麻麻");
                        Say(pc, 0, "对了，$R她可能已经饿上好几天了，$R请带上这些食物去找它吧。", "慌乱的元素使·星麻麻");
                        return;
                    case 7:
                        魔导师转职任务7(pc);
                        return;
                    case 8:
                        Say(pc, 0, "这样就可以了，你可以回去找老夏啦。", "认真的元素使·星麻麻");
                        return;
                }
            }
            if (pc.CInt["黑暗料理1任务标记"] < 1)//检查任务标记
            {
                Say(pc, 0, "啊……呜呜呜，不行了，$R头晕目眩，饥肠辘辘，我要死了。", "快要饿死的元素使·星麻麻");
                Say(pc, 0, "麻麻！！$R你再坚持一会！！饭马上就做好了。", "认真做料理的祭司·兔麻麻");
                Say(pc, 0, "（小声）$R那啥..料理的材料不够了，$R估计没那么快做好……", "黑暗料理使大乌贼·番茄茄");
                Say(pc, 0, "？！你说什么？", "认真做料理的祭司·兔麻麻");
                Say(pc, 0, "再这样下去麻麻会饿死的，怎么办？", "认真做料理的祭司·兔麻麻");
                Say(pc, 0, "呜呜呜——", "快要饿死的元素使·星麻麻");
                Say(pc, 0, "既然这样，就只好……", "黑暗料理使大乌贼·番茄茄");
                Say(pc, 0, "啊，$R冒险者，你来得正好，$R你有没有兴趣……", "认真做料理的祭司·兔麻麻");
                if (Select(pc, " ", "", "没有，快滚。", "什么事呀？") == 2)
                {
                    Say(pc, 0, "我们本来是打算去见一个人，$R但是我们想要填饱肚子再出发。", "认真做料理的祭司·兔麻麻");
                    Say(pc, 0, "你也看到了，我们这边料理不太顺利，$R所以能不能请你帮忙……", "认真做料理的祭司·兔麻麻");
                    Say(pc, 0, "那么就请你帮忙收集$R200条「$CO干鱼$CD」、$R50个「$CO危险的蘑菇$CD」、$R50只「$CO星点河鲀$CD」，$R并将这些材料制成10个「$CR蘑菇海鲜汤？$CD」吧，$R拜托了！", "黑暗料理使大乌贼·番茄茄");
                    Say(pc, 0, "？！", "认真做料理的祭司·兔麻麻");
                    Say(pc, 0, "等等等等，这些食材真的能吃吗？！$R不会死人吗？", "认真做料理的祭司·兔麻麻");
                    Say(pc, 0, "兔麻麻，你不相信我了吗？$R$R即使河鲀有毒，料理方法对了也是可以安全食用的，$R而且很美味哦。", "黑暗料理使大乌贼·番茄茄");
                    Say(pc, 0, "那「危险的蘑菇」呢？", "认真做料理的祭司·兔麻麻");
                    Say(pc, 0, "喔，$R它只是看上去颜色比较鲜艳，$R实际上是无毒的，$R而且味道比一般蘑菇鲜美哦~", "黑暗料理使大乌贼·番茄茄");
                    Say(pc, 0, "…………", "认真做料理的祭司·兔麻麻");
                    Say(pc, 0, "那么，冒险者，拜托你了！", "黑暗料理使大乌贼·番茄茄");
                    pc.CInt["黑暗料理1任务标记"] = 1;//任务标记
                    return;//结束脚本
                }
            }
            else if (pc.CInt["黑暗料理1任务标记"] == 1)//检查任务标记
            {
                if (CountItem(pc, 110056100) >= 10)//检查玩家身上的蘑菇海鲜汤大于等于3
                {
                    Say(pc, 0, "嗯？已经弄好了？好快啊。", "黑暗料理使大乌贼·番茄茄");
                    Say(pc, 0, "星麻麻，醒醒，开饭了。", "黑暗料理使大乌贼·番茄茄");
                    Say(pc, 0, "唔？……$R$R我是谁，我在哪？$R我在这里是要做什么？", "快要饿死的元素使·星麻麻");
                    Say(pc, 0, "麻麻已经神志不清啦！！", "认真做料理的祭司·兔麻麻");
                    Say(pc, 0, "不要死啊，$R先喝碗汤撑一会，我们的饭马上就好了。", "黑暗料理使大乌贼·番茄茄");
                    Say(pc, 0, "唔唔……哦……$R$R（咕噜 咕噜）", "快要饿死的元素使·星麻麻");
                    Say(pc, 0, "唔？！$R这个汤是！！", "吃惊的元素使·星麻麻");
                    Say(pc, 0, "美味，$R鲜美的味道，蘑菇柔滑的口感，$R煮到恰好的鱼肉。$R$R我从未喝过如此好喝的汤！！$R感觉能再喝三碗！！", "突然兴奋的元素使·星麻麻");
                    Say(pc, 0, "还有吗？", "突然兴奋的元素使·星麻麻");
                    Select(pc, " ", "", "有有有");
                    if (pc.CInt["黑暗料理1任务技能点获得"] != 1)//检查记录
                    {
                        Say(pc, 0, "看来星麻麻很满意的样子呢，$R那么，作为报酬，$R这个给你！", "黑暗料理使大乌贼·番茄茄");
                        TakeItem(pc, 110056100, 10);
                        pc.SkillPoint3 += 1;//得到一个技能点
                        SagaMap.Network.Client.MapClient.FromActorPC(pc).SendPlayerInfo();//发送玩家信息封包
                        ShowEffect(pc, 4131);//显示特效，ID4131
                        pc.CInt["黑暗料理1任务技能点获得"] = 1;//技能点获取标记
                        Say(pc, 0, "获得了1点技能点", " ");
                        Say(pc, 0, "我也用东西给你！！", "认真做料理的祭司·兔麻麻");
                        Say(pc, 0, "得到了『圣疗术』进阶秘籍");
                        pc.CInt["圣疗术任务"] = 1;
                        GiveItem(pc, 910000099, 1);
                        Wait(pc, 1000);
                        Say(pc, 0, "啊，$R吃饱啦，心满意足。", "一本满足的元素使·星麻麻");
                        Say(pc, 0, "……！$R$R这个感觉是……", "一本满足的元素使·星麻麻");
                        Say(pc, 0, "肚子…好痛……", "突然肚痛的元素使·星麻麻");
                        Say(pc, 0, "呜……$R呃啊啊……$R$R要死了……", "突然肚痛的元素使·星麻麻");
                        Say(pc, 0, "麻麻？麻麻！！！！", "认真做料理的祭司·兔麻麻");
                        Say(pc, 0, "不要死啊！！！", "认真做料理的祭司·兔麻麻");
                        if (pc.CInt["羽川柠技能点任务标记"] == 1)
                            TitleProccess(pc, 7, 1);
                    }
                    pc.CInt["黑暗料理1任务标记"] = 2;//任务标记
                    return;//结束脚本
                }
                else//材料不够的话
                {
                    Say(pc, 0, "是用$R200条「干鱼」、$R50个「危险的蘑菇」、$R50只「星点河鲀」，$R制成的10个「$CR蘑菇海鲜汤？$CD」哦，$R拜托了！", "黑暗料理使大乌贼·番茄茄");
                    return;
                }
            }
            Say(pc, 0, "还没煮好吗？$R我快要饿死了呀！！$R$R咕噜噜…", "做料理的元素使");
        }
    }
}