
using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaDB.Item;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
using WeeklyExploration;
using System.Globalization;
namespace SagaScript.M30210000
{
    public class S60000004 : Event
    {
        public S60000004()
        {
            this.EventID = 60000004;
        }

        public override void OnEvent(ActorPC pc)
        {
            if (pc.CInt["圣疗术任务"] == 1 && CountItem(pc, 910000099) > 0)
            {
                Say(pc, 60000004, 131, "有什么事么？", "疾风队长");
                if (Select(pc, "怎么办呢", "", "问关于「进阶圣疗术秘籍」的事情", "没事") == 1)
                {
                    Say(pc, 131, "（疾风结果书看了一眼）");
                    Say(pc, 131, "（然后还给了你）");
                    Say(pc, 131, "……", "疾风队长");
                    Say(pc, 131, "去使用1500次『圣疗术』吧", "疾风队长");
                    Select(pc, "……", "", "啊？？？");
                    Say(pc, 131, "这部书只有在你$R使用1500次『圣疗术』后才能读懂", "疾风队长");
                    Select(pc, "……", "", "？？？");
                    Say(pc, 131, "快去吧。", "疾风队长");
                    pc.CInt["圣疗术任务"] = 2;
                }
                return;
            }

            Say(pc, 60000004, 131, "喂，你很面生啊，$R是第一次来$CC「鱼缸岛」$CD吗？", "疾风队长");
            Say(pc, 60000004, 131, "嚯..你叫「" + pc.Name + "」啊，不错的名字呢。", "疾风队长");
            Say(pc, 60000004, 131, "那么，我给你介绍一下岛上的设施吧。", "疾风队长");
            Say(pc, 60000004, 131, "从这里往左走，你会看到$R$CC「职业变更师·水琴」$CD$R$CC「书页管理员·伊利斯」$CD", "疾风队长");
            Say(pc, 60000004, 131, "水琴是负责更换职业的，$R如果你想体验不同的职业，不妨去找她聊聊吧。$R$R伊利斯则是负责管理书页（※尚未开放），$R在各处收集到的书页碎片，$R可以交给她兑换成积分，$R而积分又可以用来兑换别的书页。", "疾风队长");
            Say(pc, 60000004, 131, "往右走就是$R$CC「强化师·机械狐狸B3」$CD$R$CC「柏拉丁」$CD$R$CC「发型扭蛋机」$CD$R$CC「KUJI扭蛋机」$CD所在的地方。", "疾风队长");
            Say(pc, 60000004, 131, "想要使装备变得更强，$R就去找机械狐狸B3吧，$R不过，要当心那家伙，$R一不小心就整个人财两空辣！！", "疾风队长");
            Say(pc, 60000004, 131, "帕拉丁是出售各种有用的道具的商人$R（※尚未开放x2），$R也有传言说他开的价$R比起其它地方来都要黑心。$R$R他旁边的三个机器，$R据说也是由他负责的，$R可以通过咖啡馆的任务$R获取机器用的代币，进行抽奖。", "疾风队长");
            Say(pc, 60000004, 131, "说到$CC咖啡馆$CD，就是水琴上方的房子，$R进入传送点后可以看到咖啡馆的小妹，$R她会给你派发各种任务。", "疾风队长");
            Say(pc, 60000004, 131, "在另一侧，机械狐狸B3上方的房子，$R是$CC卡片研究所$CD（※尚未开放x3）$R$R在别处得到封印卡片后可以去那边使用，$R此外，$CC「卡片大师·八咫乌」$CD$R还提供为装备扩充卡片槽的服务。", "疾风队长");
            Say(pc, 60000004, 131, "最后就是中央的房子，是这座岛屿的主人，$R也就是$CC「鱼缸团团长·暗鸣」$CD的所在地，$R可以绕到他身后爆...$R$R咳咳，$R可以通过他身后的密道，$R前往另外三个岛屿。", "疾风队长");
            Say(pc, 60000004, 131, "三座岛屿分别是$R$CC「中立岛」$CD$R$CC「海盗岛」$CD$R$CC「圣女岛」$CD$R$R中立岛和海盗岛尚在施工中，无法进入，$R圣女岛则居住着两位萌妹子。", "疾风队长");
            Say(pc, 60000004, 131, "她们分别是$R$CC「服装染色娘·艾莉婕」$R「发型师·芽衣」$CD。$R她们提供道具染色和更换发型的服务，$R有需要的话，请过去看看吧。", "疾风队长");
            Say(pc, 60000004, 131, "哦，差点忘了自我介绍了，$R我是$CC「讨伐队队长·疾风」$CD。$R那么介绍就到这了，$R希望你在$CC「鱼缸岛」$CD过得开心。", "疾风队长");

        }
    }
}