using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaScript.Chinese.Enums;
using SagaDB.Quests;
namespace SagaScript.M12002102
{
    public class S11001589 : Event
    {
        public S11001589()
        {
            this.EventID = 11001589;
            this.notEnoughQuestPoint = "哎呀，剩余的任务点数是0啊$R;" +
                "下次再来吧$R;";
            this.leastQuestPoint = 1;
            this.questFailed = "失败了?$R;" +
                "$R真是遗憾啊$R;" +
                "下次可一定要成功$R;";
            this.alreadyHasQuest = "任务顺利吗?$R;";
            this.gotNormalQuest = "那拜托了$R;" +
                "$R等任务结束后，再来找我吧;";
            this.gotTransportQuest = "是啊，道具太重了吧$R;" +
                "所以不能一次交付的話$R;" +
                "分几次给就行了;";
            this.questCompleted = "真是辛苦了$R;" +
                "$R任务成功了$R來！这是你的！;";
            this.transport = "哦哦…全部拿来了嗎?;";
            this.questCanceled = "嗯…如果是你，我相信你能做到的$R;" +
                "很期待呢……;";
            this.questTooEasy = "唔…但是对你来说$R;" +
                "也许是很简单的事情$R;" +
                "$R那样也没关系吗?$R;";
        }

        public override void OnEvent(ActorPC pc)
        {
            {

                Say(pc, 131, "终于来了。$R;" +
                "异世界的战士…。$R;" +
                "$P我是「反抗军」战士。$R;" +
                "$R为了从侵略者手上保护这个世界$R;" +
                "采取行动。$R;" +
                "$P那里的坐飞空艇$R;" +
                "可以去阿克罗尼亚大陆本土$R;" +
                "要去吗……。$R;" +
                "$R在那之前、听我说明下。$R;" +
                "$P新生的你$R;" +
                "就像婴儿一样。$R;" +
                "$R就让我来指导你吧$R;", "抵抗军通信员");
                switch (Select(pc, "怎么样？", "", "任务", "CP任务", "询问战场冠军", "有关抵抗运动?", "最开始推荐攻击的敌人？", "关于周边的魔物", "什么都不做"))
                {
                    case 1:
                        Say(pc, 131, "小战士。$R;" +
                        "$R愿你高贵的灵魂$R;" +
                        "不要被这世界污染了……。$R;", "抵抗军通信员");
                        HandleQuest(pc, 61);
                        break;
                    case 2:
                        Say(pc, 131, "我们的工作$R;" +
                        "不止是和侵略者战斗这么简单。$R;" +
                        "$R包括击退袭击人的$R;" +
                        "危险的魔物、$R;" +
                        "物资的保障、搬运也是重要的任务。$R;" +
                        "$P不止是团员$R;" +
                        "我们需要大量协助者$R;" +
                        "也务必请你借予我们力量。$R;" +
                        "$P另外，生产系职业的冒险者的话$R;" +
                        "我们还准备了其他的工作。$R;" +
                        "$R详细说明请从「通信员」处$R;" +
                        "听取。$R;", "抵抗運動接待處");
                        Say(pc, 131, "这个任务会消耗$R;" +
                        "『２』点剩余任务点数。$R;", "抵抗军通信员");

                        Say(pc, 131, "小战士啊。$R;" +
                        "$R愿你高贵的灵魂$R;" +
                        "不要被这个世界污染了……。$R;", "抵抗军通信员");
                        HandleQuest(pc, 253);
                        
                        break;
                    case 3:
                        Say(pc, 131, "战场冠军$R;" +
                        "在这个世界只存在10人$R;" +
                        "是一些拥有着特殊能力的人。$R;" +
                        "$P详细信息请咨询总部前面$R;" +
                        "的掲示板的掲示板旁边的$R;" +
                        "戦の調律者$R;", "抵抗军通信员");
                        break;

                    case 4:
                        Say(pc, 131, "我们与侵略者战斗$R;" +
                        "继续着将夺回「阿克罗波利斯」为目标$R;" +
                        "的抵抗运动。$R;" +
                        "$P如果你对此有兴趣$R;" +
                        "就到设立在「西部要塞」$R;" +
                        "的总部报道吧。$R;" +
                        "$P西部要塞的话$R;" +
                        "要从这里乘坐飞空庭$R;" +
                        "从阿克罗尼亚经过$R;" +
                        "再穿越沙漠就能到达了。$R;" +
                        "$P西部要塞附近$R;" +
                        "虽说还算安全，但是$R;" +
                        "途中可能会出现危险的魔物。$R;" +
                        "$P也可以绕道通过，不过$R;" +
                        "如果被缠住了的话$R;" +
                        "可以骑上一个「骑乘宠物」$R;" +
                        "来继续移动哦。$R;", "抵抗军通信员");
                        break;
                    case 5:
                        Say(pc, 131, "ＬＶ１～：馬路斯$R;" +
                        "ＬＶ５～：ピヨピヨ$R;" +
                        "ＬＶ８～：ゴーチン$R;" +
                        "ＬＶ１３～：マスケシュピンネ$R;" +
                        "ＬＶ１６～：ルナティック$R;", "抵抗军通信员");
                        break;
                    case 6:
                        Say(pc, 131, "如果还有「剩余任务点」的话$R;" +
                        "首先可以在我这里领取$R;" +
                        "能做的任务。$R;" +
                        "$R适合你的任务$R;" +
                        "是用黄色表示的。$R;" +
                        "$P要是没有剩余任务点了的话$R;" +
                        "就和这个岛的苹果……呃，不是，失敬。$R;" +
                        "$R就和「山荆子」战斗吧。$R;" +
                        "$P山荆子是$R;" +
                        "道米尼界最弱的魔物。$R;" +
                        "就好比在埃米尔世界的话就是「皮露露」。$R;" +
                        "$P升级了之后$R;" +
                        "就请挑战一下「小咕咕鸡」吧。$R;" +
                        "$R比山荆子要强一些，不过$R;" +
                        "应该也不是无法战胜的敌人。$R;" +
                        "$P从那边那个飞空庭开始$R;" +
                        "跨过阿克罗尼亚大陆，$R;" +
                        "因为有山荆子和小咕咕鸡$R;" +
                        "想早点跨过大陆的人就是$R;" +
                        "先前进也没什么问题。$R;" +
                        "$P只不过，前方是PvP区域。$R;" +
                        "是力量决定一切的道米尼的大地。$R;" +
                        "$RＬＶ５以上后就会$R;" +
                        "成为可以PvP的对象$R;" +
                        "因此需要注意周围的状况。$R;" +
                        "$P跨过大陆之后$R;" +
                        "抵抗运动的势力就比较薄弱了$R;" +
                        "有避难用的帐篷。$R;" +
                        "$R帐篷中并不是PvP区域$R;" +
                        "$P里面也没有抵抗运动的团员$R;" +
                        "因此要是有困难的话，就请暂住里面吧。$R;", "抵抗军通信员");
                        break;

                }
            }
        }
    }
}
        
     
    