using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript.M50085000
{
    public class S11002174 : Event
    {
        public S11002174()
        {
            this.EventID = 11002174;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 131, "因为...是这样的$R;" +
            "$P…$R;" +
            "$P……$R;", "你好...");
            Select(pc, "说吧……？", "", "问候一下");
            ShowEffect(pc, 11002174, 4520);
            Wait(pc, 495);
            NPCMove(pc, 11002174, 350, 650, 45, MoveType.NONE);

            Say(pc, 131, "什么！？$R;" +
            "$P这里是什么地方...$R;" +
            "$R这里是实验室。$R;" +
            "对呀！曾经在这里研究关于「机械文明」的实验室。$R;" +
            "$P对了，这里...$R;" +
            "最近这里不知干什么...究竟他们目的是什么？$R;" +
            "$P或许，你不知道我在说什么$R;" +
            "但对你说的话$R;" +
            "这里是埃米尔世界的$R;" +
            "存在于中央城市街道的实验室。$R;", "？？？");

            Say(pc, 131, "「阿克罗波利斯」$R;" +
            "说起来...这个是世界第一大城市 — 真正的都市。$R;" +
            "$P当正调查遗迹的时候$R;" +
            "发现你正在昏迷...。$R;" +
            "$P就展开调查了你的身体$R;" +
            "其间发现了你是DEM...并且在调查当中发现了奇怪的结构。$R;" +
            "首先你的代谢对我们是一个惊奇的发现。$R;" +
            "$P身体就是机械$R;" +
            "$R能摄取食物及饮料,可以变成能源。$R;" +
            "可惜，你还需要呼吸空气...。$R;" +
            "简单地说$R;" +
            "$P食物和空气与人同样地是必然的。$R;" +
            "不过因为身体是机械，所以不可以凭依...$R;" +
            "$R对不起...$R;" +
            "还未自我介绍$R;" +
            "我是夸克博士。$R;" +
            "$P您好...$R;", "？？？");

            Say(pc, 131, "这里是电气实验室の$R;" +
            "实验室的负责人会$R;" +
            "$P帮助你$R;" +
            "因为他的兴趣只是发明机械。$R;" +
            "$P对DEM来说是令人害怕的$R;" +
            "那种感觉...$R;" +
            "好像不是个理由$R;" +
            "不过你就暂时在这个世界生活吧$R;" +
            "$R当到了适当的时候$R;" +
            "$P人间界、天上界这二个世界$R;" +
            "就会再喜欢你...$R;" +
            "$R欢迎你。$R;", "クォーク");

            Say(pc, 131, "我总在这里的$R;" +
            "如果你要维修机械$R;" +
            "$P你随时候也可以来的$R;" +
            "或者你…$R;" +
            "总之是关於DEM种族的事就来吧$R;" +
            "$P如果想到伤脑筋…$R;" +
            "请使用这个的。 $R;", "クォーク");

            GiveItem(pc, 10063701, 1);
            Say(pc, 0, 65535, "获得「DEM指导」。$R;", " ");

            Say(pc, 131, "使用这个的话...$R;" +
            "还有很多关于这个的说明$R;" +
            "$P是这样。$R;" +
            "这个需要一些东西$R;" +
            "$R我正在想...$R;" +
            "$P对了...那就是…$R;" +
            "谜一样的爱丽丝$R;" +
            "是怎么样的东西呢......$R;" +
            "$P好了$R;" +
            "$P我家里是在东南方的 ...$R;" +
            "要不要去看看，怎么样？$R;" +
            "$R试试看吧$R;", "夸克");

            pc.EP = 30;
            int oldMap = pc.CInt["Beginner_Map"];            
            Warp(pc, 10024000, 157, 157);
            DeleteMapInstance(oldMap);
        }
    }
}