
using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaDB.Item;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
using WeeklyExploration;
using System.Globalization;
namespace SagaScript.M30210000
{
    public partial class S80001700 : Event
    {
        public S80001700()
        {
            this.EventID = 80001700;
        }
        public override void OnEvent(ActorPC pc)
        {
            ChangeMessageBox(pc);
            if (pc.TInt["东牢D-1"] == 0)
            {
                if (pc.CInt["东牢D-1"] == 1)
                {
                    if (Select(pc, "你已经看过剧情了，是否跳过？", "", "跳过剧情", "继续看剧情") == 1)
                    {
                        CreateNpcPict(pc, 81000001, 60000006, 115, 251, 4, 300, 1, 111, 10);
                        NPCMove(pc, 81000001, 118, 228, 500, 4, 0xb, 366, 10, 0);
                        NPCMove(pc, 81000001, 118, 228, 500, 5, 0xb, 366, 10, 0);
                        NPCMove(pc, 80001700, 120, 226, 500, 1, 0xb, 366, 10, 0);
                        NPCMotion(pc, 80001700, 558, true, 10);
                        pc.TInt["东牢D-1"] = 1;
                        return;
                    }
                }
                Say(pc, 0, "小心一些，这里遍布着活死人。$R如果被它们盯上了会非常麻烦，我们没有时间浪费在它们身上。", "小莫");
                Say(pc, 0, "我们要找的魔狼一族就在洞穴的最深处。$R跟紧我，避开无谓的战斗……", "小莫");
                MovePC(pc, 119, 230, 500, 5, MoveType.RUN);
                Wait(pc, 3000);
                Say(pc, 0, "这可不行", "？？？");
                CreateNpcPict(pc, 81000001, 60000006, 115, 251, 4, 300, 1, 111, 10);
                NPCMove(pc, 81000001, 118, 228, 500, 4, 0xb, 366, 10, 0);
                Wait(pc, 5500);
                NPCMove(pc, 81000001, 118, 228, 500, 5, 0xb, 366, 10, 0);
                ShowEffect(pc, 118, 228, 1022);
                Wait(pc, 2500);
                NPCMove(pc, 80001700, 120, 226, 500, 1, 0xb, 366, 10, 0);
                ShowEffect(pc, 120, 226, 4340);
                Wait(pc, 2500);
                ShowEffect(pc, 120, 226, 5027);
                Say(pc, 81000001, 200, "我可不允许你就这样带着" + pc.Name + "走。", "？？？");
                Say(pc, 558, "！！", "小莫");
                Select(pc, " ", "", "……？！");
                NPCMotion(pc, 80001700, 558, true, 10);
                Say(pc, 65535, "呜呜……你，你是？放开我！", "小莫");
                Say(pc, 65535, "沙月？你这是做什么？", pc.Name);
                Say(pc, 65535, "请原谅我的唐突，因为事情太过蹊跷，我不能就这样袖手旁观。$R这位医生小姐实在是太过可疑了。", "沙月");
                Say(pc, 65535, "如果你没有来过这里，为什么会知道去往深处的道路？$R还能说出让人跟紧你这样的话呢？", "沙月");
                Say(pc, 65535, "而且，一个手无缚鸡之力的医生居然亲自来到这么危险的地方，$R不是太过可疑了吗？", "沙月");
                Say(pc, 65535, "在酒馆门口和" + pc.Name + "谈话时我就已经感觉不对劲了，$R为什么一个医生会知道这么多我们都不知道的关于东方地牢的事情？", "沙月");
                Say(pc, 65535, "我特地去询问了一直生活在鱼缸岛的夏影，$R她告诉我鱼缸岛上从来没有过医生，也没有所谓的高烧感染者。", "沙月");
                Say(pc, 65535, "因此我一路悄悄跟着你们，想要看看你究竟想做些什么。", "沙月");
                Say(pc, 65535, "居然一路跟着我们过来了吗？ 完全没注意到", pc.Name);
                Say(pc, 65535, "哼，似乎被你们小看了呢……$R我的幻象魔法，就算是沼跃鱼恐怕也不可能看穿，$R心思全都集中在其他事情上的你们就更不可能了。", "沙月");
                Say(pc, 65535, "好了，告诉我们吧，把他们带来这种地方，你究竟想要做什么？", "沙月");
                Wait(pc, 2000);
                Say(pc, 65535, "呜……", "小莫");
                Say(pc, 65535, "（小莫露出了放弃的表情）");
                Say(pc, 65535, "好吧，我会告诉你们真相的。$R但是请相信，我真的不是想要伤害你们。", "小莫");
                Say(pc, 65535, "我原本是生活在这座地牢中的莫库草，$R为了我自身的目的才变为了人形，去到鱼缸岛寻求帮助。", "莫库草·阿鲁玛");
                Say(pc, 65535, "几年前东国瘟疫爆发，东方地牢也受到了严重的波及。$R地牢外层的生物很快地被感染，失去理性，变成了可怕的怪物。", "莫库草·阿鲁玛");
                Say(pc, 65535, "加雪上加霜的是，东之国的活死人也会时不时地闯入这里。$R这些闯入者身上散发着腐烂的气息，无差别地对所有还没有腐化的生物发起攻击。", "莫库草·阿鲁玛");
                Say(pc, 65535, "我们少数幸运地躲过一劫的居民，在生活在洞穴深处的魔狼一族领袖$CR冥王$CD的保护下退至东牢的最深处，$R通过构筑起强大的结界与外界隔绝，阻止闯入者的入侵。", "莫库草·阿鲁玛");
                Say(pc, 65535, "本来如果能一直这样持续下去，后面的事情也就不会发生了……$R但是，就在一段时间前，事情有了变化。", "莫库草·阿鲁玛");
                Say(pc, 65535, "魔狼族的领袖$CR冥王$CD不知发生了什么，开始逐渐变得狂躁不安、丧失理智。$R我们常常能在夜间听到它的怒吼，但是谁也不敢去问发生了什么。", "莫库草·阿鲁玛");
                Say(pc, 65535, "我内心有一种非常不好的预感，$R如果再这样下去，冥王一旦真的发狂，那么魔狼的结界将会变得无法维持，$R所有受到结界保护的大家可能都会遇到非常可怕的事……", "莫库草·阿鲁玛");
                Say(pc, 65535, "我绝不能让这样的事发生，因此我想尽办法，穿过结界离开东方地牢，$R来到外界，想要请求强大的冒险者的帮助。", "莫库草·阿鲁玛");
                Say(pc, 65535, "……", "莫库草·阿鲁玛");
                Say(pc, 65535, "拜托你们了，冒险者，请前往这座地牢的最深处，救救冥王，救救大家吧！", "莫库草·阿鲁玛");
                Wait(pc, 1000);
                Say(pc, 65535, "……竟然还有这么复杂的内情。", "沙月");
                Say(pc, 65535, "你前面说的都是真的吗？", "沙月");
                Say(pc, 65535, "是的，请相信我！", "莫库草·阿鲁玛");
                Say(pc, 65535, "其实从刚进入这里时我就感觉到异样了。$R这座地牢中遍布着扭曲的幻象魔法，仿佛在极力遮掩着什么。", "沙月");
                Say(pc, 65535, "虽然从里面出来很容易，但是要想闯进去恐怕就不是那么简单的事情了。", "沙月");
                Say(pc, 65535, "就算跟着这家伙，你们恐怕也很难找到通向深处的道路。", "沙月");
                Say(pc, 65535, "整座东牢被看不到的浓雾所笼罩，无谋地前进只会迷失在幻觉之中。$R如果不能想办法驱散幻象，你们是没有办法继续前进的", "沙月");
                Say(pc, 65535, "不…这不单纯是污染的结果，很明显，这是有意识的魔法造成的结果。$R有什么看不到的存在造成了这一切。", "沙月");
                Say(pc, 65535, "事情恐怕没有这么简单，恐怕我还不能这么简单地放开你", "沙月");
                Say(pc, 65535, "！！！", "莫库草·阿鲁玛");
                Say(pc, 65535, "要想继续前进，你们恐怕要想办法先找出幻象的源头并驱散。$R否则你们只会不断地迷失道路。", "沙月");
                Say(pc, 65535, "幻象的源头有……一个…两个…三个。$R想办法找到它们并解除，正确的道路才会浮现。", "沙月");
                Say(pc, 65535, "要想驱散幻象就必须直面幻象的源头，$R恐怕我的魔法也帮不上什么忙，接下来只能靠你们自己的努力了。", "沙月");
                Say(pc, 65535, "我要留在这里，我还有一些事要问这个家伙。", "沙月");
                pc.TInt["东牢D-1"] = 1;
                pc.CInt["东牢D-1"] = 1;
                return;
            }
            Say(pc, 65535, "……不用在意我，比起这个，你们快去寻找$CR三个幻象源头$CD啊。", "莫库草·阿鲁玛");
        }
    }
}