using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript
{
    public class P10000666 : RandomPortal
    {
        public P10000666()
        {
            Init(10000666, 10046000, 195, 251, 198, 253);
        }
    }
    //原始地圖:鬼之寢岩(10061000)
    //目標地圖:南方海角(10046000)
    //目標坐標:(195,251) ~ (198,253)

    public class P10000667 : RandomPortal
    {
        public P10000667()
        {
            Init(10000667, 10064000, 185, 2, 188, 4);
        }
    }
    //原始地圖:鬼之寢岩(10061000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(185,2) ~ (188,4)

    public class P10000668 : RandomPortal
    {
        public P10000668()
        {
            Init(10000668, 10061000, 185, 251, 188, 253);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:鬼之寢岩(10061000)
    //目標坐標:(185,251) ~ (188,253)

    public class P10000669 : RandomPortal
    {
        public P10000669()
        {
            Init(10000669, 10064000, 26, 2, 29, 4);
        }
    }
    //原始地圖:鬼之寢岩(10061000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(26,2) ~ (29,4)

    public class P10000670 : RandomPortal
    {
        public P10000670()
        {
            Init(10000670, 10061000, 26, 251, 29, 253);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:鬼之寢岩(10061000)
    //目標坐標:(26,251) ~ (29,253)

    public class P10000671 : RandomPortal
    {
        public P10000671()
        {
            Init(10000671, 10063000, 251, 38, 253, 41);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:阿伊恩薩烏斯路(10063000)
    //目標坐標:(251,38) ~ (253,41)

    public class P10000672 : RandomPortal
    {
        public P10000672()
        {
            Init(10000672, 10064000, 2, 38, 4, 41);
        }
    }
    //原始地圖:阿伊恩薩烏斯路(10063000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(2,38) ~ (4,41)

    public class P10000673 : RandomPortal
    {
        public P10000673()
        {
            Init(10000673, 10063000, 251, 206, 253, 209);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:阿伊恩薩烏斯路(10063000)
    //目標坐標:(251,206) ~ (253,209)

    public class P10000674 : RandomPortal
    {
        public P10000674()
        {
            Init(10000674, 10064000, 2, 207, 4, 210);
        }
    }
    //原始地圖:阿伊恩薩烏斯路(10063000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(2,207) ~ (4,210)

    public class P10000675 : RandomPortal
    {
        public P10000675()
        {
            Init(10000675, 10063100, 139, 156, 141, 159);
        }
    }
    //原始地圖:阿伊恩薩烏斯路(10063000)
    //目標地圖:阿伊恩市上層(10063100)
    //目標坐標:(139,156) ~ (141,159)

    public class P10000692 : RandomPortal
    {
        public P10000692()
        {
            Init(10000692, 10066000, 197, 80, 199, 83);
        }
    }
    //原始地圖:南部地牢B1F(20020000)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(197,80) ~ (199,83)

    public class P10000694 : RandomPortal
    {
        public P10000694()
        {
            Init(10000694, 10066000, 197, 124, 199, 127);
        }
    }
    //原始地圖:南部地牢B1F(20020000)
    //目標地圖:阿伊恩市下層(10066000)
    //目標坐標:(197,124) ~ (199,127)

    public class P10000695 : RandomPortal
    {
        public P10000695()
        {
            Init(10000695, 20022000, 126, 241, 129, 243);
        }
    }
    //原始地圖:南部地牢B2F(20021000)
    //目標地圖:南部地牢B3F(20022000)
    //目標坐標:(126,241) ~ (129,243)

    public class P10000696 : RandomPortal
    {
        public P10000696()
        {
            Init(10000696, 20021000, 179, 73, 182, 75);
        }
    }
    //原始地圖:南部地牢B1F(20020000)
    //目標地圖:南部地牢B2F(20021000)
    //目標坐標:(179,73) ~ (182,75)

    public class P10000697 : RandomPortal
    {
        public P10000697()
        {
            Init(10000697, 20020000, 180, 70, 182, 73);
        }
    }
    //原始地圖:南部地牢B2F(20021000)
    //目標地圖:南部地牢B1F(20020000)
    //目標坐標:(180,70) ~ (182,73)

    public class P10000698 : RandomPortal
    {
        public P10000698()
        {
            Init(10000698, 20023000, 127, 251, 130, 253);
        }
    }
    //原始地圖:南部地牢B1F(20020000)
    //目標地圖:馬克特碼頭(20023000)
    //目標坐標:(127,251) ~ (130,253)

    public class P10000699 : RandomPortal
    {
        public P10000699()
        {
            Init(10000699, 20020000, 126, 3, 129, 5);
        }
    }
    //原始地圖:馬克特碼頭(20023000)
    //目標地圖:南部地牢B1F(20020000)
    //目標坐標:(126,3) ~ (129,5)

    public class P10000701 : RandomPortal
    {
        public P10000701()
        {
            Init(10000701, 20021000, 126, 241, 129, 243);
        }
    }
    //原始地圖:南部地牢B3F(20022000)
    //目標地圖:南部地牢B2F(20021000)
    //目標坐標:(126,241) ~ (129,243)

    public class P10000771 : RandomPortal
    {
        public P10000771()
        {
            Init(10000771, 30080000, 3, 6, 3, 6);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:避難所(30080000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000772 : RandomPortal
    {
        public P10000772()
        {
            Init(10000772, 10064000, 51, 111, 51, 111);
        }
    }
    //原始地圖:避難所(30080000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(51,111) ~ (51,111)

    public class P10000773 : RandomPortal
    {
        public P10000773()
        {
            Init(10000773, 30080001, 3, 6, 3, 6);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:避難所(30080001)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000774 : RandomPortal
    {
        public P10000774()
        {
            Init(10000774, 10064000, 211, 127, 211, 127);
        }
    }
    //原始地圖:避難所(30080001)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(211,127) ~ (211,127)

    public class P10000775 : RandomPortal
    {
        public P10000775()
        {
            Init(10000775, 30080002, 3, 6, 3, 6);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:避難所(30080002)
    //目標坐標:(3,6) ~ (3,6)

    public class P10000776 : RandomPortal
    {
        public P10000776()
        {
            Init(10000776, 10064000, 102, 209, 102, 209);
        }
    }
    //原始地圖:避難所(30080002)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(102,209) ~ (102,209)

    public class P10000777 : RandomPortal
    {
        public P10000777()
        {
            Init(10000777, 60064000, 161, 110, 163, 116);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:鐵火山(60064000)
    //目標坐標:(161,110) ~ (163,116)

    public class P10000778 : RandomPortal
    {
        public P10000778()
        {
            Init(10000778, 10064000, 161, 110, 163, 116);
        }
    }
    //原始地圖:鐵火山(60064000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(161,110) ~ (163,116)

    public class P10000779 : RandomPortal
    {
        public P10000779()
        {
            Init(10000779, 20022000, 121, 49, 135, 59);
        }
    }
    //原始地圖:南部地牢B3F(20022000)
    //目標地圖:南部地牢B3F(20022000)
    //目標坐標:(121,49) ~ (135,59)

    public class P10001099 : RandomPortal
    {
        public P10001099()
        {
            Init(10001099, 50023000, 3, 6, 3, 6);
        }
    }
    //原始地圖:鐵火山(10064000)
    //目標地圖:避難所(50023000)
    //目標坐標:(3,6) ~ (3,6)

    public class P10001101 : RandomPortal
    {
        public P10001101()
        {
            Init(10001101, 10064000, 102, 209, 102, 209);
        }
    }
    //原始地圖:避難所(50023000)
    //目標地圖:鐵火山(10064000)
    //目標坐標:(102,209) ~ (102,209)

}