using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;

namespace 东部地牢副本
{
    public class P10000825 : 东部地牢传送模板
    {
        public P10000825()
        {
            Init(10000825, 20091000, 48, 251, 51, 253);
        }
    }
    //原始地圖:東方地牢(20090000)
    //目標地圖:毒濕地(20091000)
    //目標坐標:(48,251) ~ (51,253)



    public class P10000827 : 东部地牢传送模板
    {
        public P10000827()
        {
            Init(10000827, 20091000, 92, 251, 95, 253);
        }
    }
    //原始地圖:東方地牢(20090000)
    //目標地圖:毒濕地(20091000)
    //目標坐標:(92,251) ~ (95,253)

    public class P10000828 : 东部地牢传送模板
    {
        public P10000828()
        {
            Init(10000828, 20090000, 93, 2, 96, 4);
        }
    }
    //原始地圖:毒濕地(20091000)
    //目標地圖:東方地牢(20090000)
    //目標坐標:(93,2) ~ (96,4)

    public class P10000829 : 东部地牢传送模板
    {
        public P10000829()
        {
            Init(10000829, 20092000, 122, 251, 125, 253);
        }
    }
    //原始地圖:東方地牢(20090000)
    //目標地圖:原始森林(20092000)
    //目標坐標:(122,251) ~ (125,253)

    public class P10000830 : 东部地牢传送模板
    {
        public P10000830()
        {
            Init(10000830, 20090000, 228, 2, 231, 4);
        }
    }
    //原始地圖:原始森林(20092000)
    //目標地圖:東方地牢(20090000)
    //目標坐標:(228,2) ~ (231,4)

    public class P10000832 : 东部地牢传送模板
    {
        public P10000832()
        {
            Init(10000832, 20092000, 168, 32, 171, 34);
        }
    }
    //原始地圖:毒濕地(20091000)
    //目標地圖:原始森林(20092000)
    //目標坐標:(168,32) ~ (171,34)

    public class P10000834 : 东部地牢传送模板
    {
        public P10000834()
        {
            Init(10000834, 20092000, 108, 77, 110, 79);
        }
    }
    //原始地圖:原始森林(20092000)
    //目標地圖:原始森林(20092000)
    //目標坐標:(108,77) ~ (110,79)

    public class P12001090 : 东部地牢传送模板
    {
        public P12001090()
        {
            Init(12001090, 20091000, 188, 220, 188, 220);
        }
    }
    //原始地圖:毒濕地(20091000)
    //原始地圖:毒濕地(20091000)
    //目標坐標:(188,220) ~ (188,220)
}