using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaScript.Chinese.Enums;
namespace SagaScript.M12021000
{
    public class S11001609 : Event
    {
        public S11001609()
        {
            this.EventID = 11001609;
        }

        public override void OnEvent(ActorPC pc)
        {
            Say(pc, 112, "……竊竊私語……。$R;", "シュタイン博士");
            switch (Select(pc, "那、那個……。", "", "無視", "搭話試試", "　"))
            {
                case 2:
                    Say(pc, 0, 131, "那個，對不起。$R;", " ");

                    Say(pc, 112, "……竊竊私語……。$R;", "シュタイン博士");

                    Say(pc, 0, 131, "我說～……、叨擾一下？$R;", " ");

                    Say(pc, 112, "……。$R;" +
                    "$P……嗯？$R;", "シュタイン博士");
                    Say(pc, 131, "……什，什麽啊！是汝啊！$R;" +
                    "什，什麽時候站在那兒地！$R;" +
                    "$R……難到，你聽到了老朽的$R;" +
                    "自言自語……？$R;", "シュタイン博士");
                    switch (Select(pc, "聽見自言自語會很糟糕？", "", "聽見了", "沒聽見"))
                    {
                        case 1:
                            Say(pc, 131, "嗯……。$R;" +
                            "偷聽的話……！$R;" +
                            "$R……反正都聽到了$R;" +
                            "就全部聽完吧！（ニヤリ）$R;", "シュタイン博士");
                            Say(pc, 131, "我這個天才シュタインが$R;" +
                            "頭上裝備着的釘子！$R;" +
                            "$R具備了很高的時髦性和$R;" +
                            "實用性簡直和我就是$R;" +
                            "如出一轍嘛！$R;" +
                            "$P……。$R;" +
                            "$P……這個釘子$R;" +
                            "以前，有過一件不可思議的事情。$R;" +
                            "請聽下去。$R;" +
                            "$P那天，老朽裝備着這個釘子，$R;" +
                            "做著平時該做的事。$R;" +
                            "床についたのじゃ。$R;" +
                            "$P就在這晚，老朽做了一個夢。$R;" +
                            "このクギを頭に装着しては$R;" +
                            "ゴミ箱に捨て、また装着しては$R;" +
                            "ゴミ箱に捨てるという行為を$R;" +
                            "見知らぬ人々が延々と続ける夢……。$R;" +
                            "$Pそんな恐ろしい夢を見た$R;" +
                            "わしはとてつもないショックで$R;" +
                            "目を覚ましたのじゃ……。$R;" +
                            "$Rその時じゃ！！$R;" +
                            "$Pふと、頭のクギが心配になり$R;" +
                            "クギに触れてみようとすると……。$R;" +
                            "$R……ないのじゃ！！$R;" +
                            "わしの頭にあるはずのクギが$R;" +
                            "失くなっとったのじゃ……！$R;" +
                            "$Pわしは必死に探した。$R;" +
                            "しかし、どこを探しても出てこない。$R;" +
                            "$Rわしは途方にくれ$R;" +
                            "もう、諦めようと思った矢先の夜じゃ$R;" +
                            "何事もなかったかのうように$R;" +
                            "ワシの枕元にこのクギが$R;" +
                            "置かれていたんじゃ……。$R;" +
                            "$P結局、誰の仕業だったのかのう……。$R;" +
                            "$Rでは、次の発明を……。$R;" +
                            "$P……ブツブツ……。$R;", "シュタイン博士");
                            break;
                    }

                    break;
            }
        }

    }

}
            
            
        
     
    