using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
//所在地圖:南部平原初心者學校(30091003) NPC基本信息:老師(11000980) X:6 Y:1
namespace SagaScript.M30091003
{
    public class S11000980 : Event
    {
        public S11000980()
        {
            this.EventID = 11000980;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Beginner_02> Beginner_02_mask = new BitMask<Beginner_02>(pc.CMask["Beginner_02"]);

            int selection;

            if (!Beginner_02_mask.Test(Beginner_02.已經與老師進行第一次對話))
            {
                初次與老師進行對話(pc);
                return;
            }

            Say(pc, 11000980, 131, "您好!$R;" +
                                   "$R有什么要问的吗?$R;", "老师");

            selection = Select(pc, "想问什么问题?", "", "刚开始的时候，该做什么好呢?", "去上城的方法", "加入军队，有什么好处?", "哪个职业比较好?", "怎样才能赚大钱…", "怎么打开『木箱』呢", "跳到问题页", "很难啊…到…", "没有关系");

            while (selection != 9)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11000980, 131, "嗯! 刚开始时，$R;" +
                                               "做3个「任务」左右比较好喔!$R;" +
                                               "$R因为可以获得经验值和金币呢!$R;" +
                                               "$P还有跟城市里的人聊聊天，$R;" +
                                               "以及可以去的地方都去看看…$R;" +
                                               "$R这两点也是很重要的呀!$R;" +
                                               "$P小地图中「红点」是有NPC的地方，$R;" +
                                               "「蓝点」是有传送点的所在地。$R;" +
                                               "$R参考一下吧!$R;", "老师");
                        break;

                    case 2:
                        Say(pc, 11000980, 131, "在进入「上城」的入口$R;" +
                                               "被警卫阻止了?$R;" +
                                               "$R您一定觉得很奇怪吧?$R;" +
                                               "「阿克罗波利斯」是自由贸易城市，$R;" +
                                               "可为什么无法自由的进出…$R;" +
                                               "$P…去问问在「下城」的$R;" +
                                               "「万事通」吧$R;" +
                                               "$R他会告诉您$R;" +
                                               "得到『阿克罗波利斯通行证』的方法。$R;", "老师");
                        break;

                    case 3:
                        Say(pc, 11000980, 131, "是说「阿克罗尼亚混成骑士团」吧?$R;" +
                                               "在「骑士团宫殿」那里受到劝诱吗?$R;" +
                                               "$R嗯…说到优点的话，$R;" +
                                               "应该说…$R;" +
                                               "可以自由出入军队所属的国家吧?$R;" +
                                               "$P除此之外，$R;" +
                                               "还可以执行特殊的军队「任务」。$R;" +
                                               "在所属国的话，$R;" +
                                               "好像也会有军队专用的特别商店哦!$R;" +
                                               "$P且即使是「骑士团练习」，$R;" +
                                               "也不会禁止所属军队和其他军队参加，$R;" +
                                               "也不会无法进入其他国家，$R;" +
                                               "所以放心吧!$R;" +
                                               "$P要说缺点的话…嗯…$R;" +
                                               "$R有些城市里的居民，$R;" +
                                               "不太喜欢「阿克罗尼亚混成骑士团」呀!$R;", "老师");
                        break;

                    case 4:
                        Say(pc, 11000980, 131, "如果还没决定职业的话…$R;" +
                                               "$R开始的时候，$R;" +
                                               "还是选择战士系的$R;" +
                                               "「剑士」或「骑士」吧!$R;" +
                                               "比较容易熟悉适应环境。$R;", "老师");
                        break;

                    case 5:
                        Say(pc, 11000980, 131, "这么快就完成3个「任务」啦?$R;" +
                                               "呵呵!$R;" +
                                               "$R先把在「阿克罗波利斯」$R;" +
                                               "东、南、西、北平原的『木箱』打破吧!$R;" +
                                               "$P把箱子打破后，将得到『木箱』哦!$R;" +
                                               "只要可以用高价卖给商人的，$R;" +
                                               "一定是好东西啊!$R;", "老师");
                        break;

                    case 6:
                        Say(pc, 11000980, 131, "可能您还没见过『木箱』吧?$R;" +
                                               "$R但是『宝物箱』和『集装箱』里面，$R;" +
                                               "同样装有各种道具的喔!$R;" +
                                               "$P拜托「道具精制师」帮忙的话，$R;" +
                                               "他会帮您打开箱子的。$R;" +
                                               "$R往城市的方向走一会，$R;" +
                                               "应该可以看到一个戴着眼镜。$R;" +
                                               "看起来像工匠的人吧?$R;" +
                                               "$P『木箱』和『宝物箱』$R;" +
                                               "还有『集装箱』里，$R;" +
                                               "偶尔也会有很珍贵的道具唷!$R;" +
                                               "$P虽然现在还不知道里面道具的价值?$R;" +
                                               "$R当您知道可能获得道具的价值后，$R;" +
                                               "还是别把『木箱』卖掉吧，$R;" +
                                               "说不定找精制师帮您打开会更好呢!$R;", "老师");
                        break;

                    case 7:
                        問題頁(pc);
                        return;

                    case 8:
                        困難頁(pc);
                        return;
                }

                selection = Select(pc, "想问什么问题?", "", "刚开始的时候，该做什么好呢?", "去上城的方法", "加入军队，有什么好处?", "哪个职业比较好?", "怎样才能赚大钱…", "怎么打开『木箱』呢", "跳到问题页", "很难啊…到…", "没有关系");
            }
        }

        void 初次與老師進行對話(ActorPC pc)
        {
            BitMask<Beginner_02> Beginner_02_mask = new BitMask<Beginner_02>(pc.CMask["Beginner_02"]);

            Beginner_02_mask.SetValue(Beginner_02.已經與老師進行第一次對話, true);

            Say(pc, 11000980, 131, "您好!$R;" +
                                   "$R您第一次来到这里吧?$R;" +
                                   "$P这裡是为了帮助$R;" +
                                   "到「阿克罗波利斯」的初心者，$R;" +
                                   "而设立的「初心者学校」哦!$R;" +
                                   "$P如果您也需要帮助的话，$R;" +
                                   "就请到这里来吧!$R;", "老师");
        }

        void 問題頁(ActorPC pc)
        {
            int selection;

            selection = Select(pc, "想问什么问题?", "", "想交朋友…", "怎么组成队伍??", "骑士团演习是什么?", "我想养宠物!", "我想拥有活动木偶", "回到首页", "对困难的地方…", "没有关系");

            while (selection != 6)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11000980, 131, "别客气，安心的说吧!$R;" +
                                               "$P话虽如此，还是挺需要勇气的吧?$R;" +
                                               "$P如果害怕跟人交谈，$R;" +
                                               "我可以给您介绍一个功能喔!$R;" +
                                               "$R可以试试使用$R;" +
                                               "「告示板」和「广告目录」呀!$R;" +
                                               "$P「告示板」在「上城」$R;" +
                                               "和各地方都有。$R;" +
                                               "$R告示版里写上招募朋友或$R;" +
                                               "提出问题的话，$R;" +
                                               "其他人会亲切地回答您喔!$R;" +
                                               "$P而「广告目录」呢，$R;" +
                                               "用滑鼠右键点自己，就会显示目录了，$R;" +
                                               "选择目录的中「广告目录」就可以了。$R;" +
                                               "$P这时会出现广告目录的视窗，$R;" +
                                               "再选择「招募广告登陆」，$R;" +
                                               "把自己想要说的话输入就可以了。$R;", "老师");
                        break;

                    case 2:
                        Say(pc, 11000980, 131, "想邀请对方加入队伍的话，$R;" +
                                               "用滑鼠右键点击对方，$R;" +
                                               "选择「邀请加入队伍」试试吧!$R;" +
                                               "$R对方就会显示邀请加入的视窗，$R;" +
                                               "如果忽然邀请的话，会吓着对方的。$R;" +
                                               "所以邀请之前，$R;" +
                                               "先与对方交谈得到许可后，$R;" +
                                               "再邀请比较好哦!$R;" +
                                               "$P只要对方接受了邀请，$R;" +
                                               "那么两个人就组成了队伍喔!$R;" +
                                               "$R这个时候提出邀请的一方，$R;" +
                                               "就会变成「队长」。$R;" +
                                               "那么，您应该会成为队长吧?$R;" +
                                               "$P队长可以$R;" +
                                               "「更改队伍名称」和「解散队伍」喔!$R;" +
                                               "$P如果是收到邀请的话，$R;" +
                                               "您就会成为队伍的「队员」。$R;" +
                                               "$P当您不想组队时，$R;" +
                                               "就可以「退出队伍」呀!$R;" +
                                               "$R不管是哪一方，$R;" +
                                               "想加入队伍的话，只要点击自己，$R;" +
                                               "在目录里选择就可以啰。$R;", "老师");
                        break;

                    case 3:
                        Say(pc, 11000980, 131, "好像听到了广播啊?$R;" +
                                               "$R「骑士团演习」$R;" +
                                               "简单的说，$R;" +
                                               "就是玩家们分为东、南、西、北军后，$R;" +
                                               "进行的模拟战斗。$R;" +
                                               "$P不论您是否参加了骑士团，$R;" +
                                               "都可以在东、南、西、北4个小组中，$R;" +
                                               "任意的选择一方参加唷!$R;" +
                                               "$P装备的持久度不会减少，$R;" +
                                               "死亡也不会处罚，$R;" +
                                               "所以别担心，去玩玩吧!$R;" +
                                               "$P到了「阿克罗波利斯」的「下城」$R;" +
                                               "北边有「占卜店」哦!$R;" +
                                               "$R那「占卜店」右边的传送点前，$R;" +
                                               "正接受报名呢!$R;" +
                                               "$R下次听到广播的时候，就去看看吧!$R;", "老师");
                        break;

                    case 4:
                        Say(pc, 11000980, 131, "嗯，宠物的种类虽然很多…$R;" +
                                               "$R但是，到「玩家商店」那里买的话，$R;" +
                                               "是最简单的。$R;" +
                                               "$P想在商店里购买的话，$R;" +
                                               "可以去「东方海角」的「宠物店」。$R;" +
                                               "$P那里有贩卖小狗哦!$R;" +
                                               "有些宠物也是很稀有的。$R;" +
                                               "$R如果路上看到别人$R;" +
                                               "带着您喜欢的宠物类型，$R;" +
                                               "就去问问得到宠物的方法吧!$R;", "老师");
                        break;

                    case 5:
                        Say(pc, 11000980, 131, "听说「阿克罗波利斯」的「上城」$R;" +
                                               "有个分发活动木偶的女孩…$R;" +
                                               "$P好像叫…埃琳娜?$R;" +
                                               "听说是个可爱的泰达尼亚女孩，$R;" +
                                               "$R下次去看看吧!$R;", "老师");
                        break;

                    case 7:
                        困難頁(pc);
                        return;

                    case 8:
                        return;
                }

                selection = Select(pc, "想问什么问题?", "", "想交朋友…", "怎么组成队伍??", "骑士团演习是什么?", "我想养宠物!", "我想拥有活动木偶", "回到首页", "对困难的地方…", "没有关系");
            }
        }

        void 困難頁(ActorPC pc)
        {
            int selection;

            selection = Select(pc, "想问什么问题?", "", "无法使用技能", "因为石像和告示板无法走路…", "装备坏掉了", "宠物进入了睡眠状态", "行李太多无法搬运", "回到首页", "到问题页", "没有关系");

            while (selection != 6)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11000980, 131, "无法使用技能?$R;" +
                                               "$R原因可能有三个。$R;" +
                                               "$P第一是$R;" +
                                               "使用技能需要的MP值或SP值不足。$R;" +
                                               "$P第二是$R;" +
                                               "不符合技能的「使用条件」。$R;" +
                                               "$R比如说，连武器都没有，$R;" +
                                               "要使用「旋风剑」这样的技能，$R;" +
                                               "当然是不可能吧!$R;" +
                                               "$P最后是第三个，$R;" +
                                               "没有使用技能时的必备品「催化道具」。$R;" +
                                               "$R技能中，有些技能每次使用时，$R;" +
                                               "都需要一个「催化道具」。$R;" +
                                               "「催化道具」中，$R;" +
                                               "有『毒药』、『定时炸弹』等几种。$R;" +
                                               "$P关于「使用条件」或「催化道具」，$R;" +
                                               "用滑鼠右键点击技能图示的话，$R;" +
                                               "在「技能视窗」会有说明哦，$R;" +
                                               "有时间去看看吧?$R;", "老师");
                        break;

                    case 2:
                        Say(pc, 11000980, 131, "啊…!$R;" +
                                               "「阿克罗尼亚东部平原」$R;" +
                                               "石像和告示板特别多呀，$R;" +
                                               "所以非常难走。$R;" +
                                               "$P这时只要在系统视窗的第三个项目中的$R;" +
                                               "「石像显示」把显示状态设定为「不显示」即可。$R;" +
                                               "$P再把告示板设定为不显示，$R;" +
                                               "或用滑鼠设定别人的告示板，$R;" +
                                               "或广告显示与否。$R;" +
                                               "$P或把宠物说话的话，$R;" +
                                               "设定成在纪录中不显示等等。$R;" +
                                               "$R按照自己的喜好设定就可以了!$R;", "老师");
                        break;

                    case 3:
                        Say(pc, 11000980, 131, "装备得持久度降到0的话，$R;" +
                                               "图示会变成半透明，就无法装备了。$R;" +
                                               "$R那是道具「损坏」的意思。$R;" +
                                               "$P但是不代表，$R;" +
                                               "永远不能使用那道具。$R;" +
                                               "因为道具「损坏」了，$R;" +
                                               "只要用『维修工具』修理就可以了。$R;" +
                                               "$P依照装备不同，$R;" +
                                               "也有几种不同的『维修工具』。$R;" +
                                               "$R而且又根据「装备等级」，$R;" +
                                               "分为「金」「银」「铜」，$R;" +
                                               "注意不要弄错啊?$R;" +
                                               "$P在装备的「道具资料」视窗里，$R;" +
                                               "「详细」说明了$R;" +
                                               "可以修理道具的维修工具名称，$R;" +
                                               "请确认看看吧?$R;", "老师");
                        break;

                    case 4:
                        Say(pc, 11000980, 131, "什么…宠物的图示$R;" +
                                               "要是变成半透明的话，$R;" +
                                               "就不能带它出去了?$R;" +
                                               "$R请放心吧，那个不是指宠物死了。$R;" +
                                               "$R只是「亲密度」跌到0而已!$R;" +
                                               "$P亲密度跌至0的话，$R;" +
                                               "宠物会进入「休眠」状态呀!$R;" +
                                               "$R只要恢复亲密度，$R;" +
                                               "就可以像以前一样，一起冒险了。$R;" +
                                               "$P想要恢复亲密度的话，$R;" +
                                               "餵宠物吃『四叶草糖果』或$R;" +
                                               "『四叶草豆』吧!$R;" +
                                               "$R双击道具后，$R;" +
                                               "选择宠物就可以了。$R;" +
                                               "$P或者可以恢復宠物亲密度的，$R;" +
                                               "「宠物医生」那里治疗也可以。$R;", "老师");
                        break;

                    case 5:
                        Say(pc, 11000980, 131, "「重量」和「体积」$R;" +
                                               "总会觉得不足的。$R;" +
                                               "$R「重量」和「体积」$R;" +
                                               "是根据职业、种族而定啊!$R;" +
                                               "$P要搬运的物品，$R;" +
                                               "比限制数量多的时候。$R;" +
                                               "$R装备「背囊」$R;" +
                                               "或者带着可以搬运的「宠物」，$R;" +
                                               "就可以了。$R;" +
                                               "$P职业中也有可以运用「技能」，$R;" +
                                               "搬运大量行李的职业哦!$R;" +
                                               "$P还有，您有在使用「仓库」吗?$R;" +
                                               "$R跟商人说话时，$R;" +
                                               "可以请他帮您用个人仓库，$R;" +
                                               "来保管道具哦!$R;", "老师");
                        break;

                    case 7:
                        問題頁(pc);
                        return;

                    case 8:
                        return;
                }

                selection = Select(pc, "想问什么问题?", "", "无法使用技能", "因为石像和告示板无法走路…", "装备坏掉了", "宠物进入了睡眠状态", "行李太多无法搬运", "回到首页", "到问题页", "没有关系");
            }
        }
    }
}
