using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
//所在地圖:東方海角(10018103) NPC基本信息:埃米爾(11001414) X:195 Y:64
namespace SagaScript.M10018103
{
    public class S11001414 : Event
    {
        public S11001414()
        {
            this.EventID = 11001414;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            int selection;

            if (!Beginner_01_mask.Test(Beginner_01.已經與埃米爾進行第一次對話))
            {
                初次與埃米爾進行對話(pc);
            }
            else
            {
                Say(pc, 11001414, 131, "什么，再说明一下?$R;", "埃米尔");
            }

            selection = Select(pc, "想问关于哪方面的操作呢?", "", "说话/攻击", "移动方法", "结束游戏方法", "移动地图的方法", "其他");

            while (selection != 5)
            {
                switch (selection)
                {
                    case 1:
                        Say(pc, 11001414, 131, "想跟村里的人打招呼，$R;" +
                                               "或攻击敌人的时候，$R;" +
                                               "对目标点击滑鼠左键就可以啰。$R;" +
                                               "$P…看您跟我打招呼了，$R;" +
                                               "应该已经知道了吧?$R;" +
                                               "$P如果对方跟其他人重叠时，$R;" +
                                               "就请点击滑鼠右键吧。$R;" +
                                               "$R将会出现重叠人名的视窗，$R;" +
                                               "在里面可以选择跟谁打招呼哦!$R;", "埃米尔");
                        break;

                    case 2:
                        Say(pc, 11001414, 131, "移动时，在移动目标上点击左键即可。$R;" +
                                               "$R如果长时间持续点击，$R;" +
                                               "就会自动跟著滑鼠移动方向移动。$R;" +
                                               "$P人太多的时候操作困难。$R;" +
                                               "$R这时用键盘的方向键移动，$R;" +
                                               "会比较方便唷!$R;", "埃米尔");
                        break;

                    case 3:
                        Say(pc, 11001414, 131, "要结束游戏的话，$R;" +
                                               "请按键盘左上角ESC键…$R;" +
                                               "$P如果按这键…$R;" +
                                               "喂! 别现在点击!$R;" +
                                               "$P然后…$R;" +
                                               "$R「返回游戏」或「登出」$R;" +
                                               "$R两个选项中做出选择即可。$R;" +
                                               "$P注意一点，$R;" +
                                               "对话时结束游戏，$R;" +
                                               "会听不到后面的对话哦!$R;" +
                                               "$P登出需要5秒钟的时间，$R;" +
                                               "$R这时移动或被魔物攻击的话，$R;" +
                                               "会自动取消登出喔!$R;" +
                                               "$P在寒冷、炎热或是在水里等$R;" +
                                               "体质HP值渐渐减少的地方，$R;" +
                                               "是没办法登出的喔!$R;", "埃米尔");
                        break;

                    case 4:
                        Say(pc, 11001414, 131, "想移动到下一幅地图时，$R;" +
                                               "看到蓝色光柱了吗?$R;" +
                                               "这是「传送点」，$R;" +
                                               "踩到它就会进入下一个地图哦!$R;" +
                                               "$P同样的，进入店里时踩传送点即可。$R;" +
                                               "$P如果没有光柱，$R;" +
                                               "传送点可能是隐藏的。$R;" +
                                               "$R如果觉得可能有的话，$R;" +
                                               "就踩一踩试试看，$R;" +
                                               "可能有新发现!$R;", "埃米尔");
                        break;
                }

                selection = Select(pc, "想问关于哪方面的操作呢?", "", "说话/攻击", "移动方法", "结束游戏方法", "移动地图的方法", "其他");
            }

            if (!Beginner_01_mask.Test(Beginner_01.埃米爾給予埃米爾徽章))
            {
                埃米爾給予埃米爾徽章(pc);
                return;
            }

            Say(pc, 11001414, 131, "那么说明一下传送点吧!$R;" +
                                   "$R只要点击那个传送点，$R;" +
                                   "就可以进入下一阶段了!$R;" +
                                   "$P跟着路走就是阿克罗波利斯了!$R;" +
                                   "$R放心，$R;" +
                                   "只要参照小地图来走，就不会迷路啦。$R;", "埃米尔");          
        }

        void 初次與埃米爾進行對話(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            byte x, y;

            Beginner_01_mask.SetValue(Beginner_01.已經與埃米爾進行第一次對話, true);

            Say(pc, 11001414, 131, "您好!$R;" +
                                   "是否第一次来到这里呢?$R;" +
                                   "$R我叫埃米尔，$R;" +
                                   "是负责帮助来到$R;" +
                                   "ECO世界的初心者们。$R;" +
                                   "$P准备好了，就开始个人指导吧…$R;", "埃米尔");

            switch (Select(pc, "要进行指导吗?", "", "进行指导", "直接返回游戏"))
            {
                case 1:
                    Say(pc, 11001414, 131, "首先，欢迎来到ECO世界!$R;" +
                                           "$R现在，您的眼前即将展开魔幻新世界。$R;" +
                                           "$P那么开始教您一些基本操作方法吧!$R;", "埃米尔");
                    break;

                case 2:
                    Say(pc, 11001414, 131, "真是的，以后再也听不到说明喔!$R;", "埃米尔");

                    switch (Select(pc, "真的不听说明吗?", "", "听完说明在走", "不听也行!"))
                    {
                        case 1:
                            Say(pc, 11001414, 131, "那就开始吧!$R;", "埃米尔");

                            Say(pc, 11001414, 131, "首先，欢迎来到ECO世界!$R;" +
                                                   "$R现在，您的眼前即将展开魔幻新世界。$R;" +
                                                   "$P那么开始教您一些基本操作方法吧!$R;", "埃米尔");
                            break;

                        case 2:
                            Beginner_01_mask.SetValue(Beginner_01.埃米爾給予埃米爾介紹書, true);

                            PlaySound(pc, 2040, false, 100, 50);
                            GiveItem(pc, 10043081, 1);
                            Say(pc, 0, 0, "得到『埃米尔的介绍信』!$R;", " ");

                            Say(pc, 11001414, 131, "知道了，最后还有一点。$R;" +
                                                   "$P到达阿克罗波利斯后，$R;" +
                                                   "最好去「酒馆」或者「酒馆分店」一趟。$R;" +
                                                   "$P「酒馆」在「阿克罗波利斯」的$R;" +
                                                   "「下城」东部喔!$R;" +
                                                   "$R「酒馆分店」在「阿克罗波利斯」的$R;" +
                                                   "东、南、西、北部平原的中央附近!$R;" +
                                                   "$P我有给您一份介绍书，$R;" +
                                                   "在道具视窗中确认一下吧?$R;" +
                                                   "$P「阿克罗波利斯」是一个很大的城市喔!$R;" +
                                                   "迷了路可以利用「向导机器人」。$R;" +
                                                   "$R「向导机器人」是个有点奇怪的机器人，$R;" +
                                                   "「阿克罗波利斯」里到处都有，很容易找到的。$R;", "埃米尔");

                            Say(pc, 11001414, 131, "那么送您到「阿克罗波利斯」吧!$R;", "埃米尔");

                            x = (byte)Global.Random.Next(245, 250);
                            y = (byte)Global.Random.Next(126, 131);

                            Warp(pc, 10023100, x, y);
                            return;
                    }
                    break;
            }
        }

        void 埃米爾給予埃米爾徽章(ActorPC pc)
        {
            BitMask<Beginner_01> Beginner_01_mask = new BitMask<Beginner_01>(pc.CMask["Beginner_01"]);

            Beginner_01_mask.SetValue(Beginner_01.埃米爾給予埃米爾徽章, true);

            Say(pc, 11001414, 131, "还有…$R;" +
                                   "$R通过前面的传送点，$R;" +
                                   "就会进入下一张地图，$R;" +
                                   "沿着路走，$R;" +
                                   "就会有「关卡」哦!$R;" +
                                   "$R我的同伴，是多米尼翁男孩。$R;" +
                                   "$P他会教您很多关于战斗的东西唷!$R;" +
                                   "$R那么，祝您好运!$R;", "埃米尔");

            Say(pc, 11001414, 131, "这是欢送您的礼物!$R;", "埃米尔");

            PlaySound(pc, 2040, false, 100, 50);
            GiveItem(pc, 10009550, 1);
            Say(pc, 0, 0, "得到『埃米尔徽章』!$R;", " ");

            Say(pc, 11001414, 131, "把这个徽章放到叫「道具箱」的$R;" +
                                   "粉红色机器就可以交换到$R;" +
                                   "各种有用的道具!$R;" +
                                   "$P试试将徽章$R;" +
                                   "放到我前面的「道具箱」吧!$R;", "埃米尔");

            Say(pc, 11001414, 131, "对了!$R;" +
                                   "$R走之前，先到村落里走走吧!$;" +
                                   "会听到很多情报哦!$R;", "埃米尔");
        }   
    }
}
