using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript
{

public class P10000837 : RandomPortal
{
    public P10000837()
    {
        Init(10000837, 10068000, 194, 214, 205, 216);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:榖倉地帶(10068000)
//目標坐標:(194,214) ~ (205,216)

public class P10000838 : Event
{
    public P10000838()
    {
        this.EventID = 10000838;
    }

    public override void OnEvent(ActorPC pc)
    {
        int a = Global.Random.Next(1, 4);
        if (a == 4)
        {
            PlaySound(pc, 2447, false, 100, 50);
        }
        Warp(pc, 20129000, 8, 43);
        //Init(10000838, 20129000, 7, 43, 9, 44);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:城市入口(20129000)
//目標坐標:(7,43) ~ (9,44)

public class P10000839 : RandomPortal
{
    public P10000839()
    {
        Init(10000839, 20104000, 7, 22, 9, 23);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:訓練所2F(20104000)
//目標坐標:(7,22) ~ (9,23)

public class P10000840 : RandomPortal
{
    public P10000840()
    {
        Init(10000840, 20106000, 15, 16, 16, 18);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:法務官之間(20106000)
//目標坐標:(15,16) ~ (16,18)

public class P10000841 : RandomPortal
{
    public P10000841()
    {
        Init(10000841, 20127000, 11, 1, 13, 2);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:倉庫2F(20127000)
//目標坐標:(11,1) ~ (13,2)

public class P10000842 : RandomPortal
{
    public P10000842()
    {
        Init(10000842, 20123000, 30, 19, 31, 21);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:禮拜堂2F(20123000)
//目標坐標:(30,19) ~ (31,21)

public class P10000843 : RandomPortal
{
    public P10000843()
    {
        Init(10000843, 20123000, 1, 19, 2, 21);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:禮拜堂2F(20123000)
//目標坐標:(1,19) ~ (2,21)

public class P10000844 : RandomPortal
{
    public P10000844()
    {
        Init(10000844, 20117000, 7, 1, 9, 2);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:本館2F(20117000)
//目標坐標:(7,1) ~ (9,2)

public class P10000845 : RandomPortal
{
    public P10000845()
    {
        Init(10000845, 20117000, 1, 30, 2, 32);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:本館2F(20117000)
//目標坐標:(1,30) ~ (2,32)

public class P10000846 : RandomPortal
{
    public P10000846()
    {
        Init(10000846, 20115000, 11, 15, 13, 16);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:左門兵營3F(20115000)
//目標坐標:(11,15) ~ (13,16)

public class P10000847 : RandomPortal
{
    public P10000847()
    {
        Init(10000847, 20102000, 1, 11, 2, 13);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:右門兵營3F(20102000)
//目標坐標:(1,11) ~ (2,13)

public class P10000848 : RandomPortal
{
    public P10000848()
    {
        Init(10000848, 20102000, 21, 11, 23, 13);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:右門兵營3F(20102000)
//目標坐標:(21,11) ~ (23,13)

public class P10000849 : RandomPortal
{
    public P10000849()
    {
        Init(10000849, 20110000, 6, 21, 8, 22);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:皇宮3F(20110000)
//目標坐標:(6,21) ~ (8,22)

public class P10000850 : RandomPortal
{
    public P10000850()
    {
        Init(10000850, 20119000, 7, 32, 9, 33);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:本館4F(20119000)
//目標坐標:(7,32) ~ (9,33)

public class P10000851 : Event
{
    public P10000851()
    {
        this.EventID = 10000851;
    }

    public override void OnEvent(ActorPC pc)
    {
        if (pc.Account.GMLevel >= 100)
        {
            Say(pc, 131, "因為是管理者模式，所以被改變了$R;");
            //WARP 851
            Warp(pc, 20112000, 9, 15);
            return;
        }
        Say(pc, 131, "門關得很嚴實呀$R;");

        //Init(10000851, 20112000, 9, 15, 10, 16);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:王之寢室(20112000)
//目標坐標:(9,15) ~ (10,16)

public class P10000852 : RandomPortal
{
    public P10000852()
    {
        Init(10000852, 20111000, 2, 21, 2, 21);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:謁見之間(20111000)
//目標坐標:(2,21) ~ (2,21)

public class P10000853 : Event
{
    public P10000853()
    {
        this.EventID = 10000853;
    }

    public override void OnEvent(ActorPC pc)
    {
        Say(pc, 131, "被封印了…$R;");
        switch (Select(pc, "使用「紋章紙」嗎？", "", "使用", "不使用"))
        {
            case 1:
                if (pc.Account.GMLevel >= 100)
                {
                    Say(pc, 131, "GM用啥「紋章紙」啊!$R;");
                    Say(pc, 131, "OTZ!$R;");
                    Warp(pc, 20125000, 24, 47);
                    return;
                }
                if (CountItem(pc, 10024900) >= 1)
                {
                    TakeItem(pc, 10024900, 1);
                    PlaySound(pc, 2218, false, 100, 50);
                    Say(pc, 131, "焚燒了「紋章紙」$R;");
                    Warp(pc, 20125000, 24, 47);
                    return;
                }
                Say(pc, 131, "沒有「紋章紙」呀$R;");
                break;
            case 2:
                break;
        }
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:聖者之間(20125000)
//目標坐標:(23,47) ~ (26,47)

public class P10000854 : RandomPortal
{
    public P10000854()
    {
        Init(10000854, 20102000, 1, 1, 2, 2);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:右門兵營3F(20102000)
//目標坐標:(1,1) ~ (2,2)

public class P10000855 : RandomPortal
{
    public P10000855()
    {
        Init(10000855, 20104000, 1, 22, 2, 23);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:訓練所2F(20104000)
//目標坐標:(1,22) ~ (2,23)

public class P10000856 : RandomPortal
{
    public P10000856()
    {
        Init(10000856, 20115000, 1, 1, 2, 2);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:左門兵營3F(20115000)
//目標坐標:(1,1) ~ (2,2)

public class P10000857 : RandomPortal
{
    public P10000857()
    {
        Init(10000857, 20130000, 1, 36, 2, 38);
    }
}
//原始地圖:不死皇城(10069000)
//目標地圖:連絡通路(20130000)
//目標坐標:(1,36) ~ (2,38)

public class P10000858 : RandomPortal
{
    public P10000858()
    {
        Init(10000858, 20101000, 1, 1, 2, 2);
    }
}
//原始地圖:右門兵營1F(20100000)
//目標地圖:右門兵營2F(20101000)
//目標坐標:(1,1) ~ (2,2)

public class P10000859 : RandomPortal
{
    public P10000859()
    {
        Init(10000859, 20129000, 14, 16, 15, 18);
    }
}
//原始地圖:右門兵營1F(20100000)
//目標地圖:城市入口(20129000)
//目標坐標:(14,16) ~ (15,18)

public class P10000860 : RandomPortal
{
    public P10000860()
    {
        Init(10000860, 20103000, 1, 11, 2, 13);
    }
}
//原始地圖:右門兵營1F(20100000)
//目標地圖:訓練所1F(20103000)
//目標坐標:(1,11) ~ (2,13)

public class P10000861 : RandomPortal
{
    public P10000861()
    {
        Init(10000861, 20100000, 1, 1, 2, 2);
    }
}
//原始地圖:右門兵營2F(20101000)
//目標地圖:右門兵營1F(20100000)
//目標坐標:(1,1) ~ (2,2)

public class P10000862 : RandomPortal
{
    public P10000862()
    {
        Init(10000862, 20102000, 1, 22, 2, 23);
    }
}
//原始地圖:右門兵營2F(20101000)
//目標地圖:右門兵營3F(20102000)
//目標坐標:(1,22) ~ (2,23)

public class P10000863 : RandomPortal
{
    public P10000863()
    {
        Init(10000863, 20104000, 1, 11, 2, 13);
    }
}
//原始地圖:右門兵營2F(20101000)
//目標地圖:訓練所2F(20104000)
//目標坐標:(1,11) ~ (2,13)

public class P10000864 : RandomPortal
{
    public P10000864()
    {
        Init(10000864, 10069000, 129, 155, 130, 156);
    }
}
//原始地圖:右門兵營3F(20102000)
//目標地圖:不死皇城(10069000)
//目標坐標:(129,155) ~ (130,156)

public class P10000865 : RandomPortal
{
    public P10000865()
    {
        Init(10000865, 10069000, 125, 163, 126, 164);
    }
}
//原始地圖:右門兵營3F(20102000)
//目標地圖:不死皇城(10069000)
//目標坐標:(125,163) ~ (126,164)

public class P10000866 : RandomPortal
{
    public P10000866()
    {
        Init(10000866, 20101000, 1, 22, 2, 23);
    }
}
//原始地圖:右門兵營3F(20102000)
//目標地圖:右門兵營2F(20101000)
//目標坐標:(1,22) ~ (2,23)

public class P10000867 : RandomPortal
{
    public P10000867()
    {
        Init(10000867, 10069000, 153, 163, 154, 164);
    }
}
//原始地圖:右門兵營3F(20102000)
//目標地圖:不死皇城(10069000)
//目標坐標:(153,163) ~ (154,164)

public class P10000868 : RandomPortal
{
    public P10000868()
    {
        Init(10000868, 20104000, 1, 1, 2, 2);
    }
}
//原始地圖:訓練所1F(20103000)
//目標地圖:訓練所2F(20104000)
//目標坐標:(1,1) ~ (2,2)

public class P10000869 : RandomPortal
{
    public P10000869()
    {
        Init(10000869, 20100000, 22, 11, 23, 13);
    }
}
//原始地圖:訓練所1F(20103000)
//目標地圖:右門兵營1F(20100000)
//目標坐標:(22,11) ~ (23,13)

public class P10000870 : RandomPortal
{
    public P10000870()
    {
        Init(10000870, 20103000, 1, 1, 2, 2);
    }
}
//原始地圖:訓練所2F(20104000)
//目標地圖:訓練所1F(20103000)
//目標坐標:(1,1) ~ (2,2)

public class P10000871 : RandomPortal
{
    public P10000871()
    {
        Init(10000871, 20101000, 22, 11, 23, 13);
    }
}
//原始地圖:訓練所2F(20104000)
//目標地圖:右門兵營2F(20101000)
//目標坐標:(22,11) ~ (23,13)

public class P10000872 : RandomPortal
{
    public P10000872()
    {
        Init(10000872, 10069000, 159, 173, 160, 174);
    }
}
//原始地圖:訓練所2F(20104000)
//目標地圖:不死皇城(10069000)
//目標坐標:(159,173) ~ (160,174)

public class P10000873 : RandomPortal
{
    public P10000873()
    {
        Init(10000873, 10069000, 160, 177, 161, 178);
    }
}
//原始地圖:訓練所2F(20104000)
//目標地圖:不死皇城(10069000)
//目標坐標:(160,177) ~ (161,178)

public class P10000874 : RandomPortal
{
    public P10000874()
    {
        Init(10000874, 20106000, 2, 32, 3, 33);
    }
}
//原始地圖:監獄(20105000)
//目標地圖:法務官之間(20106000)
//目標坐標:(2,32) ~ (3,33)

public class P10000875 : RandomPortal
{
    public P10000875()
    {
        Init(10000875, 20107000, 7, 1, 9, 2);
    }
}
//原始地圖:法務官之間(20106000)
//目標地圖:政務官之間(20107000)
//目標坐標:(7,1) ~ (9,2)

public class P10000876 : RandomPortal
{
    public P10000876()
    {
        Init(10000876, 10069000, 170, 131, 171, 132);
    }
}
//原始地圖:法務官之間(20106000)
//目標地圖:不死皇城(10069000)
//目標坐標:(170,131) ~ (171,132)

public class P10000877 : Event
{
    public P10000877()
    {
        this.EventID = 10000877;
    }

    public override void OnEvent(ActorPC pc)
    {
        Say(pc, 131, "被封印了$R;");
        switch (Select(pc, "使用「紋章紙」嗎？", "", "使用", "不使用"))
        {
            case 1:
                if (pc.Account.GMLevel >= 100)
                {
                    Say(pc, 131, "GM用啥「紋章紙」啊!$R;");
                    Say(pc, 131, "OTZ!$R;");
                    Warp(pc, 20105000, 3, 32);
                    return;
                }
                if (CountItem(pc, 10024900) >= 1)
                {
                    TakeItem(pc, 10024900, 1);
                    PlaySound(pc, 2218, false, 100, 50);
                    Say(pc, 131, "焚燒了「紋章紙」$R;");
                    Warp(pc, 20105000, 3, 32);
                    return;
                }
                Say(pc, 131, "沒有「紋章紙」呀$R;");
                break;
            case 2:
                break;
        }
    }
}
//原始地圖:法務官之間(20106000)
//目標地圖:監獄(20105000)
//目標坐標:(2,32) ~ (4,33)

public class P10000878 : RandomPortal
{
    public P10000878()
    {
        Init(10000878, 20106000, 8, 1, 10, 2);
    }
}
//原始地圖:政務官之間(20107000)
//目標地圖:法務官之間(20106000)
//目標坐標:(8,1) ~ (10,2)

public class P10000879 : Event
{
    public P10000879()
    {
        this.EventID = 10000879;
    }

    public override void OnEvent(ActorPC pc)
    {
        if (pc.Account.GMLevel >= 100)
        {
            switch (Select(pc, "管理員模式", "", "阿卡茲的房間(普通)", "阿卡茲的房間(任務)", "算了"))
            {
                case 1:
                    Warp(pc, 20120000, 8, 26);
                    break;
                case 2:
                    Warp(pc, 50001000, 8, 26);
                    break;
            }
            return;
        }

        Say(pc, 131, "被封印了$R;");
        switch (Select(pc, "使用「紋章紙」嗎？", "", "使用", "不使用"))
        {
            case 1:
                if (CountItem(pc, 10024900) >= 1)
                {
                    TakeItem(pc, 10024900, 1);
                    PlaySound(pc, 2218, false, 100, 50);
                    Say(pc, 131, "焚燒了「紋章紙」$R;");
                    PlaySound(pc, 2444, false, 100, 50);
                    if (pc.PossesionedActors.Count != 0)
                    {
                        Warp(pc, 20120000, 8, 26);
                        return;
                    }
                    /*
                    if (_5a60 && !_5a66)
                    {
                        //EVENTMAP_IN 1 1 8 27 4
                        //SWITCH START
                        //ME.WORK0 = -1 EVT1000087903
                        //SWITCH END
                        return;
                    }
                    */
                    Warp(pc, 20120000, 8, 26);
                    return;
                }
                Say(pc, 131, "沒有「紋章紙」呀$R;");
                break;
            case 2:
                break;
        }
    }
}
//原始地圖:皇宮1F(20108000)
//目標地圖:阿卡茲的房間(20120000)
//目標坐標:(7,26) ~ (9,27)

public class P10000880 : RandomPortal
{
    public P10000880()
    {
        Init(10000880, 20129000, 7, 1, 9, 2);
    }
}
//原始地圖:皇宮1F(20108000)
//目標地圖:城市入口(20129000)
//目標坐標:(7,1) ~ (9,2)

public class P10000881 : RandomPortal
{
    public P10000881()
    {
        Init(10000881, 20109000, 19, 21, 21, 22);
    }
}
//原始地圖:皇宮1F(20108000)
//目標地圖:皇宮2F(20109000)
//目標坐標:(19,21) ~ (21,22)

public class P10000882 : RandomPortal
{
    public P10000882()
    {
        Init(10000882, 20121000, 8, 49, 10, 49);
    }
}
//原始地圖:皇宮2F(20109000)
//目標地圖:大宴會場(20121000)
//目標坐標:(8,49) ~ (10,49)

public class P10000883 : RandomPortal
{
    public P10000883()
    {
        Init(10000883, 20110000, 19, 1, 21, 2);
    }
}
//原始地圖:皇宮2F(20109000)
//目標地圖:皇宮3F(20110000)
//目標坐標:(19,1) ~ (21,2)

public class P10000884 : RandomPortal
{
    public P10000884()
    {
        Init(10000884, 20121000, 28, 49, 30, 49);
    }
}
//原始地圖:皇宮2F(20109000)
//目標地圖:大宴會場(20121000)
//目標坐標:(28,49) ~ (30,49)

public class P10000885 : RandomPortal
{
    public P10000885()
    {
        Init(10000885, 20130000, 7, 1, 9, 2);
    }
}
//原始地圖:皇宮2F(20109000)
//目標地圖:連絡通路(20130000)
//目標坐標:(7,1) ~ (9,2)

public class P10000886 : RandomPortal
{
    public P10000886()
    {
        Init(10000886, 20108000, 18, 21, 20, 22);
    }
}
//原始地圖:皇宮2F(20109000)
//目標地圖:皇宮1F(20108000)
//目標坐標:(18,21) ~ (20,22)

public class P10000887 : RandomPortal
{
    public P10000887()
    {
        Init(10000887, 20122000, 7, 36, 7, 36);
    }
}
//原始地圖:皇宮3F(20110000)
//目標地圖:小宴會場(20122000)
//目標坐標:(7,36) ~ (7,36)

public class P10000888 : RandomPortal
{
    public P10000888()
    {
        Init(10000888, 20109000, 19, 1, 21, 2);
    }
}
//原始地圖:皇宮3F(20110000)
//目標地圖:皇宮2F(20109000)
//目標坐標:(19,1) ~ (21,2)

public class P10000889 : RandomPortal
{
    public P10000889()
    {
        Init(10000889, 20122000, 31, 36, 31, 36);
    }
}
//原始地圖:皇宮3F(20110000)
//目標地圖:小宴會場(20122000)
//目標坐標:(31,36) ~ (31,36)

public class P10000890 : RandomPortal
{
    public P10000890()
    {
        Init(10000890, 10069000, 119, 144, 120, 145);
    }
}
//原始地圖:皇宮3F(20110000)
//目標地圖:不死皇城(10069000)
//目標坐標:(119,144) ~ (120,145)

public class P10000891 : RandomPortal
{
    public P10000891()
    {
        Init(10000891, 20111000, 31, 21, 31, 21);
    }
}
//原始地圖:皇宮3F(20110000)
//目標地圖:謁見之間(20111000)
//目標坐標:(31,21) ~ (31,21)

public class P10000892 : RandomPortal
{
    public P10000892()
    {
        Init(10000892, 10069000, 127, 118, 127, 119);
    }
}
//原始地圖:謁見之間(20111000)
//目標地圖:不死皇城(10069000)
//目標坐標:(127,118) ~ (127,119)

public class P10000893 : RandomPortal
{
    public P10000893()
    {
        Init(10000893, 20110000, 19, 21, 21, 22);
    }
}
//原始地圖:謁見之間(20111000)
//目標地圖:皇宮3F(20110000)
//目標坐標:(19,21) ~ (21,22)

public class P10000894 : RandomPortal
{
    public P10000894()
    {
        Init(10000894, 20112000, 1, 14, 2, 16);
    }
}
//原始地圖:謁見之間(20111000)
//目標地圖:王之寢室(20112000)
//目標坐標:(1,14) ~ (2,16)

public class P10000895 : RandomPortal
{
    public P10000895()
    {
        Init(10000895, 20111000, 26, 1, 26, 1);
    }
}
//原始地圖:王之寢室(20112000)
//目標地圖:謁見之間(20111000)
//目標坐標:(26,1) ~ (26,1)

public class P10000896 : Event
{
    public P10000896()
    {
        this.EventID = 10000896;
    }

    public override void OnEvent(ActorPC pc)
    {
        switch (Select(pc, "發現暖爐的隱藏通道!", "", "去看看", "不做危險的事情"))
        {
            case 1:
                PlaySound(pc, 2443, false, 100, 50);
                Wait(pc, 2000);
                Warp(pc, 10069000, 137, 144);
                break;
            case 2:
                break;
        }

    }
}
//原始地圖:王之寢室(20112000)
//目標地圖:不死皇城(10069000)
//目標坐標:(137,144) ~ (138,145)

public class P10000897 : RandomPortal
{
    public P10000897()
    {
        Init(10000897, 20114000, 1, 1, 2, 2);
    }
}
//原始地圖:左門兵營1F(20113000)
//目標地圖:左門兵營2F(20114000)
//目標坐標:(1,1) ~ (2,2)

public class P10000898 : RandomPortal
{
    public P10000898()
    {
        Init(10000898, 20129000, 1, 16, 2, 18);
    }
}
//原始地圖:左門兵營1F(20113000)
//目標地圖:城市入口(20129000)
//目標坐標:(1,16) ~ (2,18)

public class P10000899 : RandomPortal
{
    public P10000899()
    {
        Init(10000899, 20113000, 1, 1, 2, 2);
    }
}
//原始地圖:左門兵營2F(20114000)
//目標地圖:左門兵營1F(20113000)
//目標坐標:(1,1) ~ (2,2)

public class P10000900 : RandomPortal
{
    public P10000900()
    {
        Init(10000900, 20115000, 23, 1, 24, 2);
    }
}
//原始地圖:左門兵營2F(20114000)
//目標地圖:左門兵營3F(20115000)
//目標坐標:(23,1) ~ (24,2)

public class P10000901 : RandomPortal
{
    public P10000901()
    {
        Init(10000901, 20130000, 1, 16, 2, 18);
    }
}
//原始地圖:左門兵營2F(20114000)
//目標地圖:連絡通路(20130000)
//目標坐標:(1,16) ~ (2,18)

public class P10000902 : RandomPortal
{
    public P10000902()
    {
        Init(10000902, 10069000, 88, 161, 89, 162);
    }
}
//原始地圖:左門兵營3F(20115000)
//目標地圖:不死皇城(10069000)
//目標坐標:(88,161) ~ (89,162)

public class P10000903 : RandomPortal
{
    public P10000903()
    {
        Init(10000903, 20114000, 23, 1, 24, 2);
    }
}
//原始地圖:左門兵營3F(20115000)
//目標地圖:左門兵營2F(20114000)
//目標坐標:(23,1) ~ (24,2)

public class P10000904 : RandomPortal
{
    public P10000904()
    {
        Init(10000904, 10069000, 98, 171, 99, 172);
    }
}
//原始地圖:左門兵營3F(20115000)
//目標地圖:不死皇城(10069000)
//目標坐標:(98,171) ~ (99,172)

public class P10000905 : RandomPortal
{
    public P10000905()
    {
        Init(10000905, 20117000, 14, 33, 15, 34);
    }
}
//原始地圖:本館1F(20116000)
//目標地圖:本館2F(20117000)
//目標坐標:(14,33) ~ (15,34)

public class P10000906 : RandomPortal
{
    public P10000906()
    {
        Init(10000906, 10069000, 94, 84, 95, 85);
    }
}
//原始地圖:本館2F(20117000)
//目標地圖:不死皇城(10069000)
//目標坐標:(94,84) ~ (95,85)

public class P10000907 : RandomPortal
{
    public P10000907()
    {
        Init(10000907, 10069000, 84, 113, 85, 114);
    }
}
//原始地圖:本館2F(20117000)
//目標地圖:不死皇城(10069000)
//目標坐標:(84,113) ~ (85,114)

public class P10000908 : RandomPortal
{
    public P10000908()
    {
        Init(10000908, 20118000, 14, 28, 15, 29);
    }
}
//原始地圖:本館2F(20117000)
//目標地圖:本館3F(20118000)
//目標坐標:(14,28) ~ (15,29)

public class P10000909 : RandomPortal
{
    public P10000909()
    {
        Init(10000909, 20116000, 18, 30, 19, 32);
    }
}
//原始地圖:本館2F(20117000)
//目標地圖:本館1F(20116000)
//目標坐標:(18,30) ~ (19,32)

public class P10000910 : RandomPortal
{
    public P10000910()
    {
        Init(10000910, 20119000, 14, 1, 15, 2);
    }
}
//原始地圖:本館3F(20118000)
//目標地圖:本館4F(20119000)
//目標坐標:(14,1) ~ (15,2)

public class P10000911 : RandomPortal
{
    public P10000911()
    {
        Init(10000911, 20117000, 14, 28, 15, 29);
    }
}
//原始地圖:本館3F(20118000)
//目標地圖:本館2F(20117000)
//目標坐標:(14,28) ~ (15,29)

public class P10000912 : RandomPortal
{
    public P10000912()
    {
        Init(10000912, 20118000, 14, 33, 15, 34);
    }
}
//原始地圖:本館4F(20119000)
//目標地圖:本館3F(20118000)
//目標坐標:(14,33) ~ (15,34)

public class P10000913 : RandomPortal
{
    public P10000913()
    {
        Init(10000913, 10069000, 94, 144, 95, 145);
    }
}
//原始地圖:本館4F(20119000)
//目標地圖:不死皇城(10069000)
//目標坐標:(94,144) ~ (95,145)

public class P10000914 : RandomPortal
{
    public P10000914()
    {
        Init(10000914, 20108000, 18, 1, 20, 2);
    }
}
//原始地圖:阿卡茲的房間(20120000)
//目標地圖:皇宮1F(20108000)
//目標坐標:(18,1) ~ (20,2)

public class P10000915 : RandomPortal
{
    public P10000915()
    {
        Init(10000915, 20109000, 6, 1, 8, 2);
    }
}
//原始地圖:大宴會場(20121000)
//目標地圖:皇宮2F(20109000)
//目標坐標:(6,1) ~ (8,2)

public class P10000916 : RandomPortal
{
    public P10000916()
    {
        Init(10000916, 20109000, 32, 1, 34, 2);
    }
}
//原始地圖:大宴會場(20121000)
//目標地圖:皇宮2F(20109000)
//目標坐標:(32,1) ~ (34,2)

public class P10000917 : RandomPortal
{
    public P10000917()
    {
        Init(10000917, 20124000, 23, 46, 25, 46);
    }
}
//原始地圖:小宴會場(20122000)
//目標地圖:禮拜堂3F(20124000)
//目標坐標:(23,46) ~ (25,46)

public class P10000918 : RandomPortal
{
    public P10000918()
    {
        Init(10000918, 20110000, 8, 1, 10, 2);
    }
}
//原始地圖:小宴會場(20122000)
//目標地圖:皇宮3F(20110000)
//目標坐標:(8,1) ~ (10,2)

public class P10000919 : RandomPortal
{
    public P10000919()
    {
        Init(10000919, 20110000, 30, 1, 32, 2);
    }
}
//原始地圖:小宴會場(20122000)
//目標地圖:皇宮3F(20110000)
//目標坐標:(30,1) ~ (32,2)

public class P10000920 : RandomPortal
{
    public P10000920()
    {
        Init(10000920, 20124000, 23, 1, 25, 1);
    }
}
//原始地圖:禮拜堂2F(20123000)
//目標地圖:禮拜堂3F(20124000)
//目標坐標:(23,1) ~ (25,1)

public class P10000921 : RandomPortal
{
    public P10000921()
    {
        Init(10000921, 10069000, 111, 82, 112, 83);
    }
}
//原始地圖:禮拜堂2F(20123000)
//目標地圖:不死皇城(10069000)
//目標坐標:(111,82) ~ (112,83)

public class P10000922 : RandomPortal
{
    public P10000922()
    {
        Init(10000922, 10069000, 143, 82, 144, 83);
    }
}
//原始地圖:禮拜堂2F(20123000)
//目標地圖:不死皇城(10069000)
//目標坐標:(143,82) ~ (144,83)

public class P10000923 : Event
{
    public P10000923()
    {
        this.EventID = 10000923;
    }

    public override void OnEvent(ActorPC pc)
    {
        Say(pc, 131, "被封印了$R;");
        switch (Select(pc, "使用「紋章紙」嗎？", "", "使用", "不使用"))
        {
            case 1:
                if (pc.Account.GMLevel >= 100)
                {
                    Say(pc, 131, "OTZ$R;");
                    Warp(pc, 20123000, 16, 1);
                    return;
                }
                if (CountItem(pc, 10024900) >= 1)
                {
                    TakeItem(pc, 10024900, 1);
                    PlaySound(pc, 2218, false, 100, 50);
                    Say(pc, 131, "焚燒了「紋章紙」$R;");
                    Warp(pc, 20123000, 16, 1);
                    return;
                }
                Say(pc, 131, "沒有「紋章紙」呀$R;");
                break;
            case 2:
                break;
        }

    }
}
//原始地圖:禮拜堂3F(20124000)
//目標地圖:禮拜堂2F(20123000)
//目標坐標:(15,1) ~ (17,2)

public class P10000924 : RandomPortal
{
    public P10000924()
    {
        Init(10000924, 20122000, 18, 2, 20, 2);
    }
}
//原始地圖:禮拜堂3F(20124000)
//目標地圖:小宴會場(20122000)
//目標坐標:(18,2) ~ (20,2)

public class P10000925 : RandomPortal
{
    public P10000925()
    {
        Init(10000925, 10069000, 127, 95, 128, 96);
    }
}
//原始地圖:聖者之間(20125000)
//目標地圖:不死皇城(10069000)
//目標坐標:(127,95) ~ (128,96)

public class P10000926 : RandomPortal
{
    public P10000926()
    {
        Init(10000926, 20127000, 22, 1, 23, 2);
    }
}
//原始地圖:倉庫1F(20126000)
//目標地圖:倉庫2F(20127000)
//目標坐標:(22,1) ~ (23,2)

public class P10000927 : RandomPortal
{
    public P10000927()
    {
        Init(10000927, 10069000, 156, 84, 157, 85);
    }
}
//原始地圖:倉庫2F(20127000)
//目標地圖:不死皇城(10069000)
//目標坐標:(156,84) ~ (157,85)

public class P10000928 : RandomPortal
{
    public P10000928()
    {
        Init(10000928, 20126000, 22, 1, 23, 2);
    }
}
//原始地圖:倉庫2F(20127000)
//目標地圖:倉庫1F(20126000)
//目標坐標:(22,1) ~ (23,2)

public class P10000929 : RandomPortal
{
    public P10000929()
    {
        Init(10000929, 20128000, 1, 22, 2, 23);
    }
}
//原始地圖:倉庫2F(20127000)
//目標地圖:倉庫3F(20128000)
//目標坐標:(1,22) ~ (2,23)

public class P10000930 : RandomPortal
{
    public P10000930()
    {
        Init(10000930, 20127000, 1, 22, 2, 23);
    }
}
//原始地圖:倉庫3F(20128000)
//目標地圖:倉庫2F(20127000)
//目標坐標:(1,22) ~ (2,23)

public class P10000931 : RandomPortal
{
    public P10000931()
    {
        Init(10000931, 20108000, 7, 21, 9, 22);
    }
}
//原始地圖:城市入口(20129000)
//目標地圖:皇宮1F(20108000)
//目標坐標:(7,21) ~ (9,22)

public class P10000932 : RandomPortal
{
    public P10000932()
    {
        Init(10000932, 20113000, 23, 6, 24, 8);
    }
}
//原始地圖:城市入口(20129000)
//目標地圖:左門兵營1F(20113000)
//目標坐標:(23,6) ~ (24,8)

public class P10000933 : RandomPortal
{
    public P10000933()
    {
        Init(10000933, 20100000, 1, 7, 2, 9);
    }
}
//原始地圖:城市入口(20129000)
//目標地圖:右門兵營1F(20100000)
//目標坐標:(1,7) ~ (2,9)

public class P10000934 : RandomPortal
{
    public P10000934()
    {
        Init(10000934, 20130000, 14, 36, 15, 38);
    }
}
//原始地圖:城市入口(20129000)
//目標地圖:連絡通路(20130000)
//目標坐標:(14,36) ~ (15,38)

public class P10000935 : RandomPortal
{
    public P10000935()
    {
        Init(10000935, 10069000, 119, 185, 120, 186);
    }
}
//原始地圖:城市入口(20129000)
//目標地圖:不死皇城(10069000)
//目標坐標:(119,185) ~ (120,186)

public class P10000936 : RandomPortal
{
    public P10000936()
    {
        Init(10000936, 20109000, 8, 21, 10, 22);
    }
}
//原始地圖:連接通路(20130000)
//目標地圖:皇宮2F(20109000)
//目標坐標:(8,21) ~ (10,22)

public class P10000937 : RandomPortal
{
    public P10000937()
    {
        Init(10000937, 20114000, 23, 6, 24, 8);
    }
}
//原始地圖:連接通路(20130000)
//目標地圖:左門兵營2F(20114000)
//目標坐標:(23,6) ~ (24,8)

public class P10000938 : RandomPortal
{
    public P10000938()
    {
        Init(10000938, 10069000, 118, 176, 119, 177);
    }
}
//原始地圖:連接通路(20130000)
//目標地圖:不死皇城(10069000)
//目標坐標:(118,176) ~ (119,177)

public class P10000939 : RandomPortal
{
    public P10000939()
    {
        Init(10000939, 20129000, 14, 36, 15, 38);
    }
}
    //原始地圖:連接通路(20130000)
    //目標地圖:城市入口(20129000)
    //目標坐標:(14,36) ~ (15,38)

}