using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M30090001
{
    public class S11000767 : Event
    {
        public S11000767()
        {
            this.EventID = 11000767;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<MZTYSFlags> mask = pc.CMask["MZTYS"];
            if (pc.Account.GMLevel >= 100)
            {
                switch (Select(pc, "管理者模式", "", "武器合成", "装备样式还原", "听取武器合成的注意要点", "什么都不做", "普通对话"))
                {
                    case 1:
                        ItemFusion(pc, "这个价格、可以么？");
                        return;
                    case 2:
                        ItemFusion(pc, "这个价格、可以么？");
                        return;
                    case 3:
                        Say(pc, 131, "想合成武器的话$R;" +
                            "$R需要保留外貌和保留能力$R;" +
                            "的两种道具。$R;" +
                            "$R一定需要两种哦$R;" +
                            "$P武器合成后$R;" +
                            "两件道具将成为一件$R;" +
                            "$R武器将「不能还原」，请注意$R;" +
                            "$P每件道具都有属性$R;" +
                            "如果两件道具属性不和$R;" +
                            "就不能进行武器合成$R;" +
                            "$R属性的条件有很多$R;" +
                            "$P而最重要的，就是必须同一种装备$R;" +
                            "$R例如在头盔的外形上$R;" +
                            "加上甲衣的属性$R;" +
                            "怎么看都是不可能的吧$R;" +
                            "$P除此之外，$R还有两者的性别、种族、$R;" +
                            "职业、所属团体、等级等，很多条件$R;" +
                            "你们自己找一些属性相和的道具$R;" +
                            "试试看吧$R;" +
                            "$P武器合成成功的话$R;" +
                            "会出现一个★型图示$R;" +
                            "$R如果想知道道具的外形$R;" +
                            "或者是更详尽的资料$R;" +
                            "请用滑鼠右击，在外形资料里查看$R;" +
                            "$P如果可以的话$R;" +
                            "先用比较便宜的道具，试试各种合成$R;" +
                            "因为武器合成可以反覆试验$R;" +
                            "$R已合成的武器$R;" +
                            "外型看起来好像有破损的话$R;" +
                            "可以跟其他道具再次合成。$R;" +
                            "$P喜欢的东西要好好珍惜啊！$R;" +
                            "$P……$R;" +
                            "$P对吧！虽然是听说的，但也有道理。$R;" +
                            "$R好像有叫『完美的丝』$R;" +
                            "可以提高成功率的道具呢$R;" +
                            "$R要怎样才能找到呢？$R;");
                        return;
                    case 4:
                        return;
                }
            }

            if (!mask.Test(MZTYSFlags.交給謎語團面具))
            {
                if (mask.Test(MZTYSFlags.幫忙送謎語團面具))
                {
                    if (CountItem(pc, 50025080) >= 1)
                    {
                        Say(pc, 131, "已经把帽子转交给布鲁了嘛？$R;");
                        return;
                    }
                    mask.SetValue(MZTYSFlags.交給謎語團面具, true);
                    TakeItem(pc, 10000306, 1);
                    Say(pc, 131, "冒险者，你好！$R;" +
                        "$R噢！布鲁让你给我带药了？$R;" +
                        "$P看你把药拿回来，$R;" +
                        "一定已经把面具交给布鲁了。$R;" +
                        "$R真是感谢你呢$R;" +
                        "$P对了，如果你的装备里$R;" +
                        "有快坏掉的东西的话$R;" +
                        "现在就告诉我吧$R;" +
                        "$R我会像布鲁的面具那样$R;" +
                        "给你改装装备的外貌的$R;" +
                        "$P像这样将两件道具合成一件的技术$R;" +
                        "发明的时候，开始就叫「武器合成」$R;" +
                        "$P如果进行武器合成的话$R;" +
                        "道具会变成一个$R;" +
                        "$R以后就不能变回原状态了$R;" +
                        "$R所以要注意哦$R;" +
                        "$P像我这样的叫做「合成匠人」$R;" +
                        "$R很久以前$R;" +
                        "据说有很多像我这样的人$R;" +
                        "但是现在的人，$R如果装备坏掉，都直接扔掉啦$R;" +
                        "然后再购买新装备$R;" +
                        "$P所以像我这样的匠人$R;" +
                        "就剩的不多了$R;" +
                        "$R也许因为时代变化太多了，唉$R;");
                    return;
                }
                if (mask.Test(MZTYSFlags.收到謎語團面具))
                {
                    Say(pc, 131, "已经把帽子转交给布鲁了嘛？$R;");
                    return;
                }
                if (mask.Test(MZTYSFlags.詢問謎語團面具))
                {
                    Say(pc, 131, "冒险者，我有事情想拜托你$R;" +
                        "$R可以将这个帽子$R;" +
                        "转交给布鲁嘛?$R;");
                    switch (Select(pc, "该怎么办呢？", "", "交给他", "不交给他"))
                    {
                        case 1:
                            if (CheckInventory(pc, 50025080, 1))
                            {
                                GiveItem(pc, 50025080, 1);
                                mask.SetValue(MZTYSFlags.收到謎語團面具, true);
                                Say(pc, 131, "收到了『布鲁的帽子』$R;", "");
                                Say(pc, 131, "打开道具仓，$R;" +
                                    "看看给你的道具吧。$R;" +
                                    "$P看到贴着★的『艾米头盔』嘛？$R;" +
                                    "这就是刚才给你的道具。$R;" +
                                    "$R像这样变更外型的话$R;" +
                                    "就会贴著★图示。$R;" +
                                    "$P贴著★的图示$R;" +
                                    "外型跟实际的性能不一样的阿。$R;" +
                                    "一定要记住呀。$R;" +
                                    "哎呀，说的太多了。$R;" +
                                    "一定要帮我把$R;" +
                                    "『布鲁的帽子』交给他啊！$R;");
                                return;
                            }
                            Say(pc, 131, "要拿的东西太多了$R;" +
                                "该怎么办呢？$R;");
                            break;
                    }
                    return;
                }
                if (mask.Test(MZTYSFlags.交給藥))
                {
                    Say(pc, 131, "这不是冒险者嘛？$R;" +
                        "什么事啊？$R;");
                    switch (Select(pc, "有什么事嘛？", "", "布鲁拜托的事情是什么啊？", "没什么事。"))
                    {
                        case 1:
                            mask.SetValue(MZTYSFlags.詢問謎語團面具, true);
                            Say(pc, 131, "请将布鲁弄坏的『谜之团面具』外貌$R;" +
                                "贴在『艾米头盔』上。$R;" +
                                "$P在谜之团，如果把面具弄坏的话$R;" +
                                "就会被赶出来的$R;" +
                                "$R所以这样做的话$R;" +
                                "只需要把面具原来的外形$R;" +
                                "贴在别的装备上，就可以蒙混过关$R;" +
                                "$P这样看起来就像『谜之团面具』$R;" +
                                "$R谜之团的人$R;" +
                                "一直使用一样的面具的。$R;" +
                                "$P在我们聊的期间$R;" +
                                "布鲁的面具已经完成了。$R;");
                            Say(pc, 131, "冒险者，我有事情想拜托你$R;" +
                                "$R可以将这个面具$R;" +
                                "转交给布鲁嘛?$R;");
                            switch (Select(pc, "该怎么办呢？", "", "交给他", "不交给他"))
                            {
                                case 1:
                                    if (CheckInventory(pc, 50025080, 1))
                                    {
                                        GiveItem(pc, 50025080, 1);
                                        mask.SetValue(MZTYSFlags.收到謎語團面具, true);
                                        Say(pc, 131, "收到了『布鲁的帽子』$R;");
                                        Say(pc, 131, "打开道具仓，$R;" +
                                            "看看给你的道具吧。$R;" +
                                            "$P看到贴着★的『艾米头盔』嘛？$R;" +
                                            "这就是刚才给你的道具。$R;" +
                                            "$R像这样变更外型的话$R;" +
                                            "就会贴着★图示。$R;" +
                                            "$P贴着★的图示$R;" +
                                            "外型跟实际的性能不一样的阿。$R;" +
                                            "一定要记住呀。$R;" +
                                            "哎呀，说的太多了。$R;" +
                                            "一定要帮我把$R;" +
                                            "『布鲁的帽子』交给他啊！$R;");
                                        return;
                                    }
                                    Say(pc, 131, "要拿的东西太多了$R;" +
                                        "该怎么办呢？$R;");
                                    break;
                            }
                            break;
                    }
                    return;
                }
                if (CountItem(pc, 10000306) == 0)
                {
                    Say(pc, 131, "咳咳！$R;" +
                        "$R竟然有访客？竟然还有这种事$R;" +
                        "真是可爱的冒险者$R;" +
                        "$P不过不好意思，我今天不太舒服$R;" +
                        "请回吧，咳咳！$R;");
                    return;
                }
                mask.SetValue(MZTYSFlags.交給藥, true);
                TakeItem(pc, 10000306, 1);
                Say(pc, 131, "咳咳！$R;" +
                    "$R有人来了……$R大概有别的事吧！$R;" +
                    "真是可爱的冒险者。$R;" +
                    "$P这不是从布鲁那拿来的药嘛？$R;");
                ShowEffect(pc, 11000767, 4118);
                Wait(pc, 3000);
                Say(pc, 131, "那些药好像挺有效的$R;" +
                    "谢谢您拿来给我喔$R;" +
                    "$R真的感谢您$R;" +
                    "$P还要代我跟布鲁说声谢谢…嘻嘻…$R;" +
                    "$R他这个人真奇怪啊！$R;" +
                    "我都不认识他$R;" +
                    "他居然还让人给我送药呢$R;" +
                    "$P真好，身体好多了，$R;" +
                    "虽然只是布鲁拜托的事情$R;" +
                    "也试试看吧……$R;");
                return;
            }

            Say(pc, 131, "噢！$R冒险者，请进$R;" +
                "今天你想做什么呢？$R;");
            switch (Select(pc, "今天你想做什么呢？", "", "武器合成", "听取武器合成的注意要点", "什么都不做"))
            {
                case 1:
                    ItemFusion(pc, "这个价格、可以么？");
                    break;
                case 2:
                    Say(pc, 131, "想合成武器的话$R;" +
                        "$R需要保留外貌和保留能力$R;" +
                        "的两种道具。$R;" +
                        "$R一定需要两种唷$R;" +
                        "$P武器合成后$R;" +
                        "两件道具将成为一件$R;" +
                        "$R武器将「不能还原」，请注意$R;" +
                        "$P每件道具都有属性$R;" +
                        "如果两件道具属性不和$R;" +
                        "就不能进行武器合成$R;" +
                        "$R属性的条件有很多$R;" +
                        "$P而最重要的，就是必须同一种装备$R;" +
                        "$R例如在头盔的外形上$R;" +
                        "加上甲衣的属性$R;" +
                        "怎么看都是不可能的吧$R;" +
                        "$P除此之外，$R还有两者的性别、种族、$R;" +
                        "职业、所属团体、等级等，很多条件$R;" +
                        "你们自己找一些属性相和的道具$R;" +
                        "试试看吧$R;" +
                        "$P武器合成成功的话$R;" +
                        "会出现一个★型图示$R;" +
                        "$R如果想知道道具的外形$R;" +
                        "或者是更详尽的资料$R;" +
                        "请用滑鼠右击，在外形资料室里查看$R;" +
                        "$P如果可以的话$R;" +
                        "先用比较便宜的道具，试试各种合成$R;" +
                        "因为武器合成可以反覆试验$R;" +
                        "$R已合成的武器$R;" +
                        "外型看起来好像有破损的话$R;" +
                        "可以跟其他道具再次合成。$R;" +
                        "$P喜欢的东西要好好珍惜啊！$R;" +
                        "$P……$R;" +
                        "$P对吧！虽然是听说的，但也有道理。$R;" +
                        "$R这里好像有叫『完美的丝』$R;" +
                        "可以提高成功率的道具呢$R;" +
                        "$R要怎样才能找到呢？$R;");
                    break;
            }
        }
    }
}