using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;

namespace SagaScript
{
    //原始地圖:50146000	次元冰洁的坑道B1F房间内往里走
    //目標地圖:50146000	次元冰洁的坑道B1F房间外传送器
    //目標坐標:(1,126) ~ (3,129)
    public class P10001977 : RandomPortal
    {
        public P10001977()
        {
            Init(10001977, 50146000, 78, 66, 78, 66);
        }
    }

    //原始地圖:50146000	次元冰洁的坑道B1F房间外传送器
    //目標地圖:50146000	次元冰洁的坑道B1F房间内往深处走
    //目標坐標:(1,126) ~ (3,129)
    public class P10001978 : RandomPortal
    {
        public P10001978()
        {
            Init(10001978, 50146000, 58, 66, 58, 66);
        }
    }

    //原始地圖:50146000	次元冰洁的坑道B1F
    //目標地圖:50145000	次元冰洁的坑道B2F
    //目標坐標:(1,126) ~ (3,129)
    public class P10001979 : RandomPortal
    {
        public P10001979()
        {
            Init(10001979, 50145000, 115, 66, 115, 66);
        }
    }

    //原始地圖:50145000	次元冰洁的坑道B2F
    //目標地圖:50146000	次元冰洁的坑道B1F
    //目標坐標:
    public class P10001980 : RandomPortal
    {
        public P10001980()
        {
            Init(10001980, 50146000, 113, 65, 113, 65);
        }
    }

    //原始地圖:50145000	次元冰洁的坑道B2F
    //目標地圖:50144000	次元冰洁的坑道B3F
    //目標坐標:
    public class P10001988 : RandomPortal
    {
        public P10001988()
        {
            Init(10001988, 50144000, 12, 109, 12, 109);
        }
    }

    //原始地圖:50144000	次元冰洁的坑道B3F
    //目標地圖:50145000	次元冰洁的坑道B2F
    //目標坐標:
    public class P10001987 : RandomPortal
    {
        public P10001987()
        {
            Init(10001987, 50145000, 12, 109, 12, 109);
        }
    }

    //原始地圖:50144000	次元冰洁的坑道B3F左下方路口左
    //目標地圖:50144000	次元冰洁的坑道B3F左下方路口右
    //目標坐標:
    public class P10001981 : RandomPortal
    {
        public P10001981()
        {
            Init(10001981, 50144000, 111, 110, 111, 110);
        }
    }

    //原始地圖:50144000	次元冰洁的坑道B3F左下方路口右
    //目標地圖:50144000	次元冰洁的坑道B3F左下方路口左
    //目標坐標:
    public class P10001982 : RandomPortal
    {
        public P10001982()
        {
            Init(10001982, 50144000, 99, 114, 99, 114);
        }
    }


    //原始地圖:50144000	次元冰洁的坑道B3F右上方路口右
    //目標地圖:50144000	次元冰洁的坑道B3F右上方路口左
    //目標坐標:
    public class P10001983 : RandomPortal
    {
        public P10001983()
        {
            Init(10001983, 50144000, 69, 65, 69, 65);
        }
    }

    //原始地圖:50144000	次元冰洁的坑道B3F右上方路口左
    //目標地圖:50144000	次元冰洁的坑道B3F右上方路口右
    //目標坐標:
    public class P10001984 : RandomPortal
    {
        public P10001984()
        {
            Init(10001984, 50144000, 88, 63, 88, 63);
        }
    }


    //原始地圖:50144000	次元冰洁的坑道B3F左上方路口右
    //目標地圖:50144000	次元冰洁的坑道B3F左上方路口左
    //目標坐標:
    public class P10001985 : RandomPortal
    {
        public P10001985()
        {
            Init(10001985, 50144000, 44, 68, 44, 68);
        }
    }

    //原始地圖:50144000	次元冰洁的坑道B3F左上方路口右
    //目標地圖:50144000	次元冰洁的坑道B3F左上方路口左
    //目標坐標:
    public class P10001986 : RandomPortal
    {
        public P10001986()
        {
            Init(10001986, 50144000, 57, 65, 57, 65);
        }
    }


    //下面是南DD
    //原始地圖:50149000	次元南部地牢B1F
    //目標地圖:50148000	次元南部地牢B2F
    //目標坐標:
    public class P10001989 : RandomPortal
    {
        public P10001989()
        {
            Init(10001989, 50148000, 128, 242, 128, 242);
        }
    }

    //原始地圖:50148000	次元南部地牢B2F
    //目標地圖:50149000	次元南部地牢B1F
    //目標坐標:
    public class P10001994 : RandomPortal
    {
        public P10001994()
        {
            Init(10001994, 50149000, 128, 242, 128, 242);
        }
    }


    //原始地圖:50148000	次元南部地牢B2F
    //目標地圖:50147000	次元南部地牢B3F
    //目標坐標:
    public class P10001990 : RandomPortal
    {
        public P10001990()
        {
            Init(10001990, 50147000, 181, 71, 181, 71);
        }
    }

    //原始地圖:50147000	次元南部地牢B3F
    //目標地圖:50148000	次元南部地牢B2F
    //目標坐標:
    public class P10001993 : RandomPortal
    {
        public P10001993()
        {
            Init(10001993, 50148000, 180, 75, 180, 75);
        }
    }


    //原始地圖:50147000	次元南部地牢B3F
    //目標地圖:50150000	次元马尔科特码头
    //目標坐標:
    public class P10001999 : RandomPortal
    {
        public P10001999()
        {
            Init(10001999, 50150000, 130, 252, 130, 252);
        }
    }


    //原始地圖:50147000	次元南部地牢B3F
    //目標地圖:50150000	次元马尔科特码头
    //目標坐標:
    public class P10001991 : RandomPortal
    {
        public P10001991()
        {
            Init(10001991, 50150000, 130, 252, 130, 252);
        }
    }

    //原始地圖:50150000	次元马尔科特码头
    //目標地圖:50147000	次元南部地牢B3F
    //目標坐標:
    public class P10001992 : RandomPortal
    {
        public P10001992()
        {
            Init(10001992, 50147000, 150, 247, 150, 247);
        }
    }
}