using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript.M50012000
{
    public class S11001207 : Event
    {
        public S11001207()
        {
            this.EventID = 11001207;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<LV75_Clothes> LV75_Clothes_mask = pc.CMask["LV75_Clothes"];

            Say(pc, 131, "這是！？$R;" +
                "您用賜給您的火鳳凰在幹什麽！？$R;");
            Say(pc, 11001206, 131, "字體好像很大喔！$R;" +
                "得基利！$R;" +
                "$P……爲什麽到這裡來呀?$R;");
            Say(pc, 131, "先回答我的問題吧！$R;");
            Say(pc, 11001206, 131, "哈哈！是！$R;" +
                "是惡娃阿……$R;" +
                "$R有很多種……$R;");
            Say(pc, 131, "回答是遐奇！$R;");
            Say(pc, 11001206, 131, "嗯！$R;" +
                "$R看過火鳳凰的實力了嗎？$R;" +
                "在跟比較強的冒險者戰鬥吧！$R;");
            Say(pc, 131, "$R看過火鳳凰的實力？還有呢？$R;");
            Say(pc, 11001206, 131, "兩……$R;" +
                "不會太強求嗎？$R;" +
                "$R這火焰能燃燒天空阿$R;" +
                "所以…6公主她們……$R;" +
                "想跟妹妹們炫耀呀$R;" +
                "$P但是平時一樣要像酷酷…$R;" +
                "看起來一點都不強阿$R;" +
                "$R跟比較強的敵人戰鬥$R;" +
                "應該讓對方看看本性的……$R;");
            Say(pc, 131, "只是！$R;" +
                "$R像您這樣不濟的人，$R;" +
                "也可以出冒險者傳記嗎？$R;");
            Say(pc, 11001206, 131, "嗚嗚……$R;");
            Say(pc, 131, "這火鳳凰是我們一族的守護神唷$R;" +
                "$R當您身體遇到危險的時候$R;" +
                "就會把那股力量解放！$R;" +
                "$P把那個，作爲自己的興趣$R;" +
                "打的話都是白打！$R;" +
                "$P加米加米加米加米……$R;");
            Say(pc, 11001206, 131, "紅豆蘸料，紅豆蘸料！$R;" +
                "對不起喔！$R;");
            Say(pc, 131, "加米加米，加米加米……$R;" +
                "加米加米，加米加米……$R;" +
                "$P……$R;");
            Say(pc, 0, 131, "一段時間後……$R;", "");

            Say(pc, 131, "在冒險者傳記，加上您的名字吧！$R;" +
                pc.Name + " 是您的名字吧？……$R;");

            Say(pc, 131, pc.Name + "傳$R;" +
                "給我們的孫子帶來的麻煩$R;" +
                "真是對不起呢$R;" +
                "$P從現在開始，要充分的注意阿$R;" +
                "一定要原諒(許可)唷……$R;" +
                "$R喂，您也是呀！$R;");
            Say(pc, 11001206, 131, "對不起，冒險者傳記$R;");
            Say(pc, 131, "那爲什麽沒有把火鳳凰打倒阿?$R;");
            switch (Select(pc, "爲什麽沒有把火鳳凰打倒呢?", "", "因爲這好像是個陷阱呢……", "看見牠守護孩子的樣子……", "不知道牠在哪裡……"))
            {
                case 1:
                    Say(pc, 131, "真是慎重的性格阿！$R;" +
                        "$R真得非常優秀！$R;" +
                        "冒險者不這樣的話不行喔$R;");
                    break;
                case 2:
                    Say(pc, 131, "看見牠守護孩子的樣子$R;" +
                        "就不忍心把牠打倒阿$R;" +
                        "$R真得非常優秀！$R;" +
                        "怎樣看都是個善良的人唷！$R;");
                    break;
                case 3:
                    Say(pc, 131, "那敏銳的靈感！$R;" +
                        "$R真得非常優秀！$R;" +
                        "是一開始就擁有的才能吧！$R;");
                    break;
            }
            Say(pc, 131, "的仙姬美$R;" +
                "這位是傳授我們一族秘笈的$R;" +
                "合適人選嗎？$R;");
            Say(pc, 11001206, 131, "阿…那個，那樣的話$R;" +
                "看起來也好像是呀！！$R;" +
                "$R又強悍又善良$R;" +
                "而且外型也不錯呢！$R;");
            Say(pc, 131, "臉……圓圓的吧……$R;" +
                "$R也好$R;" +
                "不是偶然的喔！優秀的冒險者傳記，$R;" +
                "找得好呢！$R;");

            Say(pc, 131, pc.Name + "殿。$R;" +
                "$R我們是從古代就開始製作盔甲的$R;" +
                "防具商店唷$R;" +
                "$P這是我們爲了努力跟魔物戰鬥$R;" +
                "的冒險者們，誠心誠意製作的喔$R;" +
                "$P不僅高防禦且容易使用$R;" +
                "$R是質量非常好的防具呀，$R使用者的評語也非常好喔$R;" +
                "不知不覺被稱爲傳説的技工呢$R;" +
                "$P我們知名度的提升$R;" +
                "市場價值也會提升呀$R;" +
                "$R在隊頭排隊購買防具的部分富翁$R;" +
                "都是濫購的$R;" +
                "$P而且把那些防具放在家裡只是裝飾$R;" +
                "沒有實際上的用途的話$R;" +
                "$R真是太不像樣了！$R;" +
                "$P所以我們只賣給真正需要的人$R;" +
                "要找出冒險者，直接賣給他們唷$R;");
            Say(pc, 11001206, 131, "那是代代相傳，女性的職責喔$R;" +
                "$R夜是為我們草$R;" +
                "找出優秀的冒險者唷$R;");
            Say(pc, 131, "一定要好好使用$R;" +
                "才可以收下我們的防具喔$R;");
            Say(pc, 11001206, 131, "草員向倉庫那邊托付了$R;" +
                "因爲要做防具$R;" +
                "先回到阿高普路斯吧$R;");
            Say(pc, 131, "這是仙姬美！$R;" +
                "講道還沒結束吧？$R;" +
                "$R請在那邊坐好吧！$R;");
            Say(pc, 131, "嗯！好像很大呢！$R;");
            Say(pc, 11001206, 131, "加米加米加米加米……$R;");
            Say(pc, 131, "(先回到阿高普路斯吧！)$R;");
            LV75_Clothes_mask.SetValue(LV75_Clothes.任務完成, true);
            Warp(pc, 10023000, 95, 165);
            //_0c89 = true;
            //WARP 1339
            //EVENTEND

        }
    }
}