using System;
using System.Collections.Generic;
using System.Text;

using SagaDB.Item;
using SagaDB.Actor;
using SagaMap.Scripting;

using SagaLib;
using SagaScript.Chinese.Enums;
namespace SagaScript
{
    public class P10000820 : RandomPortal
    {
        public P10000820()
        {
            Init(10000820, 10054001, 166, 251, 169, 253);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:謎之團要塞(10054001)
    //目標坐標:(166,251) ~ (169,253)

    public class P10000821 : RandomPortal
    {
        public P10000821()
        {
            Init(10000821, 10068000, 134, 2, 137, 4);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:榖倉地帶(10068000)
    //目標坐標:(134,2) ~ (137,4)

    public class P10000940 : RandomPortal
    {
        public P10000940()
        {
            Init(10000940, 30130000, 6, 9, 8, 10);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特管理局(30130000)
    //目標坐標:(6,9) ~ (8,10)

    public class P10000941 : RandomPortal
    {
        public P10000941()
        {
            Init(10000941, 10057000, 171, 83, 172, 84);
        }
    }
    //原始地圖:帕斯特管理局(30130000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(171,83) ~ (172,84)

    public class P10000942 : RandomPortal
    {
        public P10000942()
        {
            Init(10000942, 30131000, 5, 9, 7, 10);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:綠色防備軍本部(30131000)
    //目標坐標:(5,9) ~ (7,10)

    public class P10000943 : RandomPortal
    {
        public P10000943()
        {
            Init(10000943, 10057000, 26, 101, 29, 103);
        }
    }
    //原始地圖:綠色防備軍本部(30131000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(26,101) ~ (29,103)

    public class P10000944 : RandomPortal
    {
        public P10000944()
        {
            Init(10000944, 30134000, 4, 15, 5, 16);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:馬廄(30134000)
    //目標坐標:(4,15) ~ (5,16)

    public class P10000945 : RandomPortal
    {
        public P10000945()
        {
            Init(10000945, 10057000, 29, 67, 30, 69);
        }
    }
    //原始地圖:馬廄(30134000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(29,67) ~ (30,69)

    public class P10000946 : RandomPortal
    {
        public P10000946()
        {
            Init(10000946, 30134001, 4, 15, 5, 16);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:馬廄(30134001)
    //目標坐標:(4,15) ~ (5,16)

    public class P10000947 : RandomPortal
    {
        public P10000947()
        {
            Init(10000947, 10057000, 200, 57, 202, 58);
        }
    }
    //原始地圖:馬廄(30134001)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(200,57) ~ (202,58)

    public class P10000948 : RandomPortal
    {
        public P10000948()
        {
            Init(10000948, 30132000, 6, 11, 6, 11);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:農夫行會總部(30132000)
    //目標坐標:(6,11) ~ (6,11)

    public class P10000949 : RandomPortal
    {
        public P10000949()
        {
            Init(10000949, 10057000, 172, 100, 173, 101);
        }
    }
    //原始地圖:農夫行會總部(30132000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(172,100) ~ (173,101)

    public class P10000950 : RandomPortal
    {
        public P10000950()
        {
            Init(10000950, 30133000, 5, 10, 5, 10);
        }
    }
    //原始地圖:農夫行會總部(30132000)
    //目標地圖:農夫行會會長的房間(30133000)
    //目標坐標:(5,10) ~ (5,10)

    public class P10000951 : RandomPortal
    {
        public P10000951()
        {
            Init(10000951, 30132000, 6, 2, 6, 2);
        }
    }
    //原始地圖:農夫行會會長的房間(30133000)
    //目標地圖:農夫行會總部(30132000)
    //目標坐標:(6,2) ~ (6,2)

    public class P10000952 : RandomPortal
    {
        public P10000952()
        {
            Init(10000952, 30091000, 6, 15, 6, 15);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:學校(30091000)
    //目標坐標:(6,15) ~ (6,15)

    public class P10000953 : RandomPortal
    {
        public P10000953()
        {
            Init(10000953, 10057000, 147, 117, 148, 118);
        }
    }
    //原始地圖:學校(30091000)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(147,117) ~ (148,118)

    public class P10000956 : RandomPortal
    {
        public P10000956()
        {
            Init(10000956, 30001002, 2, 4, 2, 4);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特魔法商店(30001002)
    //目標坐標:(2,4) ~ (2,4)

    public class P10000957 : RandomPortal
    {
        public P10000957()
        {
            Init(10000957, 10057000, 128, 106, 128, 106);
        }
    }
    //原始地圖:帕斯特魔法商店(30001002)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(128,106) ~ (128,106)

    public class P10000958 : RandomPortal
    {
        public P10000958()
        {
            Init(10000958, 30002001, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特的小屋(30002001)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000959 : RandomPortal
    {
        public P10000959()
        {
            Init(10000959, 10057000, 94, 114, 94, 114);
        }
    }
    //原始地圖:帕斯特的小屋(30002001)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(94,114) ~ (94,114)

    public class P10000960 : RandomPortal
    {
        public P10000960()
        {
            Init(10000960, 30010006, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特咖啡館(30010006)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000961 : RandomPortal
    {
        public P10000961()
        {
            Init(10000961, 10057000, 142, 108, 142, 108);
        }
    }
    //原始地圖:帕斯特咖啡館(30010006)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(142,108) ~ (142,108)

    public class P10000962 : RandomPortal
    {
        public P10000962()
        {
            Init(10000962, 30010007, 3, 5, 3, 5);
        }
    }
    //原始地圖:謎之團要塞(10054000)
    //目標地圖:要塞的咖啡館(30010007)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000963 : RandomPortal
    {
        public P10000963()
        {
            Init(10000963, 10054000, 143, 138, 143, 138);
        }
    }
    //原始地圖:要塞的咖啡館(30010007)
    //目標地圖:謎之團要塞(10054000)
    //目標坐標:(143,138) ~ (143,138)

    public class P10000964 : RandomPortal
    {
        public P10000964()
        {
            Init(10000964, 30011005, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特鑑定所(30011005)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000965 : RandomPortal
    {
        public P10000965()
        {
            Init(10000965, 10057000, 128, 100, 128, 100);
        }
    }
    //原始地圖:帕斯特鑑定所(30011005)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(128,100) ~ (128,100)

    public class P10000966 : RandomPortal
    {
        public P10000966()
        {
            Init(10000966, 30012003, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特武器商店(30012003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000967 : RandomPortal
    {
        public P10000967()
        {
            Init(10000967, 10057000, 119, 100, 119, 100);
        }
    }
    //原始地圖:帕斯特武器商店(30012003)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(119,100) ~ (119,100)

    public class P10000970 : RandomPortal
    {
        public P10000970()
        {
            Init(10000970, 30020005, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特裁縫店(30020005)
    //目標坐標:(3,5) ~ (3,5)
    public class P10000971 : RandomPortal
    {
        public P10000971()
        {
            Init(10000971, 10057000, 119, 107, 119, 107);
        }
    }
    //原始地圖:帕斯特裁縫店(30020005)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(119,107) ~ (119,107)

    public class P10000972 : RandomPortal
    {
        public P10000972()
        {
            Init(10000972, 30021003, 3, 5, 3, 5);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特寶石商店(30021003)
    //目標坐標:(3,5) ~ (3,5)

    public class P10000973 : RandomPortal
    {
        public P10000973()
        {
            Init(10000973, 10057000, 141, 86, 141, 86);
        }
    }
    //原始地圖:帕斯特寶石商店(30021003)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(141,86) ~ (141,86)

    public class P10000974 : RandomPortal
    {
        public P10000974()
        {
            Init(10000974, 30060005, 4, 7, 4, 7);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特商店(30060005)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000975 : RandomPortal
    {
        public P10000975()
        {
            Init(10000975, 10057000, 141, 96, 141, 96);
        }
    }
    //原始地圖:帕斯特商店(30060005)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(141,96) ~ (141,96)

    public class P10000976 : RandomPortal
    {
        public P10000976()
        {
            Init(10000976, 30060006, 4, 7, 4, 7);
        }
    }
    //原始地圖:帕斯特市(10057000)
    //目標地圖:帕斯特商店(30060006)
    //目標坐標:(4,7) ~ (4,7)

    public class P10000977 : RandomPortal
    {
        public P10000977()
        {
            Init(10000977, 10057000, 123, 120, 123, 120);
        }
    }
    //原始地圖:帕斯特商店(30060006)
    //目標地圖:帕斯特市(10057000)
    //目標坐標:(123,120) ~ (123,120)

}