using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M10065000
{
    public class S13000291 : Event
    {
        public S13000291()
        {
            this.EventID = 13000291;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<sdj> sdj_mask = new BitMask<sdj>(pc.CMask["sdj"]);
            //int selection;
            if (sdj_mask.Test(sdj.杂学3))
            {
                return;
            }
            if (sdj_mask.Test(sdj.杂学1))
            {
                if (sdj_mask.Test(sdj.杂学2))
                {
                    Say(pc, 164, "！？！？$R;" +
                    "あの２人に勝ったのか……。$R;" +
                    "俺のも解け……。$R;" +
                    "勝ったら、とっておき……。やる。$R;", "冬の雑学チャンピオン");
                    if (Select(pc, "チャレンジする？", "", "やる……。", "やらない……。") == 2)
                    {
                        Say(pc, 162, "いくぞ……。$R;", "冬の雑学チャンピオン");

                        Say(pc, 131, "南極にある「ドンファン池」$R;" +
                        "この池は、凍らないのですが、$R;" +
                        "なぜでしょう？$R;", "冬の雑学チャンピオン");
                        if (Select(pc, "どれにする？", "", "池と言われているだけで、水がない", "海水の6倍の塩分濃度だから", "南極でも暖かい場所にあるから") == 1)
                        {
                            Say(pc, 164, "正解……。$R;" +
                            "次……。$R;", "冬の雑学チャンピオン");

                            Say(pc, 131, "1月はどれ？$R;", "冬の雑学チャンピオン");
                            if (Select(pc, "どれにする？", "", "睦月", "長月", "水無月") == 1)
                            {
                                Say(pc, 164, "正解……。$R;" +
                                "次……。$R;", "冬の雑学チャンピオン");

                                Say(pc, 131, "次のうちで、冬に一番に$R;" +
                                "ならないのはどれ？$R;", "冬の雑学チャンピオン");
                               if( Select(pc, "どれにする？", "", "晴れの日数", "ガソリン購入額", "死亡者数")==2)
                               {
                                   Say(pc, 164, "正解……。$R;" +
                                   "次……。$R;", "冬の雑学チャンピオン");

                                   Say(pc, 131, "氷に砂糖をかけるとどうなる？$R;", "冬の雑学チャンピオン");
                                   if (Select(pc, "どれにする？", "", "温度が下がる", "特になにも起こらない", "氷が白く濁る")==1)
                                   {
                                       Say(pc, 164, "正解……。$R;" +
                                       "次……。$R;", "冬の雑学チャンピオン");

                                       Say(pc, 131, "風のない冷え込んだ晴天の朝や夕方に$R;" +
                                       "太陽光がタイヤモンドダストに当たり、$R;" +
                                       "屈折して空気中に光の柱が現れます。$R;" +
                                       "この現象はなんていう？$R;", "冬の雑学チャンピオン");
                                       if (Select(pc, "どれにする？", "", "ブロッケン現象", "サンピラー現象", "サンポスト現象") == 2)
                                       {
                                           Say(pc, 164, "正解……。$R;" +
                                           "次……。$R;", "冬の雑学チャンピオン");

                                           Say(pc, 131, "ウィンタースポーツ、スノーボードの$R;" +
                                           "スタイルで実際にはない呼び名は？$R;", "冬の雑学チャンピオン");
                                           if (Select(pc, "どれにする？", "", "レギュラー", "スタンダード", "グーフィー") == 2)
                                           {

                                               Say(pc, 164, "正解……。$R;" +
                                               "次……。$R;", "冬の雑学チャンピオン");

                                               Say(pc, 131, "神話においてオーロラは、夜空を駆ける$R;" +
                                               "ワルキューレたちの何の輝きだとされる？$R;", "冬の雑学チャンピオン");
                                               if(Select(pc, "どれにする？", "", "匂い", "甲冑", "髪")==2)
                                               {
                                                   Say(pc, 164, "正解……。$R;" +
                                                   "次……。$R;", "冬の雑学チャンピオン");

                                                   Say(pc, 131, "雨の中を移動する場合、$R;" +
                                                   "走るのと歩くのでは、$R;" +
                                                   "どちらが濡れにくい？$R;", "冬の雑学チャンピオン");
                                                   if (Select(pc, "どれにする？", "", "どちらも変わらない", "走る", "歩く") == 2)
                                                   {
                                                       Say(pc, 164, "正解……。$R;" +
                                                       "次……。$R;", "冬の雑学チャンピオン");

                                                       Say(pc, 131, "雪のヨの部分は何を表している？$R;", "冬の雑学チャンピオン");
                                                       if (Select(pc, "どれにする？", "", "地面に雪が降り積もるさま", "手", "ふわふわ感") == 2)
                                                       {
                                                           Say(pc, 164, "正解……。$R;" +
                                                           "次……。$R;", "冬の雑学チャンピオン");

                                                           Say(pc, 131, "昭和基地へはがきを送るとき$R;" +
                                                           "いくらで送れる？$R;", "冬の雑学チャンピオン");
                                                           if (Select(pc, "どれにする？", "", "10080円", "送れない", "50円") == 3)
                                                           {
                                                               Say(pc, 164, "正解……。$R;" +
                                                               "次……。$R;", "冬の雑学チャンピオン");

                                                               Say(pc, 158, "う……。$R;" +
                                                               "全員の問題が全て解かれた……。・$R;" +
                                                               "とっておきやる……。$R;", "冬の雑学チャンピオン");
                                                               Say(pc, 131, "これが、とっておきだ……。$R;", "冬の雑学チャンピオン");
                                                               ShowEffect(pc, 13000291, 9911);
                                                               ShowEffect(pc, 13000291, 9916);
                                                               Say(pc, 0, 131, "「イノセントサンタ（上）」$R;" +
                                                               "「イノセントサンタ（下）」$R;" +
                                                               "を手に入れた！$R;", " ");
                                                               GiveItem(pc, 60121300, 1);
                                                               GiveItem(pc, 50208000, 1);
                                                               sdj_mask.SetValue(sdj.杂学3, true);
                                                               return;
                                                               
                                                           }
                                                       }
                                                   }
                                               }
                                           }
                                       }
                                   }
                               }
                            }
                        }
                        错误(pc);
                    }
                    Say(pc, 112, "……。$R;" +
                    "やらないのか……。$R;" +
                    "俺ここにいる……。$R;" +
                    "暇なとき来い……。$R;", "冬の雑学チャンピオン");
                    return;
                }
                Say(pc, 158, "……。$R;" +
                "旁边2个人干掉了在来找我？$R;", "冬の雑学チャンピオン");
                return;
            }
            Say(pc, 158, "……。$R;" +
            "旁边2个人干掉了在来找我？$R;", "冬の雑学チャンピオン");
            return;
        }
        void 错误(ActorPC pc)
        {
            Say(pc, 131, "……。$R;" +
            "違うな……。$R;" +
            "何回でも挑戦受ける……。$R;" +
            "また来い……。$R;", "冬の雑学チャンピオン");
        }
    }
}