using System;
using System.Collections.Generic;
using System.Text;
using SagaLib;
using SagaDB.Actor;
using SagaMap.Scripting;
using SagaScript.Chinese.Enums;
namespace SagaScript.M10065000
{
    public class S13000292 : Event
    {
        public S13000292()
        {
            this.EventID = 13000292;
        }

        public override void OnEvent(ActorPC pc)
        {
            BitMask<sdj> sdj_mask = new BitMask<sdj>(pc.CMask["sdj"]);
            //int selection;
            if (sdj_mask.Test(sdj.杂学2))
            {
                Say(pc, 158, "もう出せる問題がないよぉ……。$R;" +
                "でも、僕には仲間が居るんだっ！$R;" +
                "他のヤツの問題ならどうかな？$R;", "普通の雑学キング");
                return;
            }
            Say(pc, 164, "おいっす！$R;" +
            "オレがいろいろ問題を出すから$R;" +
            "全部解いてみてよ♪$R;" +
            "おっ！$R;" +
            "他のヤツをコテンパンにしたみたいだね！$R;" +
            "でも、僕のは簡単にはいかないからね♪$R;" +
            "全部解いたらとっておきをあげるよ！$R;", "普通の雑学キング");
            if (Select(pc, "チャレンジする？", "", "やってみよう♪", "今日はやることがいっぱいでね！") == 1)
            {

                Say(pc, 162, "それじゃあ、問題出すよ～♪$R;", "普通の雑学キング");

                Say(pc, 131, "ヨーロッパで古くからの風習で、$R;" +
                "花嫁が身に着けると幸せになれるという$R;" +
                "「サムシングフォー(四つのもの)」。$R;" +
                "「青いもの」「古いもの」「新しいもの」$R;" +
                "残るはなに？$R;", "普通の雑学キング");
                if (Select(pc, "どれにする？", "", "レースのもの", "花柄のもの", "借りたもの") == 3)
                {
                    Say(pc, 164, "おっ！$R;" +
                    "正解☆$R;" +
                    "次の問題はどうかな？$R;", "普通の雑学キング");

                    Say(pc, 131, "仙人掌なんて読む？$R;", "普通の雑学キング");
                    if (Select(pc, "どれにする？", "", "しゃくやく", "サボテン", "ザクロ") == 2)
                    {
                        Say(pc, 164, "おっ！$R;" +
                        "正解☆$R;" +
                        "次の問題はどうかな？$R;", "普通の雑学キング");

                        Say(pc, 131, "ビリヤードの玉を突く道具のことを$R;" +
                        "なんと言う？$R;", "普通の雑学キング");
                        if (Select(pc, "どれにする？", "", "キュー", "スティック", "突っつき棒") == 1)
                        {
                            Say(pc, 164, "おっ！$R;" +
                            "正解☆$R;" +
                            "次の問題はどうかな？$R;", "普通の雑学キング");

                            Say(pc, 131, "肉じゃがを日本で初めてつくった人物は？$R;", "普通の雑学キング");
                            if (Select(pc, "どれにする？", "", "坂本竜馬", "板垣退助", "東郷平八郎") == 3)
                            {
                                Say(pc, 164, "おっ！$R;" +
                                "正解☆$R;" +
                                "次の問題はどうかな？$R;", "普通の雑学キング");

                                Say(pc, 131, "鯨とイルカの違いは？$R;", "普通の雑学キング");
                                if (Select(pc, "どれにする？", "", "大きさが違うだけ", "体の中にある器官が違う", "生息している水深の違い") == 1)
                                {
                                    Say(pc, 164, "おっ！$R;" +
                                    "正解☆$R;" +
                                    "次の問題はどうかな？$R;", "普通の雑学キング");

                                    Say(pc, 131, "円周率の小数点以下6桁目の数字は何？$R;", "普通の雑学キング");
                                    if (Select(pc, "どれにする？", "", "2", "9", "5")==1)
                                    {
                                        Say(pc, 164, "おっ！$R;" +
                                        "正解☆$R;" +
                                        "次の問題はどうかな？$R;", "普通の雑学キング");

                                        Say(pc, 131, "火山でできた地形に水がたまり、$R;" +
                                        "湖になったのをなんという？$R;", "普通の雑学キング");
                                        if (Select(pc, "どれにする？", "", "カステラ湖", "カルデラ湖", "バルデラ湖") == 2)
                                        {
                                            Say(pc, 164, "おっ！$R;" +
                                            "正解☆$R;" +
                                            "次の問題はどうかな？$R;", "普通の雑学キング");

                                            Say(pc, 131, "ボードゲーム「オセロ」の発祥国は？$R;", "普通の雑学キング");
                                            if (Select(pc, "どれにする？", "", "日本", "イギリス", "ドイツ") == 1)
                                            {
                                                Say(pc, 164, "おっ！$R;" +
                                                "正解☆$R;" +
                                                "次の問題はどうかな？$R;", "普通の雑学キング");

                                                Say(pc, 131, "水の体積が最小になるのは$R;" +
                                                "摂氏何度のときでしょう？$R;", "普通の雑学キング");
                                                if (Select(pc, "どれにする？", "", "2度", "4度", "0度") == 2)
                                                {
                                                    Say(pc, 164, "おっ！$R;" +
                                                    "正解☆$R;" +
                                                    "次の問題はどうかな？$R;", "普通の雑学キング");

                                                    Say(pc, 131, "「百舌」はなんと読むのでしょう？$R;", "普通の雑学キング");
                                                    if(Select(pc, "どれにする？", "", "ももした", "かきつばた", "もず")==3)
                                                    {
                                                        Say(pc, 164, "おっ！$R;" +
                                                        "正解☆$R;" +
                                                        "次の問題はどうかな？$R;", "普通の雑学キング");

                                                        Say(pc, 158, "って、もう出せる問題ないじゃん！？$R;" +
                                                        "うぅ……。$R;" +
                                                        "ボクの問題は全部解けたみたいだね……。$R;" +
                                                        "でも、残りの仲間の分も正解しなきゃ$R;" +
                                                        "ダメなんだから！$R;" +
                                                        "せいぜい頑張ってね～♪$R;", "普通の雑学キング");
                                                        sdj_mask.SetValue(sdj.杂学2, true);
                                                        return;
                                                    }
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }
}